StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE9x.h
    struct {
      __IOM uint32_t TIM1_BRG   : 3;            /*!< [2..0] HCLK freq divider to get TIM1_CLOCK, [/1, /2, /4 .. /128]          */
      __IM  uint32_t            : 5;
      __IOM uint32_t TIM2_BRG   : 3;            /*!< [10..8] HCLK freq divider to get TIM2_CLOCK, [/1, /2, /4 ..
                                                     /128]                                                                     */
      __IM  uint32_t            : 5;
      __IOM uint32_t TIM3_BRG   : 3;            /*!< [18..16] HCLK freq divider to get TIM3_CLOCK, [/1, /2, /4 ..
                                                     /128]                                                                     */
      __IM  uint32_t            : 5;
      __IOM uint32_t TIM1_CLK_EN : 1;           /*!< [24..24] TIM1_CLOCK enable                                                */
      __IOM uint32_t TIM2_CLK_EN : 1;           /*!< [25..25] TIM2_CLOCK enable                                                */
      __IOM uint32_t TIM3_CLK_EN : 1;           /*!< [26..26] TIM3_CLOCK enable                                                */
    } TIM_CLOCK_b;
  } ;
  
  union {
    __IOM uint32_t UART_CLOCK;                  /*!< (@ 0x00000028) UART's Clock Control                                       */
    
    struct {
      __IOM uint32_t UART1_BRG  : 3;            /*!< [2..0] HCLK freq divider to get UART1_CLOCK, [/1, /2, /4 ..
                                                     /128]                                                                     */
      __IM  uint32_t            : 5;
      __IOM uint32_t UART2_BRG  : 3;            /*!< [10..8] HCLK freq divider to get UART2_CLOCK, [/1, /2, /4 ..
                                                     /128]                                                                     */
      __IM  uint32_t            : 13;
      __IOM uint32_t UART1_CLK_EN : 1;          /*!< [24..24] UART1_CLOCK enable                                               */
      __IOM uint32_t UART2_CLK_EN : 1;          /*!< [25..25] UART2_CLOCK enable                                               */
    } UART_CLOCK_b;
  } ;
  
  union {
    __IOM uint32_t SSP_CLOCK;                   /*!< (@ 0x0000002C) SSP's Clock Control                                        */
    
    struct {
      __IOM uint32_t SSP1_BRG   : 3;            /*!< [2..0] HCLK freq divider to get SSP1_CLOCK, [/1, /2, /4 .. /128]          */
      __IM  uint32_t            : 5;
      __IOM uint32_t SSP2_BRG   : 3;            /*!< [10..8] HCLK freq divider to get SSP2_CLOCK, [/1, /2, /4 ..
                                                     /128]                                                                     */
      __IM  uint32_t            : 5;
      __IOM uint32_t SSP3_BRG   : 3;            /*!< [18..16] HCLK freq divider to get SSP3_CLOCK, [/1, /2, /4 ..
                                                     /128]                                                                     */
      __IM  uint32_t            : 5;
      __IOM uint32_t SSP1_CLK_EN : 1;           /*!< [24..24] SSP1_CLOCK Enable                                                */
      __IOM uint32_t SSP2_CLK_EN : 1;           /*!< [25..25] SSP2_CLOCK Enable                                                */
      __IOM uint32_t SSP3_CLK_EN : 1;           /*!< [26..26] SSP3_CLOCK Enable                                                */
    } SSP_CLOCK_b;
  } ;
} MDR_RST_CLOCK_Type;                           /*!< Size = 48 (0x30)                                                          */



/* =========================================================================================================================== */
/* ================                                         MDR_WWDT                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Window Watchdog Timer (MDR_WWDT)
  */

typedef struct {                                /*!< (@ 0x40060000) MDR_WWDT Structure                                         */
  
  union {
    __IOM uint32_t CR;                          /*!< (@ 0x00000000) WWDT Control register                                      */
    
    struct {
      __IOM uint32_t T          : 7;            /*!< [6..0] Counter                                                            */
      __IOM uint32_t WDGA       : 1;            /*!< [7..7] Enable                                                             */
    } CR_b;
  } ;
  
  union {
    __IOM uint32_t CFR;                         /*!< (@ 0x00000004) WWDT Config register                                       */
    
    struct {
      __IOM uint32_t W          : 7;            /*!< [6..0] Window value                                                       */
      __IOM uint32_t WGTB       : 2;            /*!< [8..7] Clock Divider                                                      */
      __IOM uint32_t EWI        : 1;            /*!< [9..9] Early Window Interrupt                                             */
    } CFR_b;
  } ;
  
  union {
    __IOM uint32_t SR;                          /*!< (@ 0x00000008) WWDT Status register                                       */
    
    struct {
      __IOM uint32_t EWIF       : 1;            /*!< [0..0] Early Window Flag                                                  */
    } SR_b;
  } ;
} MDR_WWDT_Type;                                /*!< Size = 12 (0xc)                                                           */



/* =========================================================================================================================== */
/* ================                                         MDR_IWDT                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Independent Watchdog Timer (MDR_IWDT)
  */

typedef struct {                                /*!< (@ 0x40068000) MDR_IWDT Structure                                         */
  
  union {
    __OM  uint32_t KR;                          /*!< (@ 0x00000000) Key register                                               */
    
