StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE9x.h
    struct {
      __OM  uint32_t KEY        : 16;           /*!< [15..0] Enable, start and reload control                                  */
    } KR_b;
  } ;
  
  union {
    __IOM uint32_t PR;                          /*!< (@ 0x00000004) Clock Prescaler register                                   */
    
    struct {
      __IOM uint32_t PR         : 3;            /*!< [2..0] Prescaler Register                                                 */
    } PR_b;
  } ;
  
  union {
    __IOM uint32_t RLR;                         /*!< (@ 0x00000008) Reload Period Register                                     */
    
    struct {
      __IOM uint32_t PRL        : 12;           /*!< [11..0] Timer Period Value                                                */
    } RLR_b;
  } ;
  
  union {
    __IM  uint32_t SR;                          /*!< (@ 0x0000000C) Status Regster                                             */
    
    struct {
      __IM  uint32_t PVU        : 1;            /*!< [0..0] PR busy                                                            */
      __IM  uint32_t RVU        : 1;            /*!< [1..1] PRL busy                                                           */
    } SR_b;
  } ;
} MDR_IWDT_Type;                                /*!< Size = 16 (0x10)                                                          */



/* =========================================================================================================================== */
/* ================                                          MDR_ADC                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Successive Approximation ADC (MDR_ADC)
  */

typedef struct {                                /*!< (@ 0x40088000) MDR_ADC Structure                                          */
  
  union {
    __IOM uint32_t ADC1_Cfg;                    /*!< (@ 0x00000000) ADC1 config register                                       */
    
    struct {
      __IOM uint32_t ADON       : 1;            /*!< [0..0] Enable ADC                                                         */
      __IOM uint32_t GO         : 1;            /*!< [1..1] Start single ADC mesurement                                        */
      __IOM uint32_t CLKS       : 1;            /*!< [2..2] Select Clock                                                       */
      __IOM uint32_t SAMPLE     : 1;            /*!< [3..3] Single or Continuous measurement                                   */
      __IOM uint32_t CHS        : 5;            /*!< [8..4] Active channel select                                              */
      __IOM uint32_t CHCH       : 1;            /*!< [9..9] Channel switching enable                                           */
      __IOM uint32_t RGNC       : 1;            /*!< [10..10] Signal limiters enable                                           */
      __IOM uint32_t M_REF      : 1;            /*!< [11..11] Signal amplitude reference                                       */
      __IOM uint32_t DIV_CLK    : 4;            /*!< [15..12] Divider for CPU_Clock usage                                      */
      __IOM uint32_t SYNC_CONV  : 1;            /*!< [16..16] ADC1 and ADC2 sync measurement                                   */
      __IOM uint32_t TS_EN      : 1;            /*!< [17..17] Thermosensor enable                                              */
      __IOM uint32_t TS_BUFF_EN : 1;            /*!< [18..18] Thermosensor buffer enable                                       */
      __IOM uint32_t SEL_TS     : 1;            /*!< [19..19] Output temperature from Thermosensor                             */
      __IOM uint32_t SEL_VREF   : 1;            /*!< [20..20] Output Vref=1.23 from Thermosensor                               */
      __IOM uint32_t TR         : 4;            /*!< [24..21] Trim Vref from Thermosensor                                      */
      __IOM uint32_t Delay_GO   : 3;            /*!< [27..25] Delay after channels switching in CPU_CLK                        */
      __IOM uint32_t Delay_ADC  : 4;            /*!< [31..28] Delay between ADC1 and ADC2 start                                */
    } ADC1_Cfg_b;
  } ;
  
  union {
    __IOM uint32_t ADC2_Cfg;                    /*!< (@ 0x00000004) ADC2 config register                                       */
    
    struct {
      __IOM uint32_t ADON       : 1;            /*!< [0..0] Enable ADC                                                         */
      __IOM uint32_t GO         : 1;            /*!< [1..1] Start single ADC mesurement                                        */
      __IOM uint32_t CLKS       : 1;            /*!< [2..2] Select Clock                                                       */
      __IOM uint32_t SAMPLE     : 1;            /*!< [3..3] Single or Continuous measurement                                   */
      __IOM uint32_t CHS        : 5;            /*!< [8..4] Active channel select                                              */
      __IOM uint32_t CHCH       : 1;            /*!< [9..9] Channel switching enable                                           */
      __IOM uint32_t RGNC       : 1;            /*!< [10..10] Signal limiters enable                                           */
      __IOM uint32_t M_REF      : 1;            /*!< [11..11] Signal amplitude reference                                       */
      __IOM uint32_t DIV_CLK    : 4;            /*!< [15..12] Divider for CPU_Clock usage                                      */
      __IM  uint32_t            : 1;
      __IOM uint32_t ADC1_OP    : 1;            /*!< [17..17] ADC1 Setpoint Vref source                                        */
      __IOM uint32_t ADC2_OP    : 1;            /*!< [18..18] ADC2 Setpoint Vref source                                        */
      __IM  uint32_t            : 6;
      __IOM uint32_t Delay_GO   : 3;            /*!< [27..25] Delay after channels switching in CPU_CLK                        */
    } ADC2_Cfg_b;
  } ;
  
  union {
    __IOM uint32_t ADC1_H_Level;                /*!< (@ 0x00000008) ADC High limit                                             */
    
