StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE9x.h
    struct {
      __IOM uint32_t Level      : 12;           /*!< [11..0] Signal limit level                                                */
    } ADC1_H_Level_b;
  } ;
  
  union {
    __IOM uint32_t ADC2_H_Level;                /*!< (@ 0x0000000C) ADC High limit                                             */
    
    struct {
      __IOM uint32_t Level      : 12;           /*!< [11..0] Signal limit level                                                */
    } ADC2_H_Level_b;
  } ;
  
  union {
    __IOM uint32_t ADC1_L_Level;                /*!< (@ 0x00000010) ADC Low limit                                              */
    
    struct {
      __IOM uint32_t Level      : 12;           /*!< [11..0] Signal limit level                                                */
    } ADC1_L_Level_b;
  } ;
  
  union {
    __IOM uint32_t ADC2_L_Level;                /*!< (@ 0x00000014) ADC High limit                                             */
    
    struct {
      __IOM uint32_t Level      : 12;           /*!< [11..0] Signal limit level                                                */
    } ADC2_L_Level_b;
  } ;
  
  union {
    __IM  uint32_t ADC1_RESULT;                 /*!< (@ 0x00000018) ADC result register                                        */
    
    struct {
      __IM  uint32_t Value      : 12;           /*!< [11..0] Channel signal value                                              */
      __IM  uint32_t            : 4;
      __IM  uint32_t Channel    : 5;            /*!< [20..16] Channel index                                                    */
    } ADC1_RESULT_b;
  } ;
  
  union {
    __IM  uint32_t ADC2_RESULT;                 /*!< (@ 0x0000001C) ADC result register                                        */
    
    struct {
      __IM  uint32_t Value      : 12;           /*!< [11..0] Channel signal value                                              */
      __IM  uint32_t            : 4;
      __IM  uint32_t Channel    : 5;            /*!< [20..16] Channel index                                                    */
    } ADC2_RESULT_b;
  } ;
  
  union {
    __IOM uint32_t ADC1_STATUS;                 /*!< (@ 0x00000020) ADC status register                                        */
    
    struct {
      __IOM uint32_t Overwrite  : 1;            /*!< [0..0] Result overwritten flag                                            */
      __IOM uint32_t AWOIFEN    : 1;            /*!< [1..1] Signal is out of limiters range                                    */
      __IOM uint32_t EOCIF      : 1;            /*!< [2..2] Result ready to read                                               */
      __IOM uint32_t AWOIF_IE   : 1;            /*!< [3..3] Enable IRQ by AWOIFEN flag                                         */
      __IOM uint32_t EOCIF_EN   : 1;            /*!< [4..4] Enable IRQ by EOCIF flag                                           */
    } ADC1_STATUS_b;
  } ;
  
  union {
    __IOM uint32_t ADC2_STATUS;                 /*!< (@ 0x00000024) ADC status register                                        */
    
    struct {
      __IOM uint32_t Overwrite  : 1;            /*!< [0..0] Result overwritten flag                                            */
      __IOM uint32_t AWOIFEN    : 1;            /*!< [1..1] Signal is out of limiters range                                    */
      __IOM uint32_t EOCIF      : 1;            /*!< [2..2] Result ready to read                                               */
      __IOM uint32_t AWOIF_IE   : 1;            /*!< [3..3] Enable IRQ by AWOIFEN flag                                         */
      __IOM uint32_t EOCIF_EN   : 1;            /*!< [4..4] Enable IRQ by EOCIF flag                                           */
    } ADC2_STATUS_b;
  } ;
  
  union {
    __IOM uint32_t ADC1_CHSEL;                  /*!< (@ 0x00000028) ADC channels select register                               */
    
    struct {
      __IOM uint32_t Channel_0  : 1;            /*!< [0..0] Signal on PD7, Ref+                                                */
      __IOM uint32_t Channel_1  : 1;            /*!< [1..1] Signal on PD8, Ref-                                                */
      __IOM uint32_t Channel_2  : 1;            /*!< [2..2] Signal on PD9                                                      */
      __IOM uint32_t Channel_3  : 1;            /*!< [3..3] Signal on PD10                                                     */
      __IOM uint32_t Channel_4  : 1;            /*!< [4..4] Signal on PD11                                                     */
      __IOM uint32_t Channel_5  : 1;            /*!< [5..5] Signal on PD12                                                     */
      __IOM uint32_t Channel_6  : 1;            /*!< [6..6] Signal on PD13                                                     */
      __IOM uint32_t Channel_7  : 1;            /*!< [7..7] Signal on PD14                                                     */
      __IOM uint32_t Channel_8  : 1;            /*!< [8..8] Signal on PD9                                                      */
      __IOM uint32_t Channel_9  : 1;            /*!< [9..9] Signal on PD10                                                     */
      __IOM uint32_t Channel_10 : 1;            /*!< [10..10] Signal on PD11                                                   */
      __IOM uint32_t Channel_11 : 1;            /*!< [11..11] Signal on PD12                                                   */
      __IOM uint32_t Channel_12 : 1;            /*!< [12..12] Signal on PD13                                                   */
      __IOM uint32_t Channel_13 : 1;            /*!< [13..13] Signal on PD14                                                   */
      __IOM uint32_t Channel_14 : 1;            /*!< [14..14] Signal on PD11                                                   */
      __IOM uint32_t Channel_15 : 1;            /*!< [15..15] Signal on PD12                                                   */
      __IM  uint32_t            : 14;
      __IOM uint32_t Channel_30 : 1;            /*!< [30..30] VRef from Thermosensor                                           */
      __IOM uint32_t Channel_31 : 1;            /*!< [31..31] Temperature from Thermosensor                                    */
    } ADC1_CHSEL_b;
  } ;
  
  union {
    __IOM uint32_t ADC2_CHSEL;                  /*!< (@ 0x0000002C) ADC channels select register                               */
    
