StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE9x.h
    struct {
      __IOM uint32_t Channel_0  : 1;            /*!< [0..0] Signal on PD7, Ref+                                                */
      __IOM uint32_t Channel_1  : 1;            /*!< [1..1] Signal on PD8, Ref-                                                */
      __IOM uint32_t Channel_2  : 1;            /*!< [2..2] Signal on PD9                                                      */
      __IOM uint32_t Channel_3  : 1;            /*!< [3..3] Signal on PD10                                                     */
      __IOM uint32_t Channel_4  : 1;            /*!< [4..4] Signal on PD11                                                     */
      __IOM uint32_t Channel_5  : 1;            /*!< [5..5] Signal on PD12                                                     */
      __IOM uint32_t Channel_6  : 1;            /*!< [6..6] Signal on PD13                                                     */
      __IOM uint32_t Channel_7  : 1;            /*!< [7..7] Signal on PD14                                                     */
      __IOM uint32_t Channel_8  : 1;            /*!< [8..8] Signal on PD9                                                      */
      __IOM uint32_t Channel_9  : 1;            /*!< [9..9] Signal on PD10                                                     */
      __IOM uint32_t Channel_10 : 1;            /*!< [10..10] Signal on PD11                                                   */
      __IOM uint32_t Channel_11 : 1;            /*!< [11..11] Signal on PD12                                                   */
      __IOM uint32_t Channel_12 : 1;            /*!< [12..12] Signal on PD13                                                   */
      __IOM uint32_t Channel_13 : 1;            /*!< [13..13] Signal on PD14                                                   */
      __IOM uint32_t Channel_14 : 1;            /*!< [14..14] Signal on PD11                                                   */
      __IOM uint32_t Channel_15 : 1;            /*!< [15..15] Signal on PD12                                                   */
      __IM  uint32_t            : 14;
      __IOM uint32_t Channel_30 : 1;            /*!< [30..30] VRef from Thermosensor                                           */
      __IOM uint32_t Channel_31 : 1;            /*!< [31..31] Temperature from Thermosensor                                    */
    } ADC2_CHSEL_b;
  } ;
} MDR_ADC_Type;                                 /*!< Size = 48 (0x30)                                                          */



/* =========================================================================================================================== */
/* ================                                          MDR_BKP                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Backup and RTC Control (MDR_BKP)
  */

typedef struct {                                /*!< (@ 0x400D8000) MDR_BKP Structure                                          */
  __IOM uint32_t  REG_00;                       /*!< (@ 0x00000000) User backup registers                                      */
  __IOM uint32_t  REG_01;                       /*!< (@ 0x00000004) User backup registers                                      */
  __IOM uint32_t  REG_02;                       /*!< (@ 0x00000008) User backup registers                                      */
  __IOM uint32_t  REG_03;                       /*!< (@ 0x0000000C) User backup registers                                      */
  __IOM uint32_t  REG_04;                       /*!< (@ 0x00000010) User backup registers                                      */
  __IOM uint32_t  REG_05;                       /*!< (@ 0x00000014) User backup registers                                      */
  __IOM uint32_t  REG_06;                       /*!< (@ 0x00000018) User backup registers                                      */
  __IOM uint32_t  REG_07;                       /*!< (@ 0x0000001C) User backup registers                                      */
  __IOM uint32_t  REG_08;                       /*!< (@ 0x00000020) User backup registers                                      */
  __IOM uint32_t  REG_09;                       /*!< (@ 0x00000024) User backup registers                                      */
  __IOM uint32_t  REG_0A;                       /*!< (@ 0x00000028) User backup registers                                      */
  __IOM uint32_t  REG_0B;                       /*!< (@ 0x0000002C) User backup registers                                      */
  __IOM uint32_t  REG_0C;                       /*!< (@ 0x00000030) User backup registers                                      */
  __IOM uint32_t  REG_0D;                       /*!< (@ 0x00000034) User backup registers                                      */
  
  union {
    __IOM uint32_t REG_0E;                      /*!< (@ 0x00000038) REG_OE Control register                                    */
    
    struct {
      __IOM uint32_t LOW        : 3;            /*!< [2..0] DUcc Freq control                                                  */
      __IOM uint32_t SelectRI   : 3;            /*!< [5..3] DUcc extra I, should be equals to LOW field!                       */
      __IOM uint32_t Jtag_A     : 1;            /*!< [6..6] Enable Jtag_A interface                                            */
      __IOM uint32_t Jtag_B     : 1;            /*!< [7..7] Enable Jtag_B interface                                            */
      __IOM uint32_t Trim_dDUcc : 3;            /*!< [10..8] Ducc adjust voltages                                              */
      __IOM uint32_t FPOR       : 1;            /*!< [11..11] Power Reset Flag                                                 */
      __IOM uint32_t MODE       : 3;            /*!< [14..12] Bootloading Mode                                                 */
    } REG_0E_b;
  } ;
  
  union {
    __IOM uint32_t REG_0F;                      /*!< (@ 0x0000003C) REG_OF Control register                                    */
    
