StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE9x.h
    struct {
      __IM  uint32_t CTS        : 1;            /*!< [0..0] Modem Clear To Send                                                */
      __IM  uint32_t DSR        : 1;            /*!< [1..1] Modem Data Set Ready                                               */
      __IM  uint32_t DCD        : 1;            /*!< [2..2] Modem Data Carrier Detect                                          */
      __IM  uint32_t BUSY       : 1;            /*!< [3..3] Transmitting data                                                  */
      __IM  uint32_t RXFE       : 1;            /*!< [4..4] FIFO_RX Empty status                                               */
      __IM  uint32_t TXFF       : 1;            /*!< [5..5] FIFO_TX Full Status                                                */
      __IM  uint32_t RXFF       : 1;            /*!< [6..6] FIFO_RX Full Status                                                */
      __IM  uint32_t TXFE       : 1;            /*!< [7..7] FIFO_RX Empty status                                               */
      __IM  uint32_t RI         : 1;            /*!< [8..8] Modem Ring Indicator                                               */
    } FR_b;
  } ;
  __IM  uint32_t  RESERVED1;
  
  union {
    __IOM uint32_t ILPR;                        /*!< (@ 0x00000020) IrDA Low-Power Counter                                     */
    
    struct {
      __IOM uint32_t DVSR       : 8;            /*!< [7..0] Div of SampleRate                                                  */
    } ILPR_b;
  } ;
  
  union {
    __IOM uint32_t IBRD;                        /*!< (@ 0x00000024) Integer BaudRate Divisor                                   */
    
    struct {
      __IOM uint32_t Baud_DivInt : 16;          /*!< [15..0] Integer part of Rate divisor                                      */
    } IBRD_b;
  } ;
  
  union {
    __IOM uint32_t FBRD;                        /*!< (@ 0x00000028) Fractional BaudRate Divisor                                */
    
    struct {
      __IOM uint32_t Baud_DivFrac : 6;          /*!< [5..0] Fractional part of Rate divisor                                    */
    } FBRD_b;
  } ;
  
  union {
    __IOM uint32_t LCR_H;                       /*!< (@ 0x0000002C) Line Control Register                                      */
    
    struct {
      __IOM uint32_t BRK        : 1;            /*!< [0..0] Send Break - TX LOW for 2 words                                    */
      __IOM uint32_t PEN        : 1;            /*!< [1..1] Parity Enable                                                      */
      __IOM uint32_t EPS        : 1;            /*!< [2..2] Even Parity Select                                                 */
      __IOM uint32_t STP2       : 1;            /*!< [3..3] Double Stop Bits Enable                                            */
      __IOM uint32_t FEN        : 1;            /*!< [4..4] FIFOs Enable                                                       */
      __IOM uint32_t WLEN       : 2;            /*!< [6..5] Word Length                                                        */
      __IOM uint32_t SPS        : 1;            /*!< [7..7] Stick Parity Select                                                */
    } LCR_H_b;
  } ;
  
  union {
    __IOM uint32_t CR;                          /*!< (@ 0x00000030) Control Register                                           */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] Enable UART                                                        */
      __IOM uint32_t SIREN      : 1;            /*!< [1..1] IrDA Enable                                                        */
      __IOM uint32_t SIRLP      : 1;            /*!< [2..2] IrDA Low-Power Enable                                              */
      __IM  uint32_t            : 4;
      __IOM uint32_t LBE        : 1;            /*!< [7..7] LoopBack Enable                                                    */
      __IOM uint32_t TXE        : 1;            /*!< [8..8] Transmitter Enable                                                 */
      __IOM uint32_t RXE        : 1;            /*!< [9..9] Receiver Enable                                                    */
      __IOM uint32_t DTR        : 1;            /*!< [10..10] Data Transmit Ready                                              */
      __IOM uint32_t RTS        : 1;            /*!< [11..11] Request To Send                                                  */
      __IOM uint32_t Out1       : 1;            /*!< [12..12] Custom Modem Output1 - DCD                                       */
      __IOM uint32_t Out2       : 1;            /*!< [13..13] Custom Modem Output2 - RI                                        */
      __IOM uint32_t RTSEn      : 1;            /*!< [14..14] Hardware RTS Control                                             */
      __IOM uint32_t CTSEn      : 1;            /*!< [15..15] Hardware CTS Control                                             */
    } CR_b;
  } ;
  
  union {
    __IOM uint32_t IFLS;                        /*!< (@ 0x00000034) IRQ FIFO Level                                             */
    
    struct {
      __IOM uint32_t TXIFLSES   : 3;            /*!< [2..0] IRQ FIFO_TX level                                                  */
      __IOM uint32_t RXIFLSES   : 3;            /*!< [5..3] IRQ FIFO_RX level                                                  */
    } IFLS_b;
  } ;
  
  union {
    __IOM uint32_t IMSC;                        /*!< (@ 0x00000038) IRQ Mask Set Clear                                         */
    
    struct {
      __IOM uint32_t RIM_IM     : 1;            /*!< [0..0] RI Modem IRQ Mask                                                  */
      __IOM uint32_t STCM_IM    : 1;            /*!< [1..1] STC Modem IRQ Mask                                                 */
      __IOM uint32_t DCDM_IM    : 1;            /*!< [2..2] DCD Modem IRQ Mask                                                 */
      __IOM uint32_t DSRM_IM    : 1;            /*!< [3..3] DSR Modem IRQ Mask                                                 */
      __IOM uint32_t RX_IM      : 1;            /*!< [4..4] RX IRQ Mask                                                        */
      __IOM uint32_t TX_IM      : 1;            /*!< [5..5] TX IRQ Mask                                                        */
      __IOM uint32_t RT_IM      : 1;            /*!< [6..6] RX Timeout IRQ Mask                                                */
      __IOM uint32_t FE_IM      : 1;            /*!< [7..7] Frame Error IRQ Mask                                               */
      __IOM uint32_t PE_IM      : 1;            /*!< [8..8] Parity Error IRQ Mask                                              */
      __IOM uint32_t BE_IM      : 1;            /*!< [9..9] BreakLine IRQ Mask                                                 */
      __IOM uint32_t OE_IM      : 1;            /*!< [10..10] Overrun FIFO_RX IRQ Mask                                         */
    } IMSC_b;
  } ;
  
  union {
    __IM  uint32_t RIS;                         /*!< (@ 0x0000003C) Raw IQR Status Register                                    */
    
