StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE9x.h
    struct {
      __IM  uint32_t RIM_RIS    : 1;            /*!< [0..0] RI Modem Event                                                     */
      __IM  uint32_t STCM_RIS   : 1;            /*!< [1..1] STC Modem Event                                                    */
      __IM  uint32_t DCDM_RIS   : 1;            /*!< [2..2] DCD Modem Event                                                    */
      __IM  uint32_t DSRM_RIS   : 1;            /*!< [3..3] DSR Modem Event                                                    */
      __IM  uint32_t RX_RIS     : 1;            /*!< [4..4] RX Event                                                           */
      __IM  uint32_t TX_RIS     : 1;            /*!< [5..5] TX Event                                                           */
      __IM  uint32_t RT_RIS     : 1;            /*!< [6..6] RX Timeout Event                                                   */
      __IM  uint32_t FE_RIS     : 1;            /*!< [7..7] Frame Error Event                                                  */
      __IM  uint32_t PE_RIS     : 1;            /*!< [8..8] Parity Error Event                                                 */
      __IM  uint32_t BE_RIS     : 1;            /*!< [9..9] BreakLine Event                                                    */
      __IM  uint32_t OE_RIS     : 1;            /*!< [10..10] Overrun FIFO_RX Event                                            */
    } RIS_b;
  } ;
  
  union {
    __IM  uint32_t MIS;                         /*!< (@ 0x00000040) Masked IQR Status Register                                 */
    
    struct {
      __IM  uint32_t RIM_MIS    : 1;            /*!< [0..0] RI Modem Event                                                     */
      __IM  uint32_t STCM_MIS   : 1;            /*!< [1..1] STC Modem Event                                                    */
      __IM  uint32_t DCDM_MIS   : 1;            /*!< [2..2] DCD Modem Event                                                    */
      __IM  uint32_t DSRM_MIS   : 1;            /*!< [3..3] DSR Modem Event                                                    */
      __IM  uint32_t RX_MIS     : 1;            /*!< [4..4] RX Event                                                           */
      __IM  uint32_t TX_MIS     : 1;            /*!< [5..5] TX Event                                                           */
      __IM  uint32_t RT_MIS     : 1;            /*!< [6..6] RX Timeout Event                                                   */
      __IM  uint32_t FE_MIS     : 1;            /*!< [7..7] Frame Error Event                                                  */
      __IM  uint32_t PE_MIS     : 1;            /*!< [8..8] Parity Error Event                                                 */
      __IM  uint32_t BE_MIS     : 1;            /*!< [9..9] BreakLine Event                                                    */
      __IM  uint32_t OE_MIS     : 1;            /*!< [10..10] Overrun FIFO_RX Event                                            */
    } MIS_b;
  } ;
  
  union {
    __OM  uint32_t ICR;                         /*!< (@ 0x00000044) IRQ Clear Register                                         */
    
    struct {
      __OM  uint32_t RIM_IC     : 1;            /*!< [0..0] RI Modem Event                                                     */
      __OM  uint32_t STCM_IC    : 1;            /*!< [1..1] STC Modem Event                                                    */
      __OM  uint32_t DCDM_IC    : 1;            /*!< [2..2] DCD Modem Event                                                    */
      __OM  uint32_t DSRM_IC    : 1;            /*!< [3..3] DSR Modem Event                                                    */
      __OM  uint32_t RX_IC      : 1;            /*!< [4..4] RX Event                                                           */
      __OM  uint32_t TX_IC      : 1;            /*!< [5..5] TX Event                                                           */
      __OM  uint32_t RT_IC      : 1;            /*!< [6..6] RX Timeout Event                                                   */
      __OM  uint32_t FE_IC      : 1;            /*!< [7..7] Frame Error Event                                                  */
      __OM  uint32_t PE_IC      : 1;            /*!< [8..8] Parity Error Event                                                 */
      __OM  uint32_t BE_IC      : 1;            /*!< [9..9] BreakLine Event                                                    */
      __OM  uint32_t OE_IC      : 1;            /*!< [10..10] Overrun FIFO_RX Event                                            */
    } ICR_b;
  } ;
  
  union {
    __IOM uint32_t DMACR;                       /*!< (@ 0x00000048) DMA Control Register                                       */
    
    struct {
      __IOM uint32_t RXDMAE     : 1;            /*!< [0..0] RX DMA Enable                                                      */
      __IOM uint32_t TXDMAE     : 1;            /*!< [1..1] TX DMA Enable                                                      */
      __IOM uint32_t DMAonErr   : 1;            /*!< [2..2] Disable DMA req on Error                                           */
    } DMACR_b;
  } ;
  __IM  uint32_t  RESERVED2[13];
  
  union {
    __IOM uint32_t TCR;                         /*!< (@ 0x00000080) Test Control Register                                      */
    
    struct {
      __IOM uint32_t ITEN       : 1;            /*!< [0..0] Test Mode Enable                                                   */
      __IOM uint32_t TestFIFO   : 1;            /*!< [1..1] FIFO test mode                                                     */
      __IOM uint32_t SIRTest    : 1;            /*!< [2..2] IrDA test mode                                                     */
    } TCR_b;
  } ;
} MDR_UART1_Type;                               /*!< Size = 132 (0x84)                                                         */



/* =========================================================================================================================== */
/* ================                                        MDR_TIMER1                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief TIMER Control (MDR_TIMER1)
  */

