StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE9x.h
    struct {
      __IOM uint32_t DTG        : 4;            /*!< [3..0] DTG Prescaller                                                     */
      __IOM uint32_t EDTS       : 1;            /*!< [4..4] DTG Clock Select                                                   */
      __IM  uint32_t            : 3;
      __IOM uint32_t DTGx       : 8;            /*!< [15..8] DTGx scale, Delay = DTGx*(DTG + 1)                                */
    } CH1_DTG_b;
  } ;
  
  union {
    __IOM uint32_t CH2_DTG;                     /*!< (@ 0x00000044) Dead Time Generator                                        */
    
    struct {
      __IOM uint32_t DTG        : 4;            /*!< [3..0] DTG Prescaller                                                     */
      __IOM uint32_t EDTS       : 1;            /*!< [4..4] DTG Clock Select                                                   */
      __IM  uint32_t            : 3;
      __IOM uint32_t DTGx       : 8;            /*!< [15..8] DTGx scale, Delay = DTGx*(DTG + 1)                                */
    } CH2_DTG_b;
  } ;
  
  union {
    __IOM uint32_t CH3_DTG;                     /*!< (@ 0x00000048) Dead Time Generator                                        */
    
    struct {
      __IOM uint32_t DTG        : 4;            /*!< [3..0] DTG Prescaller                                                     */
      __IOM uint32_t EDTS       : 1;            /*!< [4..4] DTG Clock Select                                                   */
      __IM  uint32_t            : 3;
      __IOM uint32_t DTGx       : 8;            /*!< [15..8] DTGx scale, Delay = DTGx*(DTG + 1)                                */
    } CH3_DTG_b;
  } ;
  
  union {
    __IOM uint32_t CH4_DTG;                     /*!< (@ 0x0000004C) Dead Time Generator                                        */
    
    struct {
      __IOM uint32_t DTG        : 4;            /*!< [3..0] DTG Prescaller                                                     */
      __IOM uint32_t EDTS       : 1;            /*!< [4..4] DTG Clock Select                                                   */
      __IM  uint32_t            : 3;
      __IOM uint32_t DTGx       : 8;            /*!< [15..8] DTGx scale, Delay = DTGx*(DTG + 1)                                */
    } CH4_DTG_b;
  } ;
  
  union {
    __IOM uint32_t BRKETR_CNTRL;                /*!< (@ 0x00000050) Break and External Count Control                           */
    
    struct {
      __IOM uint32_t BRK_INV    : 1;            /*!< [0..0] Invert Break Signal                                                */
      __IOM uint32_t ETR_INV    : 1;            /*!< [1..1] Invert External Count Signal                                       */
      __IOM uint32_t ETR_PSC    : 2;            /*!< [3..2] External Count Div                                                 */
      __IOM uint32_t ETR_Filter : 4;            /*!< [7..4] External Count Signal Filter                                       */
    } BRKETR_CNTRL_b;
  } ;
  
  union {
    __IOM uint32_t STATUS;                      /*!< (@ 0x00000054) Status Register                                            */
    
    struct {
      __IOM uint32_t CNT_ZERO   : 1;            /*!< [0..0] CNT Zero                                                           */
      __IOM uint32_t CNT_ARR    : 1;            /*!< [1..1] CNT eq ARR                                                         */
      __IOM uint32_t ETR_RE     : 1;            /*!< [2..2] ETR Rise Front                                                     */
      __IOM uint32_t ETR_FE     : 1;            /*!< [3..3] ETR Fall Front                                                     */
      __IOM uint32_t BRK        : 1;            /*!< [4..4] BRK High Level                                                     */
      __IOM uint32_t CCR_CAP_CH1 : 1;           /*!< [5..5] Captured to CCR                                                    */
      __IOM uint32_t CCR_CAP_CH2 : 1;           /*!< [6..6] Captured to CCR                                                    */
      __IOM uint32_t CCR_CAP_CH3 : 1;           /*!< [7..7] Captured to CCR                                                    */
      __IOM uint32_t CCR_CAP_CH4 : 1;           /*!< [8..8] Captured to CCR                                                    */
      __IOM uint32_t CCR_REF_CH1 : 1;           /*!< [9..9] PWM Rise Front                                                     */
      __IOM uint32_t CCR_REF_CH2 : 1;           /*!< [10..10] PWM Rise Front                                                   */
      __IOM uint32_t CCR_REF_CH3 : 1;           /*!< [11..11] PWM Rise Front                                                   */
      __IOM uint32_t CCR_REF_CH4 : 1;           /*!< [12..12] PWM Rise Front                                                   */
      __IOM uint32_t CCR1_CAP_CH1 : 1;          /*!< [13..13] Captured to CCR1                                                 */
      __IOM uint32_t CCR1_CAP_CH2 : 1;          /*!< [14..14] Captured to CCR1                                                 */
      __IOM uint32_t CCR1_CAP_CH3 : 1;          /*!< [15..15] Captured to CCR1                                                 */
      __IOM uint32_t CCR1_CAP_CH4 : 1;          /*!< [16..16] Captured to CCR1                                                 */
    } STATUS_b;
  } ;
  
  union {
    __IOM uint32_t IE;                          /*!< (@ 0x00000058) IRQ Enable                                                 */
    
    struct {
      __IOM uint32_t CNT_ZERO_IE : 1;           /*!< [0..0] CNT Zero                                                           */
      __IOM uint32_t CNT_ARR_IE : 1;            /*!< [1..1] CNT eq ARR                                                         */
      __IOM uint32_t ETR_RE_IE  : 1;            /*!< [2..2] ETR Rise Front                                                     */
      __IOM uint32_t ETR_FE_IE  : 1;            /*!< [3..3] ETR Fall Front                                                     */
      __IOM uint32_t BRK_IE     : 1;            /*!< [4..4] BRK High Level                                                     */
      __IOM uint32_t CCR_CAP_CH1_IE : 1;        /*!< [5..5] Captured to CCR                                                    */
      __IOM uint32_t CCR_CAP_CH2_IE : 1;        /*!< [6..6] Captured to CCR                                                    */
      __IOM uint32_t CCR_CAP_CH3_IE : 1;        /*!< [7..7] Captured to CCR                                                    */
      __IOM uint32_t CCR_CAP_CH4_IE : 1;        /*!< [8..8] Captured to CCR                                                    */
      __IOM uint32_t CCR_REF_CH1_IE : 1;        /*!< [9..9] PWM Rise Front                                                     */
      __IOM uint32_t CCR_REF_CH2_IE : 1;        /*!< [10..10] PWM Rise Front                                                   */
      __IOM uint32_t CCR_REF_CH3_IE : 1;        /*!< [11..11] PWM Rise Front                                                   */
      __IOM uint32_t CCR_REF_CH4_IE : 1;        /*!< [12..12] PWM Rise Front                                                   */
      __IOM uint32_t CCR1_CAP_CH1_IE : 1;       /*!< [13..13] Captured to CCR1                                                 */
      __IOM uint32_t CCR1_CAP_CH2_IE : 1;       /*!< [14..14] Captured to CCR1                                                 */
      __IOM uint32_t CCR1_CAP_CH3_IE : 1;       /*!< [15..15] Captured to CCR1                                                 */
      __IOM uint32_t CCR1_CAP_CH4_IE : 1;       /*!< [16..16] Captured to CCR1                                                 */
    } IE_b;
  } ;
  
  union {
    __IOM uint32_t DMA_RE;                      /*!< (@ 0x0000005C) DMA Request Enable for TIMx_DMA_REQ                        */
    
