StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE9x.h
    struct {
      __IOM uint32_t Value      : 16;           /*!< [15..0] Captured or PWM Value                                             */
    } CCR41_b;
  } ;
} MDR_TIMER1_Type;                              /*!< Size = 128 (0x80)                                                         */



/* =========================================================================================================================== */
/* ================                                         MDR_SSP1                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Synchronous Serial Port (MDR_SSP1)
  */

typedef struct {                                /*!< (@ 0x40040000) MDR_SSP1 Structure                                         */
  
  union {
    __IOM uint32_t CR0;                         /*!< (@ 0x00000000) Control Register 0                                         */
    
    struct {
      __IOM uint32_t DSS        : 4;            /*!< [3..0] Data Size Select                                                   */
      __IOM uint32_t FRF        : 2;            /*!< [5..4] Frame Format                                                       */
      __IOM uint32_t SPO        : 1;            /*!< [6..6] SPI Clock Polarity                                                 */
      __IOM uint32_t SPH        : 1;            /*!< [7..7] SPI Capture Clock Phase                                            */
      __IOM uint32_t SCR        : 8;            /*!< [15..8] Signal CLock Rate                                                 */
    } CR0_b;
  } ;
  
  union {
    __IOM uint32_t CR1;                         /*!< (@ 0x00000004) Control Register 1                                         */
    
    struct {
      __IOM uint32_t LBM        : 1;            /*!< [0..0] Loop Back Mode                                                     */
      __IOM uint32_t SSE        : 1;            /*!< [1..1] Synchronous Serial Enable                                          */
      __IOM uint32_t MS         : 1;            /*!< [2..2] Master or Slave mode                                               */
      __IOM uint32_t SOD        : 1;            /*!< [3..3] Slave mode Output Disable                                          */
    } CR1_b;
  } ;
  
  union {
    __IOM uint32_t DR;                          /*!< (@ 0x00000008) FIFO_Rx and FIFO_Tx access                                 */
    
    struct {
      __IOM uint32_t Data       : 16;           /*!< [15..0] Data value                                                        */
    } DR_b;
  } ;
  
  union {
    __IM  uint32_t SR;                          /*!< (@ 0x0000000C) Status Register                                            */
    
    struct {
      __IM  uint32_t TFE        : 1;            /*!< [0..0] FIFO_TX is Empty                                                   */
      __IM  uint32_t TNF        : 1;            /*!< [1..1] FIFO_TX is Not Full                                                */
      __IM  uint32_t RNE        : 1;            /*!< [2..2] FIFO_RX is Not Empty                                               */
      __IM  uint32_t RFF        : 1;            /*!< [3..3] FIFO_RX is Full                                                    */
      __IM  uint32_t BSY        : 1;            /*!< [4..4] Transfer in progress                                               */
    } SR_b;
  } ;
  
  union {
    __IOM uint32_t CPSR;                        /*!< (@ 0x00000010) Clock Prescaller Register                                  */
    
    struct {
      __IOM uint32_t CPSDVSR    : 8;            /*!< [7..0] Clock Prescaller                                                   */
    } CPSR_b;
  } ;
  
  union {
    __IOM uint32_t IMSC;                        /*!< (@ 0x00000014) IRQ Mask Set-Clear                                         */
    
    struct {
      __IOM uint32_t RORIM      : 1;            /*!< [0..0] Enable IRQ on FIFO_RX overrun                                      */
      __IOM uint32_t RTIM       : 1;            /*!< [1..1] Enable IQR on RX timeout for 32bits                                */
      __IOM uint32_t RXIM       : 1;            /*!< [2..2] Enable IQR on FIFO_RX ge 4 words                                   */
      __IOM uint32_t TXIM       : 1;            /*!< [3..3] Enable IQR on FIFO_TX le 4 words                                   */
    } IMSC_b;
  } ;
  
  union {
    __IM  uint32_t RIS;                         /*!< (@ 0x00000018) Raw Interupt Status                                        */
    
    struct {
      __IM  uint32_t RORRIS     : 1;            /*!< [0..0] FIFO_RX is overrun                                                 */
      __IM  uint32_t RTRIS      : 1;            /*!< [1..1] RX timeout for 32bits                                              */
      __IM  uint32_t RXRIS      : 1;            /*!< [2..2] FIFO_RX gt words                                                   */
      __IM  uint32_t TXRIS      : 1;            /*!< [3..3] FIFO_TX le words                                                   */
    } RIS_b;
  } ;
  
  union {
    __IM  uint32_t MIS;                         /*!< (@ 0x0000001C) Masked Interupt Status                                     */
    
    struct {
      __IM  uint32_t RORMIS     : 1;            /*!< [0..0] FIFO_RX is overrun                                                 */
      __IM  uint32_t RTMIS      : 1;            /*!< [1..1] RX timeout for 32bits                                              */
      __IM  uint32_t RXMIS      : 1;            /*!< [2..2] FIFO_RX ge 4 words                                                 */
      __IM  uint32_t TXMIS      : 1;            /*!< [3..3] FIFO_TX le 4 words                                                 */
    } MIS_b;
  } ;
  
  union {
    __OM  uint32_t ICR;                         /*!< (@ 0x00000020) Interupt Clear Register                                    */
    
