StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE9x.h
    struct {
      __OM  uint32_t RORIC      : 1;            /*!< [0..0] Clear FIFO_RX overrun flag                                         */
      __OM  uint32_t RTIC       : 1;            /*!< [1..1] Clear RX timeout flag                                              */
    } ICR_b;
  } ;
  
  union {
    __IOM uint32_t DMACR;                       /*!< (@ 0x00000024) DMA Control Register                                       */
    
    struct {
      __IOM uint32_t RXDMAE     : 1;            /*!< [0..0] Enable DMA by FIFO_RX has data                                     */
      __IOM uint32_t TXDMAE     : 1;            /*!< [1..1] Enable DMA by FIFO_TX not Full                                     */
    } DMACR_b;
  } ;
} MDR_SSP1_Type;                                /*!< Size = 40 (0x28)                                                          */



/* =========================================================================================================================== */
/* ================                                         MDR_PORTA                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief GPIO Port Control (MDR_PORTA)
  */

typedef struct {                                /*!< (@ 0x400A8000) MDR_PORTA Structure                                        */
  
  union {
    __IOM uint32_t RXTX;                        /*!< (@ 0x00000000) GPIO Pin Data                                              */
    
    struct {
      __IOM uint32_t Pin_0      : 1;            /*!< [0..0] Pin data value                                                     */
      __IOM uint32_t Pin_1      : 1;            /*!< [1..1] Pin data value                                                     */
      __IOM uint32_t Pin_2      : 1;            /*!< [2..2] Pin data value                                                     */
      __IOM uint32_t Pin_3      : 1;            /*!< [3..3] Pin data value                                                     */
      __IOM uint32_t Pin_4      : 1;            /*!< [4..4] Pin data value                                                     */
      __IOM uint32_t Pin_5      : 1;            /*!< [5..5] Pin data value                                                     */
      __IOM uint32_t Pin_6      : 1;            /*!< [6..6] Pin data value                                                     */
      __IOM uint32_t Pin_7      : 1;            /*!< [7..7] Pin data value                                                     */
      __IOM uint32_t Pin_8      : 1;            /*!< [8..8] Pin data value                                                     */
      __IOM uint32_t Pin_9      : 1;            /*!< [9..9] Pin data value                                                     */
      __IOM uint32_t Pin_10     : 1;            /*!< [10..10] Pin data value                                                   */
      __IOM uint32_t Pin_11     : 1;            /*!< [11..11] Pin data value                                                   */
      __IOM uint32_t Pin_12     : 1;            /*!< [12..12] Pin data value                                                   */
      __IOM uint32_t Pin_13     : 1;            /*!< [13..13] Pin data value                                                   */
      __IOM uint32_t Pin_14     : 1;            /*!< [14..14] Pin data value                                                   */
      __IOM uint32_t Pin_15     : 1;            /*!< [15..15] Pin data value                                                   */
    } RXTX_b;
  } ;
  
  union {
    __IOM uint32_t OE;                          /*!< (@ 0x00000004) Output Enable Control                                      */
    
    struct {
      __IOM uint32_t Pin_0      : 1;            /*!< [0..0] Pin data direction                                                 */
      __IOM uint32_t Pin_1      : 1;            /*!< [1..1] Pin data direction                                                 */
      __IOM uint32_t Pin_2      : 1;            /*!< [2..2] Pin data direction                                                 */
      __IOM uint32_t Pin_3      : 1;            /*!< [3..3] Pin data direction                                                 */
      __IOM uint32_t Pin_4      : 1;            /*!< [4..4] Pin data direction                                                 */
      __IOM uint32_t Pin_5      : 1;            /*!< [5..5] Pin data direction                                                 */
      __IOM uint32_t Pin_6      : 1;            /*!< [6..6] Pin data direction                                                 */
      __IOM uint32_t Pin_7      : 1;            /*!< [7..7] Pin data direction                                                 */
      __IOM uint32_t Pin_8      : 1;            /*!< [8..8] Pin data direction                                                 */
      __IOM uint32_t Pin_9      : 1;            /*!< [9..9] Pin data direction                                                 */
      __IOM uint32_t Pin_10     : 1;            /*!< [10..10] Pin data direction                                               */
      __IOM uint32_t Pin_11     : 1;            /*!< [11..11] Pin data direction                                               */
      __IOM uint32_t Pin_12     : 1;            /*!< [12..12] Pin data direction                                               */
      __IOM uint32_t Pin_13     : 1;            /*!< [13..13] Pin data direction                                               */
      __IOM uint32_t Pin_14     : 1;            /*!< [14..14] Pin data direction                                               */
      __IOM uint32_t Pin_15     : 1;            /*!< [15..15] Pin data direction                                               */
    } OE_b;
  } ;
  
  union {
    __IOM uint32_t FUNC;                        /*!< (@ 0x00000008) Pin Functions in Digital mode                              */
    
