StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE9x.h
    struct {
      __IOM uint32_t Pin_0      : 1;            /*!< [0..0] Filter for pin                                                     */
      __IOM uint32_t Pin_1      : 1;            /*!< [1..1] Filter for pin                                                     */
      __IOM uint32_t Pin_2      : 1;            /*!< [2..2] Filter for pin                                                     */
      __IOM uint32_t Pin_3      : 1;            /*!< [3..3] Filter for pin                                                     */
      __IOM uint32_t Pin_4      : 1;            /*!< [4..4] Filter for pin                                                     */
      __IOM uint32_t Pin_5      : 1;            /*!< [5..5] Filter for pin                                                     */
      __IOM uint32_t Pin_6      : 1;            /*!< [6..6] Filter for pin                                                     */
      __IOM uint32_t Pin_7      : 1;            /*!< [7..7] Filter for pin                                                     */
      __IOM uint32_t Pin_8      : 1;            /*!< [8..8] Filter for pin                                                     */
      __IOM uint32_t Pin_9      : 1;            /*!< [9..9] Filter for pin                                                     */
      __IOM uint32_t Pin_10     : 1;            /*!< [10..10] Filter for pin                                                   */
      __IOM uint32_t Pin_11     : 1;            /*!< [11..11] Filter for pin                                                   */
      __IOM uint32_t Pin_12     : 1;            /*!< [12..12] Filter for pin                                                   */
      __IOM uint32_t Pin_13     : 1;            /*!< [13..13] Filter for pin                                                   */
      __IOM uint32_t Pin_14     : 1;            /*!< [14..14] Filter for pin                                                   */
      __IOM uint32_t Pin_15     : 1;            /*!< [15..15] Filter for pin                                                   */
    } GFEN_b;
  } ;
} MDR_PORTA_Type;                               /*!< Size = 32 (0x20)                                                          */


/** @} */ /* End of group Device_Peripheral_peripherals */


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripheralAddr
  * @{
  */

#define MDR_EEPROM_BASE             0x40018000UL
#define MDR_RST_CLOCK_BASE          0x40020000UL
#define MDR_WWDT_BASE               0x40060000UL
#define MDR_IWDT_BASE               0x40068000UL
#define MDR_ADC_BASE                0x40088000UL
#define MDR_BKP_BASE                0x400D8000UL
#define MDR_UART1_BASE              0x40030000UL
#define MDR_UART2_BASE              0x40038000UL
#define MDR_TIMER1_BASE             0x40070000UL
#define MDR_TIMER2_BASE             0x40078000UL
#define MDR_TIMER3_BASE             0x40080000UL
#define MDR_SSP1_BASE               0x40040000UL
#define MDR_SSP2_BASE               0x400A0000UL
#define MDR_PORTA_BASE              0x400A8000UL
#define MDR_PORTB_BASE              0x400B0000UL
#define MDR_PORTC_BASE              0x400B8000UL
#define MDR_PORTD_BASE              0x400C0000UL
#define MDR_PORTE_BASE              0x400C8000UL
#define MDR_PORTF_BASE              0x400E8000UL

/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_declaration
  * @{
  */

#define MDR_EEPROM                  ((MDR_EEPROM_Type*)        MDR_EEPROM_BASE)
#define MDR_RST_CLOCK               ((MDR_RST_CLOCK_Type*)     MDR_RST_CLOCK_BASE)
#define MDR_WWDT                    ((MDR_WWDT_Type*)          MDR_WWDT_BASE)
#define MDR_IWDT                    ((MDR_IWDT_Type*)          MDR_IWDT_BASE)
#define MDR_ADC                     ((MDR_ADC_Type*)           MDR_ADC_BASE)
#define MDR_BKP                     ((MDR_BKP_Type*)           MDR_BKP_BASE)
#define MDR_UART1                   ((MDR_UART1_Type*)         MDR_UART1_BASE)
#define MDR_UART2                   ((MDR_UART1_Type*)         MDR_UART2_BASE)
#define MDR_TIMER1                  ((MDR_TIMER1_Type*)        MDR_TIMER1_BASE)
#define MDR_TIMER2                  ((MDR_TIMER1_Type*)        MDR_TIMER2_BASE)
#define MDR_TIMER3                  ((MDR_TIMER1_Type*)        MDR_TIMER3_BASE)
#define MDR_SSP1                    ((MDR_SSP1_Type*)          MDR_SSP1_BASE)
#define MDR_SSP2                    ((MDR_SSP1_Type*)          MDR_SSP2_BASE)
#define MDR_PORTA                   ((MDR_PORTA_Type*)         MDR_PORTA_BASE)
#define MDR_PORTB                   ((MDR_PORTA_Type*)         MDR_PORTB_BASE)
#define MDR_PORTC                   ((MDR_PORTA_Type*)         MDR_PORTC_BASE)
#define MDR_PORTD                   ((MDR_PORTA_Type*)         MDR_PORTD_BASE)
#define MDR_PORTE                   ((MDR_PORTA_Type*)         MDR_PORTE_BASE)
#define MDR_PORTF                   ((MDR_PORTA_Type*)         MDR_PORTF_BASE)

/** @} */ /* End of group Device_Peripheral_declaration */


/* =========================================  End of section using anonymous unions  ========================================= */
#if defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#endif


/* =========================================================================================================================== */
/* ================                                Pos/Mask Peripheral Section                                ================ */
/* =========================================================================================================================== */


/** @addtogroup PosMask_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                        MDR_EEPROM                                         ================ */
/* =========================================================================================================================== */

/* ==========================================================  CMD  ========================================================== */
#define MDR_EEPROM_CMD_CON_Pos            (0UL)                     /*!< MDR_EEPROM CMD: CON (Bit 0)                           */
#define MDR_EEPROM_CMD_CON_Msk            (0x1UL)                   /*!< MDR_EEPROM CMD: CON (Bitfield-Mask: 0x01)             */
#define MDR_EEPROM_CMD_WR_Pos             (1UL)                     /*!< MDR_EEPROM CMD: WR (Bit 1)                            */
#define MDR_EEPROM_CMD_WR_Msk             (0x2UL)                   /*!< MDR_EEPROM CMD: WR (Bitfield-Mask: 0x01)              */
#define MDR_EEPROM_CMD_RD_Pos             (2UL)                     /*!< MDR_EEPROM CMD: RD (Bit 2)                            */
#define MDR_EEPROM_CMD_RD_Msk             (0x4UL)                   /*!< MDR_EEPROM CMD: RD (Bitfield-Mask: 0x01)              */
#define MDR_EEPROM_CMD_DELAY_Pos          (3UL)                     /*!< MDR_EEPROM CMD: DELAY (Bit 3)                         */
#define MDR_EEPROM_CMD_DELAY_Msk          (0x38UL)                  /*!< MDR_EEPROM CMD: DELAY (Bitfield-Mask: 0x07)           */
#define MDR_EEPROM_CMD_XE_Pos             (6UL)                     /*!< MDR_EEPROM CMD: XE (Bit 6)                            */
#define MDR_EEPROM_CMD_XE_Msk             (0x40UL)                  /*!< MDR_EEPROM CMD: XE (Bitfield-Mask: 0x01)              */
#define MDR_EEPROM_CMD_YE_Pos             (7UL)                     /*!< MDR_EEPROM CMD: YE (Bit 7)                            */
#define MDR_EEPROM_CMD_YE_Msk             (0x80UL)                  /*!< MDR_EEPROM CMD: YE (Bitfield-Mask: 0x01)              */
#define MDR_EEPROM_CMD_SE_Pos             (8UL)                     /*!< MDR_EEPROM CMD: SE (Bit 8)                            */
#define MDR_EEPROM_CMD_SE_Msk             (0x100UL)                 /*!< MDR_EEPROM CMD: SE (Bitfield-Mask: 0x01)              */
#define MDR_EEPROM_CMD_IFREN_Pos          (9UL)                     /*!< MDR_EEPROM CMD: IFREN (Bit 9)                         */
#define MDR_EEPROM_CMD_IFREN_Msk          (0x200UL)                 /*!< MDR_EEPROM CMD: IFREN (Bitfield-Mask: 0x01)           */
#define MDR_EEPROM_CMD_ERASE_Pos          (10UL)                    /*!< MDR_EEPROM CMD: ERASE (Bit 10)                        */
#define MDR_EEPROM_CMD_ERASE_Msk          (0x400UL)                 /*!< MDR_EEPROM CMD: ERASE (Bitfield-Mask: 0x01)           */
#define MDR_EEPROM_CMD_MAS1_Pos           (11UL)                    /*!< MDR_EEPROM CMD: MAS1 (Bit 11)                         */
#define MDR_EEPROM_CMD_MAS1_Msk           (0x800UL)                 /*!< MDR_EEPROM CMD: MAS1 (Bitfield-Mask: 0x01)            */
#define MDR_EEPROM_CMD_PROG_Pos           (12UL)                    /*!< MDR_EEPROM CMD: PROG (Bit 12)                         */
#define MDR_EEPROM_CMD_PROG_Msk           (0x1000UL)                /*!< MDR_EEPROM CMD: PROG (Bitfield-Mask: 0x01)            */
#define MDR_EEPROM_CMD_NVSTR_Pos          (13UL)                    /*!< MDR_EEPROM CMD: NVSTR (Bit 13)                        */
#define MDR_EEPROM_CMD_NVSTR_Msk          (0x2000UL)                /*!< MDR_EEPROM CMD: NVSTR (Bitfield-Mask: 0x01)           */
/* =========================================================  ADDR  ========================================================== */
/* ==========================================================  DI  =========================================================== */
/* ==========================================================  DO  =========================================================== */
/* ==========================================================  KEY  ========================================================== */


/* =========================================================================================================================== */
/* ================                                       MDR_RST_CLOCK                                       ================ */
/* =========================================================================================================================== */

