StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE9x.h
/* =====================================================  CLOCK_STATUS  ====================================================== */
#define MDR_RST_CLOCK_CLOCK_STATUS_PLL_USB_RDY_Pos (0UL)            /*!< MDR_RST_CLOCK CLOCK_STATUS: PLL_USB_RDY (Bit 0)       */
#define MDR_RST_CLOCK_CLOCK_STATUS_PLL_USB_RDY_Msk (0x1UL)          /*!< MDR_RST_CLOCK CLOCK_STATUS: PLL_USB_RDY (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_CLOCK_STATUS_PLL_CPU_RDY_Pos (1UL)            /*!< MDR_RST_CLOCK CLOCK_STATUS: PLL_CPU_RDY (Bit 1)       */
#define MDR_RST_CLOCK_CLOCK_STATUS_PLL_CPU_RDY_Msk (0x2UL)          /*!< MDR_RST_CLOCK CLOCK_STATUS: PLL_CPU_RDY (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_CLOCK_STATUS_HSE_RDY_Pos (2UL)                /*!< MDR_RST_CLOCK CLOCK_STATUS: HSE_RDY (Bit 2)           */
#define MDR_RST_CLOCK_CLOCK_STATUS_HSE_RDY_Msk (0x4UL)              /*!< MDR_RST_CLOCK CLOCK_STATUS: HSE_RDY (Bitfield-Mask: 0x01) */
/* ======================================================  PLL_CONTROL  ====================================================== */
#define MDR_RST_CLOCK_PLL_CONTROL_PLL_USB_ON_Pos (0UL)              /*!< MDR_RST_CLOCK PLL_CONTROL: PLL_USB_ON (Bit 0)         */
#define MDR_RST_CLOCK_PLL_CONTROL_PLL_USB_ON_Msk (0x1UL)            /*!< MDR_RST_CLOCK PLL_CONTROL: PLL_USB_ON (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL_CONTROL_PLL_USB_PLD_Pos (1UL)             /*!< MDR_RST_CLOCK PLL_CONTROL: PLL_USB_PLD (Bit 1)        */
#define MDR_RST_CLOCK_PLL_CONTROL_PLL_USB_PLD_Msk (0x2UL)           /*!< MDR_RST_CLOCK PLL_CONTROL: PLL_USB_PLD (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL_CONTROL_PLL_CPU_ON_Pos (2UL)              /*!< MDR_RST_CLOCK PLL_CONTROL: PLL_CPU_ON (Bit 2)         */
#define MDR_RST_CLOCK_PLL_CONTROL_PLL_CPU_ON_Msk (0x4UL)            /*!< MDR_RST_CLOCK PLL_CONTROL: PLL_CPU_ON (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL_CONTROL_PLL_CPU_PLD_Pos (3UL)             /*!< MDR_RST_CLOCK PLL_CONTROL: PLL_CPU_PLD (Bit 3)        */
#define MDR_RST_CLOCK_PLL_CONTROL_PLL_CPU_PLD_Msk (0x8UL)           /*!< MDR_RST_CLOCK PLL_CONTROL: PLL_CPU_PLD (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL_CONTROL_PLL_USB_MUL_Pos (4UL)             /*!< MDR_RST_CLOCK PLL_CONTROL: PLL_USB_MUL (Bit 4)        */
#define MDR_RST_CLOCK_PLL_CONTROL_PLL_USB_MUL_Msk (0xf0UL)          /*!< MDR_RST_CLOCK PLL_CONTROL: PLL_USB_MUL (Bitfield-Mask: 0x0f) */
#define MDR_RST_CLOCK_PLL_CONTROL_PLL_CPU_MUL_Pos (8UL)             /*!< MDR_RST_CLOCK PLL_CONTROL: PLL_CPU_MUL (Bit 8)        */
#define MDR_RST_CLOCK_PLL_CONTROL_PLL_CPU_MUL_Msk (0xf00UL)         /*!< MDR_RST_CLOCK PLL_CONTROL: PLL_CPU_MUL (Bitfield-Mask: 0x0f) */
/* ======================================================  HS_CONTROL  ======================================================= */
#define MDR_RST_CLOCK_HS_CONTROL_HSE_ON_Pos (0UL)                   /*!< MDR_RST_CLOCK HS_CONTROL: HSE_ON (Bit 0)              */
#define MDR_RST_CLOCK_HS_CONTROL_HSE_ON_Msk (0x1UL)                 /*!< MDR_RST_CLOCK HS_CONTROL: HSE_ON (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_HS_CONTROL_HSE_BYP_Pos (1UL)                  /*!< MDR_RST_CLOCK HS_CONTROL: HSE_BYP (Bit 1)             */
#define MDR_RST_CLOCK_HS_CONTROL_HSE_BYP_Msk (0x2UL)                /*!< MDR_RST_CLOCK HS_CONTROL: HSE_BYP (Bitfield-Mask: 0x01) */
/* =======================================================  CPU_CLOCK  ======================================================= */
#define MDR_RST_CLOCK_CPU_CLOCK_CPU_C1_SEL_Pos (0UL)                /*!< MDR_RST_CLOCK CPU_CLOCK: CPU_C1_SEL (Bit 0)           */
#define MDR_RST_CLOCK_CPU_CLOCK_CPU_C1_SEL_Msk (0x3UL)              /*!< MDR_RST_CLOCK CPU_CLOCK: CPU_C1_SEL (Bitfield-Mask: 0x03) */
#define MDR_RST_CLOCK_CPU_CLOCK_CPU_C2_SEL_Pos (2UL)                /*!< MDR_RST_CLOCK CPU_CLOCK: CPU_C2_SEL (Bit 2)           */
#define MDR_RST_CLOCK_CPU_CLOCK_CPU_C2_SEL_Msk (0x4UL)              /*!< MDR_RST_CLOCK CPU_CLOCK: CPU_C2_SEL (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_CPU_CLOCK_CPU_C3_SEL_Pos (4UL)                /*!< MDR_RST_CLOCK CPU_CLOCK: CPU_C3_SEL (Bit 4)           */
#define MDR_RST_CLOCK_CPU_CLOCK_CPU_C3_SEL_Msk (0xf0UL)             /*!< MDR_RST_CLOCK CPU_CLOCK: CPU_C3_SEL (Bitfield-Mask: 0x0f) */
#define MDR_RST_CLOCK_CPU_CLOCK_HCLK_SEL_Pos (8UL)                  /*!< MDR_RST_CLOCK CPU_CLOCK: HCLK_SEL (Bit 8)             */
#define MDR_RST_CLOCK_CPU_CLOCK_HCLK_SEL_Msk (0x300UL)              /*!< MDR_RST_CLOCK CPU_CLOCK: HCLK_SEL (Bitfield-Mask: 0x03) */
/* =======================================================  USB_CLOCK  ======================================================= */
#define MDR_RST_CLOCK_USB_CLOCK_USB_C1_SEL_Pos (0UL)                /*!< MDR_RST_CLOCK USB_CLOCK: USB_C1_SEL (Bit 0)           */
#define MDR_RST_CLOCK_USB_CLOCK_USB_C1_SEL_Msk (0x3UL)              /*!< MDR_RST_CLOCK USB_CLOCK: USB_C1_SEL (Bitfield-Mask: 0x03) */
#define MDR_RST_CLOCK_USB_CLOCK_USB_C2_SEL_Pos (2UL)                /*!< MDR_RST_CLOCK USB_CLOCK: USB_C2_SEL (Bit 2)           */
#define MDR_RST_CLOCK_USB_CLOCK_USB_C2_SEL_Msk (0x4UL)              /*!< MDR_RST_CLOCK USB_CLOCK: USB_C2_SEL (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_USB_CLOCK_USB_C3_SEL_Pos (4UL)                /*!< MDR_RST_CLOCK USB_CLOCK: USB_C3_SEL (Bit 4)           */
#define MDR_RST_CLOCK_USB_CLOCK_USB_C3_SEL_Msk (0x10UL)             /*!< MDR_RST_CLOCK USB_CLOCK: USB_C3_SEL (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_USB_CLOCK_USB_EN_Pos (8UL)                    /*!< MDR_RST_CLOCK USB_CLOCK: USB_EN (Bit 8)               */
#define MDR_RST_CLOCK_USB_CLOCK_USB_EN_Msk (0x100UL)                /*!< MDR_RST_CLOCK USB_CLOCK: USB_EN (Bitfield-Mask: 0x01) */
/* =======================================================  ADC_CLOCK  ======================================================= */
#define MDR_RST_CLOCK_ADC_CLOCK_ADC_C1_SEL_Pos (0UL)                /*!< MDR_RST_CLOCK ADC_CLOCK: ADC_C1_SEL (Bit 0)           */
#define MDR_RST_CLOCK_ADC_CLOCK_ADC_C1_SEL_Msk (0x3UL)              /*!< MDR_RST_CLOCK ADC_CLOCK: ADC_C1_SEL (Bitfield-Mask: 0x03) */
#define MDR_RST_CLOCK_ADC_CLOCK_ADC_C2_SEL_Pos (4UL)                /*!< MDR_RST_CLOCK ADC_CLOCK: ADC_C2_SEL (Bit 4)           */
#define MDR_RST_CLOCK_ADC_CLOCK_ADC_C2_SEL_Msk (0x30UL)             /*!< MDR_RST_CLOCK ADC_CLOCK: ADC_C2_SEL (Bitfield-Mask: 0x03) */
#define MDR_RST_CLOCK_ADC_CLOCK_ADC_C3_SEL_Pos (8UL)                /*!< MDR_RST_CLOCK ADC_CLOCK: ADC_C3_SEL (Bit 8)           */
#define MDR_RST_CLOCK_ADC_CLOCK_ADC_C3_SEL_Msk (0xf00UL)            /*!< MDR_RST_CLOCK ADC_CLOCK: ADC_C3_SEL (Bitfield-Mask: 0x0f) */
#define MDR_RST_CLOCK_ADC_CLOCK_ADC_CLK_EN_Pos (13UL)               /*!< MDR_RST_CLOCK ADC_CLOCK: ADC_CLK_EN (Bit 13)          */
#define MDR_RST_CLOCK_ADC_CLOCK_ADC_CLK_EN_Msk (0x2000UL)           /*!< MDR_RST_CLOCK ADC_CLOCK: ADC_CLK_EN (Bitfield-Mask: 0x01) */
/* =======================================================  RTC_CLOCK  ======================================================= */
#define MDR_RST_CLOCK_RTC_CLOCK_HSE_SEL_Pos (0UL)                   /*!< MDR_RST_CLOCK RTC_CLOCK: HSE_SEL (Bit 0)              */
#define MDR_RST_CLOCK_RTC_CLOCK_HSE_SEL_Msk (0xfUL)                 /*!< MDR_RST_CLOCK RTC_CLOCK: HSE_SEL (Bitfield-Mask: 0x0f) */
#define MDR_RST_CLOCK_RTC_CLOCK_HSI_SEL_Pos (4UL)                   /*!< MDR_RST_CLOCK RTC_CLOCK: HSI_SEL (Bit 4)              */
#define MDR_RST_CLOCK_RTC_CLOCK_HSI_SEL_Msk (0xf0UL)                /*!< MDR_RST_CLOCK RTC_CLOCK: HSI_SEL (Bitfield-Mask: 0x0f) */
#define MDR_RST_CLOCK_RTC_CLOCK_HSE_RTC_EN_Pos (8UL)                /*!< MDR_RST_CLOCK RTC_CLOCK: HSE_RTC_EN (Bit 8)           */
#define MDR_RST_CLOCK_RTC_CLOCK_HSE_RTC_EN_Msk (0x100UL)            /*!< MDR_RST_CLOCK RTC_CLOCK: HSE_RTC_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_RTC_CLOCK_HSI_RTC_EN_Pos (9UL)                /*!< MDR_RST_CLOCK RTC_CLOCK: HSI_RTC_EN (Bit 9)           */
#define MDR_RST_CLOCK_RTC_CLOCK_HSI_RTC_EN_Msk (0x200UL)            /*!< MDR_RST_CLOCK RTC_CLOCK: HSI_RTC_EN (Bitfield-Mask: 0x01) */
/* =======================================================  PER_CLOCK  ======================================================= */
#define MDR_RST_CLOCK_PER_CLOCK_CAN1_CLK_EN_Pos (0UL)               /*!< MDR_RST_CLOCK PER_CLOCK: CAN1_CLK_EN (Bit 0)          */
#define MDR_RST_CLOCK_PER_CLOCK_CAN1_CLK_EN_Msk (0x1UL)             /*!< MDR_RST_CLOCK PER_CLOCK: CAN1_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER_CLOCK_CAN2_CLK_EN_Pos (1UL)               /*!< MDR_RST_CLOCK PER_CLOCK: CAN2_CLK_EN (Bit 1)          */
#define MDR_RST_CLOCK_PER_CLOCK_CAN2_CLK_EN_Msk (0x2UL)             /*!< MDR_RST_CLOCK PER_CLOCK: CAN2_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER_CLOCK_USB_CLK_EN_Pos (2UL)                /*!< MDR_RST_CLOCK PER_CLOCK: USB_CLK_EN (Bit 2)           */
#define MDR_RST_CLOCK_PER_CLOCK_USB_CLK_EN_Msk (0x4UL)              /*!< MDR_RST_CLOCK PER_CLOCK: USB_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER_CLOCK_EEPROM_CLK_EN_Pos (3UL)             /*!< MDR_RST_CLOCK PER_CLOCK: EEPROM_CLK_EN (Bit 3)        */
#define MDR_RST_CLOCK_PER_CLOCK_EEPROM_CLK_EN_Msk (0x8UL)           /*!< MDR_RST_CLOCK PER_CLOCK: EEPROM_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER_CLOCK_RST_CLK_EN_Pos (4UL)                /*!< MDR_RST_CLOCK PER_CLOCK: RST_CLK_EN (Bit 4)           */
#define MDR_RST_CLOCK_PER_CLOCK_RST_CLK_EN_Msk (0x10UL)             /*!< MDR_RST_CLOCK PER_CLOCK: RST_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER_CLOCK_DMA_CLK_EN_Pos (5UL)                /*!< MDR_RST_CLOCK PER_CLOCK: DMA_CLK_EN (Bit 5)           */
#define MDR_RST_CLOCK_PER_CLOCK_DMA_CLK_EN_Msk (0x20UL)             /*!< MDR_RST_CLOCK PER_CLOCK: DMA_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER_CLOCK_UART1_CLK_EN_Pos (6UL)              /*!< MDR_RST_CLOCK PER_CLOCK: UART1_CLK_EN (Bit 6)         */
#define MDR_RST_CLOCK_PER_CLOCK_UART1_CLK_EN_Msk (0x40UL)           /*!< MDR_RST_CLOCK PER_CLOCK: UART1_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER_CLOCK_UART2_CLK_EN_Pos (7UL)              /*!< MDR_RST_CLOCK PER_CLOCK: UART2_CLK_EN (Bit 7)         */
#define MDR_RST_CLOCK_PER_CLOCK_UART2_CLK_EN_Msk (0x80UL)           /*!< MDR_RST_CLOCK PER_CLOCK: UART2_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER_CLOCK_SPI1_CLK_EN_Pos (8UL)               /*!< MDR_RST_CLOCK PER_CLOCK: SPI1_CLK_EN (Bit 8)          */
#define MDR_RST_CLOCK_PER_CLOCK_SPI1_CLK_EN_Msk (0x100UL)           /*!< MDR_RST_CLOCK PER_CLOCK: SPI1_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER_CLOCK_I2C_CLK_EN_Pos (10UL)               /*!< MDR_RST_CLOCK PER_CLOCK: I2C_CLK_EN (Bit 10)          */
#define MDR_RST_CLOCK_PER_CLOCK_I2C_CLK_EN_Msk (0x400UL)            /*!< MDR_RST_CLOCK PER_CLOCK: I2C_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER_CLOCK_PWR_CLK_EN_Pos (11UL)               /*!< MDR_RST_CLOCK PER_CLOCK: PWR_CLK_EN (Bit 11)          */
#define MDR_RST_CLOCK_PER_CLOCK_PWR_CLK_EN_Msk (0x800UL)            /*!< MDR_RST_CLOCK PER_CLOCK: PWR_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER_CLOCK_WWDT_CLK_EN_Pos (12UL)              /*!< MDR_RST_CLOCK PER_CLOCK: WWDT_CLK_EN (Bit 12)         */
#define MDR_RST_CLOCK_PER_CLOCK_WWDT_CLK_EN_Msk (0x1000UL)          /*!< MDR_RST_CLOCK PER_CLOCK: WWDT_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER_CLOCK_IWDT_CLK_EN_Pos (13UL)              /*!< MDR_RST_CLOCK PER_CLOCK: IWDT_CLK_EN (Bit 13)         */
#define MDR_RST_CLOCK_PER_CLOCK_IWDT_CLK_EN_Msk (0x2000UL)          /*!< MDR_RST_CLOCK PER_CLOCK: IWDT_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER_CLOCK_TIMER1_CLK_EN_Pos (14UL)            /*!< MDR_RST_CLOCK PER_CLOCK: TIMER1_CLK_EN (Bit 14)       */
#define MDR_RST_CLOCK_PER_CLOCK_TIMER1_CLK_EN_Msk (0x4000UL)        /*!< MDR_RST_CLOCK PER_CLOCK: TIMER1_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER_CLOCK_TIMER2_CLK_EN_Pos (15UL)            /*!< MDR_RST_CLOCK PER_CLOCK: TIMER2_CLK_EN (Bit 15)       */
#define MDR_RST_CLOCK_PER_CLOCK_TIMER2_CLK_EN_Msk (0x8000UL)        /*!< MDR_RST_CLOCK PER_CLOCK: TIMER2_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER_CLOCK_TIMER3_CLK_EN_Pos (16UL)            /*!< MDR_RST_CLOCK PER_CLOCK: TIMER3_CLK_EN (Bit 16)       */
#define MDR_RST_CLOCK_PER_CLOCK_TIMER3_CLK_EN_Msk (0x10000UL)       /*!< MDR_RST_CLOCK PER_CLOCK: TIMER3_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER_CLOCK_ADC_CLK_EN_Pos (17UL)               /*!< MDR_RST_CLOCK PER_CLOCK: ADC_CLK_EN (Bit 17)          */
#define MDR_RST_CLOCK_PER_CLOCK_ADC_CLK_EN_Msk (0x20000UL)          /*!< MDR_RST_CLOCK PER_CLOCK: ADC_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER_CLOCK_DAC_CLK_EN_Pos (18UL)               /*!< MDR_RST_CLOCK PER_CLOCK: DAC_CLK_EN (Bit 18)          */
#define MDR_RST_CLOCK_PER_CLOCK_DAC_CLK_EN_Msk (0x40000UL)          /*!< MDR_RST_CLOCK PER_CLOCK: DAC_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER_CLOCK_CMP_CLK_EN_Pos (19UL)               /*!< MDR_RST_CLOCK PER_CLOCK: CMP_CLK_EN (Bit 19)          */
#define MDR_RST_CLOCK_PER_CLOCK_CMP_CLK_EN_Msk (0x80000UL)          /*!< MDR_RST_CLOCK PER_CLOCK: CMP_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER_CLOCK_SPI2_CLK_EN_Pos (20UL)              /*!< MDR_RST_CLOCK PER_CLOCK: SPI2_CLK_EN (Bit 20)         */
#define MDR_RST_CLOCK_PER_CLOCK_SPI2_CLK_EN_Msk (0x100000UL)        /*!< MDR_RST_CLOCK PER_CLOCK: SPI2_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER_CLOCK_PORTA_CLK_EN_Pos (21UL)             /*!< MDR_RST_CLOCK PER_CLOCK: PORTA_CLK_EN (Bit 21)        */
#define MDR_RST_CLOCK_PER_CLOCK_PORTA_CLK_EN_Msk (0x200000UL)       /*!< MDR_RST_CLOCK PER_CLOCK: PORTA_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER_CLOCK_PORTB_CLK_EN_Pos (22UL)             /*!< MDR_RST_CLOCK PER_CLOCK: PORTB_CLK_EN (Bit 22)        */
#define MDR_RST_CLOCK_PER_CLOCK_PORTB_CLK_EN_Msk (0x400000UL)       /*!< MDR_RST_CLOCK PER_CLOCK: PORTB_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER_CLOCK_PORTC_CLK_EN_Pos (23UL)             /*!< MDR_RST_CLOCK PER_CLOCK: PORTC_CLK_EN (Bit 23)        */
#define MDR_RST_CLOCK_PER_CLOCK_PORTC_CLK_EN_Msk (0x800000UL)       /*!< MDR_RST_CLOCK PER_CLOCK: PORTC_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER_CLOCK_PORTD_CLK_EN_Pos (24UL)             /*!< MDR_RST_CLOCK PER_CLOCK: PORTD_CLK_EN (Bit 24)        */
#define MDR_RST_CLOCK_PER_CLOCK_PORTD_CLK_EN_Msk (0x1000000UL)      /*!< MDR_RST_CLOCK PER_CLOCK: PORTD_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER_CLOCK_PORTE_CLK_EN_Pos (25UL)             /*!< MDR_RST_CLOCK PER_CLOCK: PORTE_CLK_EN (Bit 25)        */
#define MDR_RST_CLOCK_PER_CLOCK_PORTE_CLK_EN_Msk (0x2000000UL)      /*!< MDR_RST_CLOCK PER_CLOCK: PORTE_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER_CLOCK_BKP_CLK_EN_Pos (27UL)               /*!< MDR_RST_CLOCK PER_CLOCK: BKP_CLK_EN (Bit 27)          */
#define MDR_RST_CLOCK_PER_CLOCK_BKP_CLK_EN_Msk (0x8000000UL)        /*!< MDR_RST_CLOCK PER_CLOCK: BKP_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER_CLOCK_PORTF_CLK_EN_Pos (29UL)             /*!< MDR_RST_CLOCK PER_CLOCK: PORTF_CLK_EN (Bit 29)        */
#define MDR_RST_CLOCK_PER_CLOCK_PORTF_CLK_EN_Msk (0x20000000UL)     /*!< MDR_RST_CLOCK PER_CLOCK: PORTF_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER_CLOCK_EBC_CLK_EN_Pos (30UL)               /*!< MDR_RST_CLOCK PER_CLOCK: EBC_CLK_EN (Bit 30)          */
#define MDR_RST_CLOCK_PER_CLOCK_EBC_CLK_EN_Msk (0x40000000UL)       /*!< MDR_RST_CLOCK PER_CLOCK: EBC_CLK_EN (Bitfield-Mask: 0x01) */
/* =======================================================  CAN_CLOCK  ======================================================= */
#define MDR_RST_CLOCK_CAN_CLOCK_CAN1_BRG_Pos (0UL)                  /*!< MDR_RST_CLOCK CAN_CLOCK: CAN1_BRG (Bit 0)             */
#define MDR_RST_CLOCK_CAN_CLOCK_CAN1_BRG_Msk (0x7UL)                /*!< MDR_RST_CLOCK CAN_CLOCK: CAN1_BRG (Bitfield-Mask: 0x07) */
#define MDR_RST_CLOCK_CAN_CLOCK_CAN2_BRG_Pos (8UL)                  /*!< MDR_RST_CLOCK CAN_CLOCK: CAN2_BRG (Bit 8)             */
#define MDR_RST_CLOCK_CAN_CLOCK_CAN2_BRG_Msk (0x700UL)              /*!< MDR_RST_CLOCK CAN_CLOCK: CAN2_BRG (Bitfield-Mask: 0x07) */
#define MDR_RST_CLOCK_CAN_CLOCK_CAN1_CLK_EN_Pos (24UL)              /*!< MDR_RST_CLOCK CAN_CLOCK: CAN1_CLK_EN (Bit 24)         */
#define MDR_RST_CLOCK_CAN_CLOCK_CAN1_CLK_EN_Msk (0x1000000UL)       /*!< MDR_RST_CLOCK CAN_CLOCK: CAN1_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_CAN_CLOCK_CAN2_CLK_EN_Pos (25UL)              /*!< MDR_RST_CLOCK CAN_CLOCK: CAN2_CLK_EN (Bit 25)         */
#define MDR_RST_CLOCK_CAN_CLOCK_CAN2_CLK_EN_Msk (0x2000000UL)       /*!< MDR_RST_CLOCK CAN_CLOCK: CAN2_CLK_EN (Bitfield-Mask: 0x01) */
/* =======================================================  TIM_CLOCK  ======================================================= */
#define MDR_RST_CLOCK_TIM_CLOCK_TIM1_BRG_Pos (0UL)                  /*!< MDR_RST_CLOCK TIM_CLOCK: TIM1_BRG (Bit 0)             */
#define MDR_RST_CLOCK_TIM_CLOCK_TIM1_BRG_Msk (0x7UL)                /*!< MDR_RST_CLOCK TIM_CLOCK: TIM1_BRG (Bitfield-Mask: 0x07) */
#define MDR_RST_CLOCK_TIM_CLOCK_TIM2_BRG_Pos (8UL)                  /*!< MDR_RST_CLOCK TIM_CLOCK: TIM2_BRG (Bit 8)             */
#define MDR_RST_CLOCK_TIM_CLOCK_TIM2_BRG_Msk (0x700UL)              /*!< MDR_RST_CLOCK TIM_CLOCK: TIM2_BRG (Bitfield-Mask: 0x07) */
#define MDR_RST_CLOCK_TIM_CLOCK_TIM3_BRG_Pos (16UL)                 /*!< MDR_RST_CLOCK TIM_CLOCK: TIM3_BRG (Bit 16)            */
#define MDR_RST_CLOCK_TIM_CLOCK_TIM3_BRG_Msk (0x70000UL)            /*!< MDR_RST_CLOCK TIM_CLOCK: TIM3_BRG (Bitfield-Mask: 0x07) */
#define MDR_RST_CLOCK_TIM_CLOCK_TIM1_CLK_EN_Pos (24UL)              /*!< MDR_RST_CLOCK TIM_CLOCK: TIM1_CLK_EN (Bit 24)         */
#define MDR_RST_CLOCK_TIM_CLOCK_TIM1_CLK_EN_Msk (0x1000000UL)       /*!< MDR_RST_CLOCK TIM_CLOCK: TIM1_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_TIM_CLOCK_TIM2_CLK_EN_Pos (25UL)              /*!< MDR_RST_CLOCK TIM_CLOCK: TIM2_CLK_EN (Bit 25)         */
#define MDR_RST_CLOCK_TIM_CLOCK_TIM2_CLK_EN_Msk (0x2000000UL)       /*!< MDR_RST_CLOCK TIM_CLOCK: TIM2_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_TIM_CLOCK_TIM3_CLK_EN_Pos (26UL)              /*!< MDR_RST_CLOCK TIM_CLOCK: TIM3_CLK_EN (Bit 26)         */
#define MDR_RST_CLOCK_TIM_CLOCK_TIM3_CLK_EN_Msk (0x4000000UL)       /*!< MDR_RST_CLOCK TIM_CLOCK: TIM3_CLK_EN (Bitfield-Mask: 0x01) */
/* ======================================================  UART_CLOCK  ======================================================= */
#define MDR_RST_CLOCK_UART_CLOCK_UART1_BRG_Pos (0UL)                /*!< MDR_RST_CLOCK UART_CLOCK: UART1_BRG (Bit 0)           */
#define MDR_RST_CLOCK_UART_CLOCK_UART1_BRG_Msk (0x7UL)              /*!< MDR_RST_CLOCK UART_CLOCK: UART1_BRG (Bitfield-Mask: 0x07) */
#define MDR_RST_CLOCK_UART_CLOCK_UART2_BRG_Pos (8UL)                /*!< MDR_RST_CLOCK UART_CLOCK: UART2_BRG (Bit 8)           */
#define MDR_RST_CLOCK_UART_CLOCK_UART2_BRG_Msk (0x700UL)            /*!< MDR_RST_CLOCK UART_CLOCK: UART2_BRG (Bitfield-Mask: 0x07) */
#define MDR_RST_CLOCK_UART_CLOCK_UART1_CLK_EN_Pos (24UL)            /*!< MDR_RST_CLOCK UART_CLOCK: UART1_CLK_EN (Bit 24)       */
#define MDR_RST_CLOCK_UART_CLOCK_UART1_CLK_EN_Msk (0x1000000UL)     /*!< MDR_RST_CLOCK UART_CLOCK: UART1_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_UART_CLOCK_UART2_CLK_EN_Pos (25UL)            /*!< MDR_RST_CLOCK UART_CLOCK: UART2_CLK_EN (Bit 25)       */
#define MDR_RST_CLOCK_UART_CLOCK_UART2_CLK_EN_Msk (0x2000000UL)     /*!< MDR_RST_CLOCK UART_CLOCK: UART2_CLK_EN (Bitfield-Mask: 0x01) */
/* =======================================================  SSP_CLOCK  ======================================================= */
#define MDR_RST_CLOCK_SSP_CLOCK_SSP1_BRG_Pos (0UL)                  /*!< MDR_RST_CLOCK SSP_CLOCK: SSP1_BRG (Bit 0)             */
#define MDR_RST_CLOCK_SSP_CLOCK_SSP1_BRG_Msk (0x7UL)                /*!< MDR_RST_CLOCK SSP_CLOCK: SSP1_BRG (Bitfield-Mask: 0x07) */
#define MDR_RST_CLOCK_SSP_CLOCK_SSP2_BRG_Pos (8UL)                  /*!< MDR_RST_CLOCK SSP_CLOCK: SSP2_BRG (Bit 8)             */
#define MDR_RST_CLOCK_SSP_CLOCK_SSP2_BRG_Msk (0x700UL)              /*!< MDR_RST_CLOCK SSP_CLOCK: SSP2_BRG (Bitfield-Mask: 0x07) */
#define MDR_RST_CLOCK_SSP_CLOCK_SSP3_BRG_Pos (16UL)                 /*!< MDR_RST_CLOCK SSP_CLOCK: SSP3_BRG (Bit 16)            */
#define MDR_RST_CLOCK_SSP_CLOCK_SSP3_BRG_Msk (0x70000UL)            /*!< MDR_RST_CLOCK SSP_CLOCK: SSP3_BRG (Bitfield-Mask: 0x07) */
#define MDR_RST_CLOCK_SSP_CLOCK_SSP1_CLK_EN_Pos (24UL)              /*!< MDR_RST_CLOCK SSP_CLOCK: SSP1_CLK_EN (Bit 24)         */
#define MDR_RST_CLOCK_SSP_CLOCK_SSP1_CLK_EN_Msk (0x1000000UL)       /*!< MDR_RST_CLOCK SSP_CLOCK: SSP1_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_SSP_CLOCK_SSP2_CLK_EN_Pos (25UL)              /*!< MDR_RST_CLOCK SSP_CLOCK: SSP2_CLK_EN (Bit 25)         */
#define MDR_RST_CLOCK_SSP_CLOCK_SSP2_CLK_EN_Msk (0x2000000UL)       /*!< MDR_RST_CLOCK SSP_CLOCK: SSP2_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_SSP_CLOCK_SSP3_CLK_EN_Pos (26UL)              /*!< MDR_RST_CLOCK SSP_CLOCK: SSP3_CLK_EN (Bit 26)         */
#define MDR_RST_CLOCK_SSP_CLOCK_SSP3_CLK_EN_Msk (0x4000000UL)       /*!< MDR_RST_CLOCK SSP_CLOCK: SSP3_CLK_EN (Bitfield-Mask: 0x01) */


/* =========================================================================================================================== */
/* ================                                         MDR_WWDT                                          ================ */
/* =========================================================================================================================== */

/* ==========================================================  CR  =========================================================== */
#define MDR_WWDT_CR_T_Pos                 (0UL)                     /*!< MDR_WWDT CR: T (Bit 0)                                */
#define MDR_WWDT_CR_T_Msk                 (0x7fUL)                  /*!< MDR_WWDT CR: T (Bitfield-Mask: 0x7f)                  */
#define MDR_WWDT_CR_WDGA_Pos              (7UL)                     /*!< MDR_WWDT CR: WDGA (Bit 7)                             */
#define MDR_WWDT_CR_WDGA_Msk              (0x80UL)                  /*!< MDR_WWDT CR: WDGA (Bitfield-Mask: 0x01)               */
/* ==========================================================  CFR  ========================================================== */
#define MDR_WWDT_CFR_W_Pos                (0UL)                     /*!< MDR_WWDT CFR: W (Bit 0)                               */
#define MDR_WWDT_CFR_W_Msk                (0x7fUL)                  /*!< MDR_WWDT CFR: W (Bitfield-Mask: 0x7f)                 */
#define MDR_WWDT_CFR_WGTB_Pos             (7UL)                     /*!< MDR_WWDT CFR: WGTB (Bit 7)                            */
#define MDR_WWDT_CFR_WGTB_Msk             (0x180UL)                 /*!< MDR_WWDT CFR: WGTB (Bitfield-Mask: 0x03)              */
#define MDR_WWDT_CFR_EWI_Pos              (9UL)                     /*!< MDR_WWDT CFR: EWI (Bit 9)                             */
#define MDR_WWDT_CFR_EWI_Msk              (0x200UL)                 /*!< MDR_WWDT CFR: EWI (Bitfield-Mask: 0x01)               */
/* ==========================================================  SR  =========================================================== */
#define MDR_WWDT_SR_EWIF_Pos              (0UL)                     /*!< MDR_WWDT SR: EWIF (Bit 0)                             */
#define MDR_WWDT_SR_EWIF_Msk              (0x1UL)                   /*!< MDR_WWDT SR: EWIF (Bitfield-Mask: 0x01)               */


