StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE9x.h
/* =========================================================================================================================== */
/* ================                                         MDR_IWDT                                          ================ */
/* =========================================================================================================================== */

/* ==========================================================  KR  =========================================================== */
#define MDR_IWDT_KR_KEY_Pos               (0UL)                     /*!< MDR_IWDT KR: KEY (Bit 0)                              */
#define MDR_IWDT_KR_KEY_Msk               (0xffffUL)                /*!< MDR_IWDT KR: KEY (Bitfield-Mask: 0xffff)              */
/* ==========================================================  PR  =========================================================== */
#define MDR_IWDT_PR_PR_Pos                (0UL)                     /*!< MDR_IWDT PR: PR (Bit 0)                               */
#define MDR_IWDT_PR_PR_Msk                (0x7UL)                   /*!< MDR_IWDT PR: PR (Bitfield-Mask: 0x07)                 */
/* ==========================================================  RLR  ========================================================== */
#define MDR_IWDT_RLR_PRL_Pos              (0UL)                     /*!< MDR_IWDT RLR: PRL (Bit 0)                             */
#define MDR_IWDT_RLR_PRL_Msk              (0xfffUL)                 /*!< MDR_IWDT RLR: PRL (Bitfield-Mask: 0xfff)              */
/* ==========================================================  SR  =========================================================== */
#define MDR_IWDT_SR_PVU_Pos               (0UL)                     /*!< MDR_IWDT SR: PVU (Bit 0)                              */
#define MDR_IWDT_SR_PVU_Msk               (0x1UL)                   /*!< MDR_IWDT SR: PVU (Bitfield-Mask: 0x01)                */
#define MDR_IWDT_SR_RVU_Pos               (1UL)                     /*!< MDR_IWDT SR: RVU (Bit 1)                              */
#define MDR_IWDT_SR_RVU_Msk               (0x2UL)                   /*!< MDR_IWDT SR: RVU (Bitfield-Mask: 0x01)                */


/* =========================================================================================================================== */
/* ================                                          MDR_ADC                                          ================ */
/* =========================================================================================================================== */

/* =======================================================  ADC1_Cfg  ======================================================== */
#define MDR_ADC_ADC1_Cfg_ADON_Pos         (0UL)                     /*!< MDR_ADC ADC1_Cfg: ADON (Bit 0)                        */
#define MDR_ADC_ADC1_Cfg_ADON_Msk         (0x1UL)                   /*!< MDR_ADC ADC1_Cfg: ADON (Bitfield-Mask: 0x01)          */
#define MDR_ADC_ADC1_Cfg_GO_Pos           (1UL)                     /*!< MDR_ADC ADC1_Cfg: GO (Bit 1)                          */
#define MDR_ADC_ADC1_Cfg_GO_Msk           (0x2UL)                   /*!< MDR_ADC ADC1_Cfg: GO (Bitfield-Mask: 0x01)            */
#define MDR_ADC_ADC1_Cfg_CLKS_Pos         (2UL)                     /*!< MDR_ADC ADC1_Cfg: CLKS (Bit 2)                        */
#define MDR_ADC_ADC1_Cfg_CLKS_Msk         (0x4UL)                   /*!< MDR_ADC ADC1_Cfg: CLKS (Bitfield-Mask: 0x01)          */
#define MDR_ADC_ADC1_Cfg_SAMPLE_Pos       (3UL)                     /*!< MDR_ADC ADC1_Cfg: SAMPLE (Bit 3)                      */
#define MDR_ADC_ADC1_Cfg_SAMPLE_Msk       (0x8UL)                   /*!< MDR_ADC ADC1_Cfg: SAMPLE (Bitfield-Mask: 0x01)        */
#define MDR_ADC_ADC1_Cfg_CHS_Pos          (4UL)                     /*!< MDR_ADC ADC1_Cfg: CHS (Bit 4)                         */
#define MDR_ADC_ADC1_Cfg_CHS_Msk          (0x1f0UL)                 /*!< MDR_ADC ADC1_Cfg: CHS (Bitfield-Mask: 0x1f)           */
#define MDR_ADC_ADC1_Cfg_CHCH_Pos         (9UL)                     /*!< MDR_ADC ADC1_Cfg: CHCH (Bit 9)                        */
#define MDR_ADC_ADC1_Cfg_CHCH_Msk         (0x200UL)                 /*!< MDR_ADC ADC1_Cfg: CHCH (Bitfield-Mask: 0x01)          */
#define MDR_ADC_ADC1_Cfg_RGNC_Pos         (10UL)                    /*!< MDR_ADC ADC1_Cfg: RGNC (Bit 10)                       */
#define MDR_ADC_ADC1_Cfg_RGNC_Msk         (0x400UL)                 /*!< MDR_ADC ADC1_Cfg: RGNC (Bitfield-Mask: 0x01)          */
#define MDR_ADC_ADC1_Cfg_M_REF_Pos        (11UL)                    /*!< MDR_ADC ADC1_Cfg: M_REF (Bit 11)                      */
#define MDR_ADC_ADC1_Cfg_M_REF_Msk        (0x800UL)                 /*!< MDR_ADC ADC1_Cfg: M_REF (Bitfield-Mask: 0x01)         */
#define MDR_ADC_ADC1_Cfg_DIV_CLK_Pos      (12UL)                    /*!< MDR_ADC ADC1_Cfg: DIV_CLK (Bit 12)                    */
#define MDR_ADC_ADC1_Cfg_DIV_CLK_Msk      (0xf000UL)                /*!< MDR_ADC ADC1_Cfg: DIV_CLK (Bitfield-Mask: 0x0f)       */
#define MDR_ADC_ADC1_Cfg_SYNC_CONV_Pos    (16UL)                    /*!< MDR_ADC ADC1_Cfg: SYNC_CONV (Bit 16)                  */
#define MDR_ADC_ADC1_Cfg_SYNC_CONV_Msk    (0x10000UL)               /*!< MDR_ADC ADC1_Cfg: SYNC_CONV (Bitfield-Mask: 0x01)     */
#define MDR_ADC_ADC1_Cfg_TS_EN_Pos        (17UL)                    /*!< MDR_ADC ADC1_Cfg: TS_EN (Bit 17)                      */
#define MDR_ADC_ADC1_Cfg_TS_EN_Msk        (0x20000UL)               /*!< MDR_ADC ADC1_Cfg: TS_EN (Bitfield-Mask: 0x01)         */
#define MDR_ADC_ADC1_Cfg_TS_BUFF_EN_Pos   (18UL)                    /*!< MDR_ADC ADC1_Cfg: TS_BUFF_EN (Bit 18)                 */
#define MDR_ADC_ADC1_Cfg_TS_BUFF_EN_Msk   (0x40000UL)               /*!< MDR_ADC ADC1_Cfg: TS_BUFF_EN (Bitfield-Mask: 0x01)    */
#define MDR_ADC_ADC1_Cfg_SEL_TS_Pos       (19UL)                    /*!< MDR_ADC ADC1_Cfg: SEL_TS (Bit 19)                     */
#define MDR_ADC_ADC1_Cfg_SEL_TS_Msk       (0x80000UL)               /*!< MDR_ADC ADC1_Cfg: SEL_TS (Bitfield-Mask: 0x01)        */
#define MDR_ADC_ADC1_Cfg_SEL_VREF_Pos     (20UL)                    /*!< MDR_ADC ADC1_Cfg: SEL_VREF (Bit 20)                   */
#define MDR_ADC_ADC1_Cfg_SEL_VREF_Msk     (0x100000UL)              /*!< MDR_ADC ADC1_Cfg: SEL_VREF (Bitfield-Mask: 0x01)      */
#define MDR_ADC_ADC1_Cfg_TR_Pos           (21UL)                    /*!< MDR_ADC ADC1_Cfg: TR (Bit 21)                         */
#define MDR_ADC_ADC1_Cfg_TR_Msk           (0x1e00000UL)             /*!< MDR_ADC ADC1_Cfg: TR (Bitfield-Mask: 0x0f)            */
#define MDR_ADC_ADC1_Cfg_Delay_GO_Pos     (25UL)                    /*!< MDR_ADC ADC1_Cfg: Delay_GO (Bit 25)                   */
#define MDR_ADC_ADC1_Cfg_Delay_GO_Msk     (0xe000000UL)             /*!< MDR_ADC ADC1_Cfg: Delay_GO (Bitfield-Mask: 0x07)      */
#define MDR_ADC_ADC1_Cfg_Delay_ADC_Pos    (28UL)                    /*!< MDR_ADC ADC1_Cfg: Delay_ADC (Bit 28)                  */
#define MDR_ADC_ADC1_Cfg_Delay_ADC_Msk    (0xf0000000UL)            /*!< MDR_ADC ADC1_Cfg: Delay_ADC (Bitfield-Mask: 0x0f)     */
/* =======================================================  ADC2_Cfg  ======================================================== */
#define MDR_ADC_ADC2_Cfg_ADON_Pos         (0UL)                     /*!< MDR_ADC ADC2_Cfg: ADON (Bit 0)                        */
#define MDR_ADC_ADC2_Cfg_ADON_Msk         (0x1UL)                   /*!< MDR_ADC ADC2_Cfg: ADON (Bitfield-Mask: 0x01)          */
#define MDR_ADC_ADC2_Cfg_GO_Pos           (1UL)                     /*!< MDR_ADC ADC2_Cfg: GO (Bit 1)                          */
#define MDR_ADC_ADC2_Cfg_GO_Msk           (0x2UL)                   /*!< MDR_ADC ADC2_Cfg: GO (Bitfield-Mask: 0x01)            */
#define MDR_ADC_ADC2_Cfg_CLKS_Pos         (2UL)                     /*!< MDR_ADC ADC2_Cfg: CLKS (Bit 2)                        */
#define MDR_ADC_ADC2_Cfg_CLKS_Msk         (0x4UL)                   /*!< MDR_ADC ADC2_Cfg: CLKS (Bitfield-Mask: 0x01)          */
#define MDR_ADC_ADC2_Cfg_SAMPLE_Pos       (3UL)                     /*!< MDR_ADC ADC2_Cfg: SAMPLE (Bit 3)                      */
#define MDR_ADC_ADC2_Cfg_SAMPLE_Msk       (0x8UL)                   /*!< MDR_ADC ADC2_Cfg: SAMPLE (Bitfield-Mask: 0x01)        */
#define MDR_ADC_ADC2_Cfg_CHS_Pos          (4UL)                     /*!< MDR_ADC ADC2_Cfg: CHS (Bit 4)                         */
#define MDR_ADC_ADC2_Cfg_CHS_Msk          (0x1f0UL)                 /*!< MDR_ADC ADC2_Cfg: CHS (Bitfield-Mask: 0x1f)           */
#define MDR_ADC_ADC2_Cfg_CHCH_Pos         (9UL)                     /*!< MDR_ADC ADC2_Cfg: CHCH (Bit 9)                        */
#define MDR_ADC_ADC2_Cfg_CHCH_Msk         (0x200UL)                 /*!< MDR_ADC ADC2_Cfg: CHCH (Bitfield-Mask: 0x01)          */
#define MDR_ADC_ADC2_Cfg_RGNC_Pos         (10UL)                    /*!< MDR_ADC ADC2_Cfg: RGNC (Bit 10)                       */
#define MDR_ADC_ADC2_Cfg_RGNC_Msk         (0x400UL)                 /*!< MDR_ADC ADC2_Cfg: RGNC (Bitfield-Mask: 0x01)          */
#define MDR_ADC_ADC2_Cfg_M_REF_Pos        (11UL)                    /*!< MDR_ADC ADC2_Cfg: M_REF (Bit 11)                      */
#define MDR_ADC_ADC2_Cfg_M_REF_Msk        (0x800UL)                 /*!< MDR_ADC ADC2_Cfg: M_REF (Bitfield-Mask: 0x01)         */
#define MDR_ADC_ADC2_Cfg_DIV_CLK_Pos      (12UL)                    /*!< MDR_ADC ADC2_Cfg: DIV_CLK (Bit 12)                    */
#define MDR_ADC_ADC2_Cfg_DIV_CLK_Msk      (0xf000UL)                /*!< MDR_ADC ADC2_Cfg: DIV_CLK (Bitfield-Mask: 0x0f)       */
#define MDR_ADC_ADC2_Cfg_ADC1_OP_Pos      (17UL)                    /*!< MDR_ADC ADC2_Cfg: ADC1_OP (Bit 17)                    */
#define MDR_ADC_ADC2_Cfg_ADC1_OP_Msk      (0x20000UL)               /*!< MDR_ADC ADC2_Cfg: ADC1_OP (Bitfield-Mask: 0x01)       */
#define MDR_ADC_ADC2_Cfg_ADC2_OP_Pos      (18UL)                    /*!< MDR_ADC ADC2_Cfg: ADC2_OP (Bit 18)                    */
#define MDR_ADC_ADC2_Cfg_ADC2_OP_Msk      (0x40000UL)               /*!< MDR_ADC ADC2_Cfg: ADC2_OP (Bitfield-Mask: 0x01)       */
#define MDR_ADC_ADC2_Cfg_Delay_GO_Pos     (25UL)                    /*!< MDR_ADC ADC2_Cfg: Delay_GO (Bit 25)                   */
#define MDR_ADC_ADC2_Cfg_Delay_GO_Msk     (0xe000000UL)             /*!< MDR_ADC ADC2_Cfg: Delay_GO (Bitfield-Mask: 0x07)      */
/* =====================================================  ADC1_H_Level  ====================================================== */
#define MDR_ADC_ADC1_H_Level_Level_Pos    (0UL)                     /*!< MDR_ADC ADC1_H_Level: Level (Bit 0)                   */
#define MDR_ADC_ADC1_H_Level_Level_Msk    (0xfffUL)                 /*!< MDR_ADC ADC1_H_Level: Level (Bitfield-Mask: 0xfff)    */
/* =====================================================  ADC2_H_Level  ====================================================== */
#define MDR_ADC_ADC2_H_Level_Level_Pos    (0UL)                     /*!< MDR_ADC ADC2_H_Level: Level (Bit 0)                   */
#define MDR_ADC_ADC2_H_Level_Level_Msk    (0xfffUL)                 /*!< MDR_ADC ADC2_H_Level: Level (Bitfield-Mask: 0xfff)    */
/* =====================================================  ADC1_L_Level  ====================================================== */
#define MDR_ADC_ADC1_L_Level_Level_Pos    (0UL)                     /*!< MDR_ADC ADC1_L_Level: Level (Bit 0)                   */
#define MDR_ADC_ADC1_L_Level_Level_Msk    (0xfffUL)                 /*!< MDR_ADC ADC1_L_Level: Level (Bitfield-Mask: 0xfff)    */
/* =====================================================  ADC2_L_Level  ====================================================== */
#define MDR_ADC_ADC2_L_Level_Level_Pos    (0UL)                     /*!< MDR_ADC ADC2_L_Level: Level (Bit 0)                   */
#define MDR_ADC_ADC2_L_Level_Level_Msk    (0xfffUL)                 /*!< MDR_ADC ADC2_L_Level: Level (Bitfield-Mask: 0xfff)    */
/* ======================================================  ADC1_RESULT  ====================================================== */
#define MDR_ADC_ADC1_RESULT_Value_Pos     (0UL)                     /*!< MDR_ADC ADC1_RESULT: Value (Bit 0)                    */
#define MDR_ADC_ADC1_RESULT_Value_Msk     (0xfffUL)                 /*!< MDR_ADC ADC1_RESULT: Value (Bitfield-Mask: 0xfff)     */
#define MDR_ADC_ADC1_RESULT_Channel_Pos   (16UL)                    /*!< MDR_ADC ADC1_RESULT: Channel (Bit 16)                 */
#define MDR_ADC_ADC1_RESULT_Channel_Msk   (0x1f0000UL)              /*!< MDR_ADC ADC1_RESULT: Channel (Bitfield-Mask: 0x1f)    */
/* ======================================================  ADC2_RESULT  ====================================================== */
#define MDR_ADC_ADC2_RESULT_Value_Pos     (0UL)                     /*!< MDR_ADC ADC2_RESULT: Value (Bit 0)                    */
#define MDR_ADC_ADC2_RESULT_Value_Msk     (0xfffUL)                 /*!< MDR_ADC ADC2_RESULT: Value (Bitfield-Mask: 0xfff)     */
#define MDR_ADC_ADC2_RESULT_Channel_Pos   (16UL)                    /*!< MDR_ADC ADC2_RESULT: Channel (Bit 16)                 */
#define MDR_ADC_ADC2_RESULT_Channel_Msk   (0x1f0000UL)              /*!< MDR_ADC ADC2_RESULT: Channel (Bitfield-Mask: 0x1f)    */
/* ======================================================  ADC1_STATUS  ====================================================== */
#define MDR_ADC_ADC1_STATUS_Overwrite_Pos (0UL)                     /*!< MDR_ADC ADC1_STATUS: Overwrite (Bit 0)                */
#define MDR_ADC_ADC1_STATUS_Overwrite_Msk (0x1UL)                   /*!< MDR_ADC ADC1_STATUS: Overwrite (Bitfield-Mask: 0x01)  */
#define MDR_ADC_ADC1_STATUS_AWOIFEN_Pos   (1UL)                     /*!< MDR_ADC ADC1_STATUS: AWOIFEN (Bit 1)                  */
#define MDR_ADC_ADC1_STATUS_AWOIFEN_Msk   (0x2UL)                   /*!< MDR_ADC ADC1_STATUS: AWOIFEN (Bitfield-Mask: 0x01)    */
#define MDR_ADC_ADC1_STATUS_EOCIF_Pos     (2UL)                     /*!< MDR_ADC ADC1_STATUS: EOCIF (Bit 2)                    */
#define MDR_ADC_ADC1_STATUS_EOCIF_Msk     (0x4UL)                   /*!< MDR_ADC ADC1_STATUS: EOCIF (Bitfield-Mask: 0x01)      */
#define MDR_ADC_ADC1_STATUS_AWOIF_IE_Pos  (3UL)                     /*!< MDR_ADC ADC1_STATUS: AWOIF_IE (Bit 3)                 */
#define MDR_ADC_ADC1_STATUS_AWOIF_IE_Msk  (0x8UL)                   /*!< MDR_ADC ADC1_STATUS: AWOIF_IE (Bitfield-Mask: 0x01)   */
#define MDR_ADC_ADC1_STATUS_EOCIF_EN_Pos  (4UL)                     /*!< MDR_ADC ADC1_STATUS: EOCIF_EN (Bit 4)                 */
#define MDR_ADC_ADC1_STATUS_EOCIF_EN_Msk  (0x10UL)                  /*!< MDR_ADC ADC1_STATUS: EOCIF_EN (Bitfield-Mask: 0x01)   */
/* ======================================================  ADC2_STATUS  ====================================================== */
#define MDR_ADC_ADC2_STATUS_Overwrite_Pos (0UL)                     /*!< MDR_ADC ADC2_STATUS: Overwrite (Bit 0)                */
#define MDR_ADC_ADC2_STATUS_Overwrite_Msk (0x1UL)                   /*!< MDR_ADC ADC2_STATUS: Overwrite (Bitfield-Mask: 0x01)  */
#define MDR_ADC_ADC2_STATUS_AWOIFEN_Pos   (1UL)                     /*!< MDR_ADC ADC2_STATUS: AWOIFEN (Bit 1)                  */
#define MDR_ADC_ADC2_STATUS_AWOIFEN_Msk   (0x2UL)                   /*!< MDR_ADC ADC2_STATUS: AWOIFEN (Bitfield-Mask: 0x01)    */
#define MDR_ADC_ADC2_STATUS_EOCIF_Pos     (2UL)                     /*!< MDR_ADC ADC2_STATUS: EOCIF (Bit 2)                    */
#define MDR_ADC_ADC2_STATUS_EOCIF_Msk     (0x4UL)                   /*!< MDR_ADC ADC2_STATUS: EOCIF (Bitfield-Mask: 0x01)      */
#define MDR_ADC_ADC2_STATUS_AWOIF_IE_Pos  (3UL)                     /*!< MDR_ADC ADC2_STATUS: AWOIF_IE (Bit 3)                 */
#define MDR_ADC_ADC2_STATUS_AWOIF_IE_Msk  (0x8UL)                   /*!< MDR_ADC ADC2_STATUS: AWOIF_IE (Bitfield-Mask: 0x01)   */
#define MDR_ADC_ADC2_STATUS_EOCIF_EN_Pos  (4UL)                     /*!< MDR_ADC ADC2_STATUS: EOCIF_EN (Bit 4)                 */
#define MDR_ADC_ADC2_STATUS_EOCIF_EN_Msk  (0x10UL)                  /*!< MDR_ADC ADC2_STATUS: EOCIF_EN (Bitfield-Mask: 0x01)   */
/* ======================================================  ADC1_CHSEL  ======================================================= */
#define MDR_ADC_ADC1_CHSEL_Channel_0_Pos  (0UL)                     /*!< MDR_ADC ADC1_CHSEL: Channel_0 (Bit 0)                 */
#define MDR_ADC_ADC1_CHSEL_Channel_0_Msk  (0x1UL)                   /*!< MDR_ADC ADC1_CHSEL: Channel_0 (Bitfield-Mask: 0x01)   */
#define MDR_ADC_ADC1_CHSEL_Channel_1_Pos  (1UL)                     /*!< MDR_ADC ADC1_CHSEL: Channel_1 (Bit 1)                 */
#define MDR_ADC_ADC1_CHSEL_Channel_1_Msk  (0x2UL)                   /*!< MDR_ADC ADC1_CHSEL: Channel_1 (Bitfield-Mask: 0x01)   */
#define MDR_ADC_ADC1_CHSEL_Channel_2_Pos  (2UL)                     /*!< MDR_ADC ADC1_CHSEL: Channel_2 (Bit 2)                 */
#define MDR_ADC_ADC1_CHSEL_Channel_2_Msk  (0x4UL)                   /*!< MDR_ADC ADC1_CHSEL: Channel_2 (Bitfield-Mask: 0x01)   */
#define MDR_ADC_ADC1_CHSEL_Channel_3_Pos  (3UL)                     /*!< MDR_ADC ADC1_CHSEL: Channel_3 (Bit 3)                 */
#define MDR_ADC_ADC1_CHSEL_Channel_3_Msk  (0x8UL)                   /*!< MDR_ADC ADC1_CHSEL: Channel_3 (Bitfield-Mask: 0x01)   */
#define MDR_ADC_ADC1_CHSEL_Channel_4_Pos  (4UL)                     /*!< MDR_ADC ADC1_CHSEL: Channel_4 (Bit 4)                 */
#define MDR_ADC_ADC1_CHSEL_Channel_4_Msk  (0x10UL)                  /*!< MDR_ADC ADC1_CHSEL: Channel_4 (Bitfield-Mask: 0x01)   */
#define MDR_ADC_ADC1_CHSEL_Channel_5_Pos  (5UL)                     /*!< MDR_ADC ADC1_CHSEL: Channel_5 (Bit 5)                 */
#define MDR_ADC_ADC1_CHSEL_Channel_5_Msk  (0x20UL)                  /*!< MDR_ADC ADC1_CHSEL: Channel_5 (Bitfield-Mask: 0x01)   */
#define MDR_ADC_ADC1_CHSEL_Channel_6_Pos  (6UL)                     /*!< MDR_ADC ADC1_CHSEL: Channel_6 (Bit 6)                 */
#define MDR_ADC_ADC1_CHSEL_Channel_6_Msk  (0x40UL)                  /*!< MDR_ADC ADC1_CHSEL: Channel_6 (Bitfield-Mask: 0x01)   */
#define MDR_ADC_ADC1_CHSEL_Channel_7_Pos  (7UL)                     /*!< MDR_ADC ADC1_CHSEL: Channel_7 (Bit 7)                 */
#define MDR_ADC_ADC1_CHSEL_Channel_7_Msk  (0x80UL)                  /*!< MDR_ADC ADC1_CHSEL: Channel_7 (Bitfield-Mask: 0x01)   */
#define MDR_ADC_ADC1_CHSEL_Channel_8_Pos  (8UL)                     /*!< MDR_ADC ADC1_CHSEL: Channel_8 (Bit 8)                 */
#define MDR_ADC_ADC1_CHSEL_Channel_8_Msk  (0x100UL)                 /*!< MDR_ADC ADC1_CHSEL: Channel_8 (Bitfield-Mask: 0x01)   */
#define MDR_ADC_ADC1_CHSEL_Channel_9_Pos  (9UL)                     /*!< MDR_ADC ADC1_CHSEL: Channel_9 (Bit 9)                 */
#define MDR_ADC_ADC1_CHSEL_Channel_9_Msk  (0x200UL)                 /*!< MDR_ADC ADC1_CHSEL: Channel_9 (Bitfield-Mask: 0x01)   */
#define MDR_ADC_ADC1_CHSEL_Channel_10_Pos (10UL)                    /*!< MDR_ADC ADC1_CHSEL: Channel_10 (Bit 10)               */
#define MDR_ADC_ADC1_CHSEL_Channel_10_Msk (0x400UL)                 /*!< MDR_ADC ADC1_CHSEL: Channel_10 (Bitfield-Mask: 0x01)  */
#define MDR_ADC_ADC1_CHSEL_Channel_11_Pos (11UL)                    /*!< MDR_ADC ADC1_CHSEL: Channel_11 (Bit 11)               */
#define MDR_ADC_ADC1_CHSEL_Channel_11_Msk (0x800UL)                 /*!< MDR_ADC ADC1_CHSEL: Channel_11 (Bitfield-Mask: 0x01)  */
#define MDR_ADC_ADC1_CHSEL_Channel_12_Pos (12UL)                    /*!< MDR_ADC ADC1_CHSEL: Channel_12 (Bit 12)               */
#define MDR_ADC_ADC1_CHSEL_Channel_12_Msk (0x1000UL)                /*!< MDR_ADC ADC1_CHSEL: Channel_12 (Bitfield-Mask: 0x01)  */
#define MDR_ADC_ADC1_CHSEL_Channel_13_Pos (13UL)                    /*!< MDR_ADC ADC1_CHSEL: Channel_13 (Bit 13)               */
#define MDR_ADC_ADC1_CHSEL_Channel_13_Msk (0x2000UL)                /*!< MDR_ADC ADC1_CHSEL: Channel_13 (Bitfield-Mask: 0x01)  */
#define MDR_ADC_ADC1_CHSEL_Channel_14_Pos (14UL)                    /*!< MDR_ADC ADC1_CHSEL: Channel_14 (Bit 14)               */
#define MDR_ADC_ADC1_CHSEL_Channel_14_Msk (0x4000UL)                /*!< MDR_ADC ADC1_CHSEL: Channel_14 (Bitfield-Mask: 0x01)  */
#define MDR_ADC_ADC1_CHSEL_Channel_15_Pos (15UL)                    /*!< MDR_ADC ADC1_CHSEL: Channel_15 (Bit 15)               */
#define MDR_ADC_ADC1_CHSEL_Channel_15_Msk (0x8000UL)                /*!< MDR_ADC ADC1_CHSEL: Channel_15 (Bitfield-Mask: 0x01)  */
#define MDR_ADC_ADC1_CHSEL_Channel_30_Pos (30UL)                    /*!< MDR_ADC ADC1_CHSEL: Channel_30 (Bit 30)               */
#define MDR_ADC_ADC1_CHSEL_Channel_30_Msk (0x40000000UL)            /*!< MDR_ADC ADC1_CHSEL: Channel_30 (Bitfield-Mask: 0x01)  */
#define MDR_ADC_ADC1_CHSEL_Channel_31_Pos (31UL)                    /*!< MDR_ADC ADC1_CHSEL: Channel_31 (Bit 31)               */
#define MDR_ADC_ADC1_CHSEL_Channel_31_Msk (0x80000000UL)            /*!< MDR_ADC ADC1_CHSEL: Channel_31 (Bitfield-Mask: 0x01)  */
/* ======================================================  ADC2_CHSEL  ======================================================= */
#define MDR_ADC_ADC2_CHSEL_Channel_0_Pos  (0UL)                     /*!< MDR_ADC ADC2_CHSEL: Channel_0 (Bit 0)                 */
#define MDR_ADC_ADC2_CHSEL_Channel_0_Msk  (0x1UL)                   /*!< MDR_ADC ADC2_CHSEL: Channel_0 (Bitfield-Mask: 0x01)   */
#define MDR_ADC_ADC2_CHSEL_Channel_1_Pos  (1UL)                     /*!< MDR_ADC ADC2_CHSEL: Channel_1 (Bit 1)                 */
#define MDR_ADC_ADC2_CHSEL_Channel_1_Msk  (0x2UL)                   /*!< MDR_ADC ADC2_CHSEL: Channel_1 (Bitfield-Mask: 0x01)   */
#define MDR_ADC_ADC2_CHSEL_Channel_2_Pos  (2UL)                     /*!< MDR_ADC ADC2_CHSEL: Channel_2 (Bit 2)                 */
#define MDR_ADC_ADC2_CHSEL_Channel_2_Msk  (0x4UL)                   /*!< MDR_ADC ADC2_CHSEL: Channel_2 (Bitfield-Mask: 0x01)   */
#define MDR_ADC_ADC2_CHSEL_Channel_3_Pos  (3UL)                     /*!< MDR_ADC ADC2_CHSEL: Channel_3 (Bit 3)                 */
#define MDR_ADC_ADC2_CHSEL_Channel_3_Msk  (0x8UL)                   /*!< MDR_ADC ADC2_CHSEL: Channel_3 (Bitfield-Mask: 0x01)   */
#define MDR_ADC_ADC2_CHSEL_Channel_4_Pos  (4UL)                     /*!< MDR_ADC ADC2_CHSEL: Channel_4 (Bit 4)                 */
#define MDR_ADC_ADC2_CHSEL_Channel_4_Msk  (0x10UL)                  /*!< MDR_ADC ADC2_CHSEL: Channel_4 (Bitfield-Mask: 0x01)   */
#define MDR_ADC_ADC2_CHSEL_Channel_5_Pos  (5UL)                     /*!< MDR_ADC ADC2_CHSEL: Channel_5 (Bit 5)                 */
#define MDR_ADC_ADC2_CHSEL_Channel_5_Msk  (0x20UL)                  /*!< MDR_ADC ADC2_CHSEL: Channel_5 (Bitfield-Mask: 0x01)   */
#define MDR_ADC_ADC2_CHSEL_Channel_6_Pos  (6UL)                     /*!< MDR_ADC ADC2_CHSEL: Channel_6 (Bit 6)                 */
#define MDR_ADC_ADC2_CHSEL_Channel_6_Msk  (0x40UL)                  /*!< MDR_ADC ADC2_CHSEL: Channel_6 (Bitfield-Mask: 0x01)   */
#define MDR_ADC_ADC2_CHSEL_Channel_7_Pos  (7UL)                     /*!< MDR_ADC ADC2_CHSEL: Channel_7 (Bit 7)                 */
#define MDR_ADC_ADC2_CHSEL_Channel_7_Msk  (0x80UL)                  /*!< MDR_ADC ADC2_CHSEL: Channel_7 (Bitfield-Mask: 0x01)   */
#define MDR_ADC_ADC2_CHSEL_Channel_8_Pos  (8UL)                     /*!< MDR_ADC ADC2_CHSEL: Channel_8 (Bit 8)                 */
#define MDR_ADC_ADC2_CHSEL_Channel_8_Msk  (0x100UL)                 /*!< MDR_ADC ADC2_CHSEL: Channel_8 (Bitfield-Mask: 0x01)   */
#define MDR_ADC_ADC2_CHSEL_Channel_9_Pos  (9UL)                     /*!< MDR_ADC ADC2_CHSEL: Channel_9 (Bit 9)                 */
#define MDR_ADC_ADC2_CHSEL_Channel_9_Msk  (0x200UL)                 /*!< MDR_ADC ADC2_CHSEL: Channel_9 (Bitfield-Mask: 0x01)   */
#define MDR_ADC_ADC2_CHSEL_Channel_10_Pos (10UL)                    /*!< MDR_ADC ADC2_CHSEL: Channel_10 (Bit 10)               */
#define MDR_ADC_ADC2_CHSEL_Channel_10_Msk (0x400UL)                 /*!< MDR_ADC ADC2_CHSEL: Channel_10 (Bitfield-Mask: 0x01)  */
