StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE9x.h
#define MDR_TIMER1_CH1_DTG_DTG_Msk        (0xfUL)                   /*!< MDR_TIMER1 CH1_DTG: DTG (Bitfield-Mask: 0x0f)         */
#define MDR_TIMER1_CH1_DTG_EDTS_Pos       (4UL)                     /*!< MDR_TIMER1 CH1_DTG: EDTS (Bit 4)                      */
#define MDR_TIMER1_CH1_DTG_EDTS_Msk       (0x10UL)                  /*!< MDR_TIMER1 CH1_DTG: EDTS (Bitfield-Mask: 0x01)        */
#define MDR_TIMER1_CH1_DTG_DTGx_Pos       (8UL)                     /*!< MDR_TIMER1 CH1_DTG: DTGx (Bit 8)                      */
#define MDR_TIMER1_CH1_DTG_DTGx_Msk       (0xff00UL)                /*!< MDR_TIMER1 CH1_DTG: DTGx (Bitfield-Mask: 0xff)        */
/* ========================================================  CH2_DTG  ======================================================== */
#define MDR_TIMER1_CH2_DTG_DTG_Pos        (0UL)                     /*!< MDR_TIMER1 CH2_DTG: DTG (Bit 0)                       */
#define MDR_TIMER1_CH2_DTG_DTG_Msk        (0xfUL)                   /*!< MDR_TIMER1 CH2_DTG: DTG (Bitfield-Mask: 0x0f)         */
#define MDR_TIMER1_CH2_DTG_EDTS_Pos       (4UL)                     /*!< MDR_TIMER1 CH2_DTG: EDTS (Bit 4)                      */
#define MDR_TIMER1_CH2_DTG_EDTS_Msk       (0x10UL)                  /*!< MDR_TIMER1 CH2_DTG: EDTS (Bitfield-Mask: 0x01)        */
#define MDR_TIMER1_CH2_DTG_DTGx_Pos       (8UL)                     /*!< MDR_TIMER1 CH2_DTG: DTGx (Bit 8)                      */
#define MDR_TIMER1_CH2_DTG_DTGx_Msk       (0xff00UL)                /*!< MDR_TIMER1 CH2_DTG: DTGx (Bitfield-Mask: 0xff)        */
/* ========================================================  CH3_DTG  ======================================================== */
#define MDR_TIMER1_CH3_DTG_DTG_Pos        (0UL)                     /*!< MDR_TIMER1 CH3_DTG: DTG (Bit 0)                       */
#define MDR_TIMER1_CH3_DTG_DTG_Msk        (0xfUL)                   /*!< MDR_TIMER1 CH3_DTG: DTG (Bitfield-Mask: 0x0f)         */
#define MDR_TIMER1_CH3_DTG_EDTS_Pos       (4UL)                     /*!< MDR_TIMER1 CH3_DTG: EDTS (Bit 4)                      */
#define MDR_TIMER1_CH3_DTG_EDTS_Msk       (0x10UL)                  /*!< MDR_TIMER1 CH3_DTG: EDTS (Bitfield-Mask: 0x01)        */
#define MDR_TIMER1_CH3_DTG_DTGx_Pos       (8UL)                     /*!< MDR_TIMER1 CH3_DTG: DTGx (Bit 8)                      */
#define MDR_TIMER1_CH3_DTG_DTGx_Msk       (0xff00UL)                /*!< MDR_TIMER1 CH3_DTG: DTGx (Bitfield-Mask: 0xff)        */
/* ========================================================  CH4_DTG  ======================================================== */
#define MDR_TIMER1_CH4_DTG_DTG_Pos        (0UL)                     /*!< MDR_TIMER1 CH4_DTG: DTG (Bit 0)                       */
#define MDR_TIMER1_CH4_DTG_DTG_Msk        (0xfUL)                   /*!< MDR_TIMER1 CH4_DTG: DTG (Bitfield-Mask: 0x0f)         */
#define MDR_TIMER1_CH4_DTG_EDTS_Pos       (4UL)                     /*!< MDR_TIMER1 CH4_DTG: EDTS (Bit 4)                      */
#define MDR_TIMER1_CH4_DTG_EDTS_Msk       (0x10UL)                  /*!< MDR_TIMER1 CH4_DTG: EDTS (Bitfield-Mask: 0x01)        */
#define MDR_TIMER1_CH4_DTG_DTGx_Pos       (8UL)                     /*!< MDR_TIMER1 CH4_DTG: DTGx (Bit 8)                      */
#define MDR_TIMER1_CH4_DTG_DTGx_Msk       (0xff00UL)                /*!< MDR_TIMER1 CH4_DTG: DTGx (Bitfield-Mask: 0xff)        */
/* =====================================================  BRKETR_CNTRL  ====================================================== */
#define MDR_TIMER1_BRKETR_CNTRL_BRK_INV_Pos (0UL)                   /*!< MDR_TIMER1 BRKETR_CNTRL: BRK_INV (Bit 0)              */
#define MDR_TIMER1_BRKETR_CNTRL_BRK_INV_Msk (0x1UL)                 /*!< MDR_TIMER1 BRKETR_CNTRL: BRK_INV (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_BRKETR_CNTRL_ETR_INV_Pos (1UL)                   /*!< MDR_TIMER1 BRKETR_CNTRL: ETR_INV (Bit 1)              */
#define MDR_TIMER1_BRKETR_CNTRL_ETR_INV_Msk (0x2UL)                 /*!< MDR_TIMER1 BRKETR_CNTRL: ETR_INV (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_BRKETR_CNTRL_ETR_PSC_Pos (2UL)                   /*!< MDR_TIMER1 BRKETR_CNTRL: ETR_PSC (Bit 2)              */
#define MDR_TIMER1_BRKETR_CNTRL_ETR_PSC_Msk (0xcUL)                 /*!< MDR_TIMER1 BRKETR_CNTRL: ETR_PSC (Bitfield-Mask: 0x03) */
#define MDR_TIMER1_BRKETR_CNTRL_ETR_Filter_Pos (4UL)                /*!< MDR_TIMER1 BRKETR_CNTRL: ETR_Filter (Bit 4)           */
#define MDR_TIMER1_BRKETR_CNTRL_ETR_Filter_Msk (0xf0UL)             /*!< MDR_TIMER1 BRKETR_CNTRL: ETR_Filter (Bitfield-Mask: 0x0f) */
/* ========================================================  STATUS  ========================================================= */
#define MDR_TIMER1_STATUS_CNT_ZERO_Pos    (0UL)                     /*!< MDR_TIMER1 STATUS: CNT_ZERO (Bit 0)                   */
#define MDR_TIMER1_STATUS_CNT_ZERO_Msk    (0x1UL)                   /*!< MDR_TIMER1 STATUS: CNT_ZERO (Bitfield-Mask: 0x01)     */
#define MDR_TIMER1_STATUS_CNT_ARR_Pos     (1UL)                     /*!< MDR_TIMER1 STATUS: CNT_ARR (Bit 1)                    */
#define MDR_TIMER1_STATUS_CNT_ARR_Msk     (0x2UL)                   /*!< MDR_TIMER1 STATUS: CNT_ARR (Bitfield-Mask: 0x01)      */
#define MDR_TIMER1_STATUS_ETR_RE_Pos      (2UL)                     /*!< MDR_TIMER1 STATUS: ETR_RE (Bit 2)                     */
#define MDR_TIMER1_STATUS_ETR_RE_Msk      (0x4UL)                   /*!< MDR_TIMER1 STATUS: ETR_RE (Bitfield-Mask: 0x01)       */
#define MDR_TIMER1_STATUS_ETR_FE_Pos      (3UL)                     /*!< MDR_TIMER1 STATUS: ETR_FE (Bit 3)                     */
#define MDR_TIMER1_STATUS_ETR_FE_Msk      (0x8UL)                   /*!< MDR_TIMER1 STATUS: ETR_FE (Bitfield-Mask: 0x01)       */
#define MDR_TIMER1_STATUS_BRK_Pos         (4UL)                     /*!< MDR_TIMER1 STATUS: BRK (Bit 4)                        */
#define MDR_TIMER1_STATUS_BRK_Msk         (0x10UL)                  /*!< MDR_TIMER1 STATUS: BRK (Bitfield-Mask: 0x01)          */
#define MDR_TIMER1_STATUS_CCR_CAP_CH1_Pos (5UL)                     /*!< MDR_TIMER1 STATUS: CCR_CAP_CH1 (Bit 5)                */
#define MDR_TIMER1_STATUS_CCR_CAP_CH1_Msk (0x20UL)                  /*!< MDR_TIMER1 STATUS: CCR_CAP_CH1 (Bitfield-Mask: 0x01)  */
#define MDR_TIMER1_STATUS_CCR_CAP_CH2_Pos (6UL)                     /*!< MDR_TIMER1 STATUS: CCR_CAP_CH2 (Bit 6)                */
#define MDR_TIMER1_STATUS_CCR_CAP_CH2_Msk (0x40UL)                  /*!< MDR_TIMER1 STATUS: CCR_CAP_CH2 (Bitfield-Mask: 0x01)  */
#define MDR_TIMER1_STATUS_CCR_CAP_CH3_Pos (7UL)                     /*!< MDR_TIMER1 STATUS: CCR_CAP_CH3 (Bit 7)                */
#define MDR_TIMER1_STATUS_CCR_CAP_CH3_Msk (0x80UL)                  /*!< MDR_TIMER1 STATUS: CCR_CAP_CH3 (Bitfield-Mask: 0x01)  */
#define MDR_TIMER1_STATUS_CCR_CAP_CH4_Pos (8UL)                     /*!< MDR_TIMER1 STATUS: CCR_CAP_CH4 (Bit 8)                */
#define MDR_TIMER1_STATUS_CCR_CAP_CH4_Msk (0x100UL)                 /*!< MDR_TIMER1 STATUS: CCR_CAP_CH4 (Bitfield-Mask: 0x01)  */
#define MDR_TIMER1_STATUS_CCR_REF_CH1_Pos (9UL)                     /*!< MDR_TIMER1 STATUS: CCR_REF_CH1 (Bit 9)                */
#define MDR_TIMER1_STATUS_CCR_REF_CH1_Msk (0x200UL)                 /*!< MDR_TIMER1 STATUS: CCR_REF_CH1 (Bitfield-Mask: 0x01)  */
#define MDR_TIMER1_STATUS_CCR_REF_CH2_Pos (10UL)                    /*!< MDR_TIMER1 STATUS: CCR_REF_CH2 (Bit 10)               */
#define MDR_TIMER1_STATUS_CCR_REF_CH2_Msk (0x400UL)                 /*!< MDR_TIMER1 STATUS: CCR_REF_CH2 (Bitfield-Mask: 0x01)  */
#define MDR_TIMER1_STATUS_CCR_REF_CH3_Pos (11UL)                    /*!< MDR_TIMER1 STATUS: CCR_REF_CH3 (Bit 11)               */
#define MDR_TIMER1_STATUS_CCR_REF_CH3_Msk (0x800UL)                 /*!< MDR_TIMER1 STATUS: CCR_REF_CH3 (Bitfield-Mask: 0x01)  */
#define MDR_TIMER1_STATUS_CCR_REF_CH4_Pos (12UL)                    /*!< MDR_TIMER1 STATUS: CCR_REF_CH4 (Bit 12)               */
#define MDR_TIMER1_STATUS_CCR_REF_CH4_Msk (0x1000UL)                /*!< MDR_TIMER1 STATUS: CCR_REF_CH4 (Bitfield-Mask: 0x01)  */
#define MDR_TIMER1_STATUS_CCR1_CAP_CH1_Pos (13UL)                   /*!< MDR_TIMER1 STATUS: CCR1_CAP_CH1 (Bit 13)              */
#define MDR_TIMER1_STATUS_CCR1_CAP_CH1_Msk (0x2000UL)               /*!< MDR_TIMER1 STATUS: CCR1_CAP_CH1 (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_STATUS_CCR1_CAP_CH2_Pos (14UL)                   /*!< MDR_TIMER1 STATUS: CCR1_CAP_CH2 (Bit 14)              */
#define MDR_TIMER1_STATUS_CCR1_CAP_CH2_Msk (0x4000UL)               /*!< MDR_TIMER1 STATUS: CCR1_CAP_CH2 (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_STATUS_CCR1_CAP_CH3_Pos (15UL)                   /*!< MDR_TIMER1 STATUS: CCR1_CAP_CH3 (Bit 15)              */
#define MDR_TIMER1_STATUS_CCR1_CAP_CH3_Msk (0x8000UL)               /*!< MDR_TIMER1 STATUS: CCR1_CAP_CH3 (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_STATUS_CCR1_CAP_CH4_Pos (16UL)                   /*!< MDR_TIMER1 STATUS: CCR1_CAP_CH4 (Bit 16)              */
#define MDR_TIMER1_STATUS_CCR1_CAP_CH4_Msk (0x10000UL)              /*!< MDR_TIMER1 STATUS: CCR1_CAP_CH4 (Bitfield-Mask: 0x01) */
/* ==========================================================  IE  =========================================================== */
#define MDR_TIMER1_IE_CNT_ZERO_IE_Pos     (0UL)                     /*!< MDR_TIMER1 IE: CNT_ZERO_IE (Bit 0)                    */
#define MDR_TIMER1_IE_CNT_ZERO_IE_Msk     (0x1UL)                   /*!< MDR_TIMER1 IE: CNT_ZERO_IE (Bitfield-Mask: 0x01)      */
#define MDR_TIMER1_IE_CNT_ARR_IE_Pos      (1UL)                     /*!< MDR_TIMER1 IE: CNT_ARR_IE (Bit 1)                     */
#define MDR_TIMER1_IE_CNT_ARR_IE_Msk      (0x2UL)                   /*!< MDR_TIMER1 IE: CNT_ARR_IE (Bitfield-Mask: 0x01)       */
#define MDR_TIMER1_IE_ETR_RE_IE_Pos       (2UL)                     /*!< MDR_TIMER1 IE: ETR_RE_IE (Bit 2)                      */
#define MDR_TIMER1_IE_ETR_RE_IE_Msk       (0x4UL)                   /*!< MDR_TIMER1 IE: ETR_RE_IE (Bitfield-Mask: 0x01)        */
#define MDR_TIMER1_IE_ETR_FE_IE_Pos       (3UL)                     /*!< MDR_TIMER1 IE: ETR_FE_IE (Bit 3)                      */
#define MDR_TIMER1_IE_ETR_FE_IE_Msk       (0x8UL)                   /*!< MDR_TIMER1 IE: ETR_FE_IE (Bitfield-Mask: 0x01)        */
#define MDR_TIMER1_IE_BRK_IE_Pos          (4UL)                     /*!< MDR_TIMER1 IE: BRK_IE (Bit 4)                         */
#define MDR_TIMER1_IE_BRK_IE_Msk          (0x10UL)                  /*!< MDR_TIMER1 IE: BRK_IE (Bitfield-Mask: 0x01)           */
#define MDR_TIMER1_IE_CCR_CAP_CH1_IE_Pos  (5UL)                     /*!< MDR_TIMER1 IE: CCR_CAP_CH1_IE (Bit 5)                 */
#define MDR_TIMER1_IE_CCR_CAP_CH1_IE_Msk  (0x20UL)                  /*!< MDR_TIMER1 IE: CCR_CAP_CH1_IE (Bitfield-Mask: 0x01)   */
#define MDR_TIMER1_IE_CCR_CAP_CH2_IE_Pos  (6UL)                     /*!< MDR_TIMER1 IE: CCR_CAP_CH2_IE (Bit 6)                 */
#define MDR_TIMER1_IE_CCR_CAP_CH2_IE_Msk  (0x40UL)                  /*!< MDR_TIMER1 IE: CCR_CAP_CH2_IE (Bitfield-Mask: 0x01)   */
#define MDR_TIMER1_IE_CCR_CAP_CH3_IE_Pos  (7UL)                     /*!< MDR_TIMER1 IE: CCR_CAP_CH3_IE (Bit 7)                 */
#define MDR_TIMER1_IE_CCR_CAP_CH3_IE_Msk  (0x80UL)                  /*!< MDR_TIMER1 IE: CCR_CAP_CH3_IE (Bitfield-Mask: 0x01)   */
#define MDR_TIMER1_IE_CCR_CAP_CH4_IE_Pos  (8UL)                     /*!< MDR_TIMER1 IE: CCR_CAP_CH4_IE (Bit 8)                 */
#define MDR_TIMER1_IE_CCR_CAP_CH4_IE_Msk  (0x100UL)                 /*!< MDR_TIMER1 IE: CCR_CAP_CH4_IE (Bitfield-Mask: 0x01)   */
#define MDR_TIMER1_IE_CCR_REF_CH1_IE_Pos  (9UL)                     /*!< MDR_TIMER1 IE: CCR_REF_CH1_IE (Bit 9)                 */
#define MDR_TIMER1_IE_CCR_REF_CH1_IE_Msk  (0x200UL)                 /*!< MDR_TIMER1 IE: CCR_REF_CH1_IE (Bitfield-Mask: 0x01)   */
#define MDR_TIMER1_IE_CCR_REF_CH2_IE_Pos  (10UL)                    /*!< MDR_TIMER1 IE: CCR_REF_CH2_IE (Bit 10)                */
#define MDR_TIMER1_IE_CCR_REF_CH2_IE_Msk  (0x400UL)                 /*!< MDR_TIMER1 IE: CCR_REF_CH2_IE (Bitfield-Mask: 0x01)   */
#define MDR_TIMER1_IE_CCR_REF_CH3_IE_Pos  (11UL)                    /*!< MDR_TIMER1 IE: CCR_REF_CH3_IE (Bit 11)                */
#define MDR_TIMER1_IE_CCR_REF_CH3_IE_Msk  (0x800UL)                 /*!< MDR_TIMER1 IE: CCR_REF_CH3_IE (Bitfield-Mask: 0x01)   */
#define MDR_TIMER1_IE_CCR_REF_CH4_IE_Pos  (12UL)                    /*!< MDR_TIMER1 IE: CCR_REF_CH4_IE (Bit 12)                */
#define MDR_TIMER1_IE_CCR_REF_CH4_IE_Msk  (0x1000UL)                /*!< MDR_TIMER1 IE: CCR_REF_CH4_IE (Bitfield-Mask: 0x01)   */
#define MDR_TIMER1_IE_CCR1_CAP_CH1_IE_Pos (13UL)                    /*!< MDR_TIMER1 IE: CCR1_CAP_CH1_IE (Bit 13)               */
#define MDR_TIMER1_IE_CCR1_CAP_CH1_IE_Msk (0x2000UL)                /*!< MDR_TIMER1 IE: CCR1_CAP_CH1_IE (Bitfield-Mask: 0x01)  */
#define MDR_TIMER1_IE_CCR1_CAP_CH2_IE_Pos (14UL)                    /*!< MDR_TIMER1 IE: CCR1_CAP_CH2_IE (Bit 14)               */
#define MDR_TIMER1_IE_CCR1_CAP_CH2_IE_Msk (0x4000UL)                /*!< MDR_TIMER1 IE: CCR1_CAP_CH2_IE (Bitfield-Mask: 0x01)  */
#define MDR_TIMER1_IE_CCR1_CAP_CH3_IE_Pos (15UL)                    /*!< MDR_TIMER1 IE: CCR1_CAP_CH3_IE (Bit 15)               */
#define MDR_TIMER1_IE_CCR1_CAP_CH3_IE_Msk (0x8000UL)                /*!< MDR_TIMER1 IE: CCR1_CAP_CH3_IE (Bitfield-Mask: 0x01)  */
#define MDR_TIMER1_IE_CCR1_CAP_CH4_IE_Pos (16UL)                    /*!< MDR_TIMER1 IE: CCR1_CAP_CH4_IE (Bit 16)               */
#define MDR_TIMER1_IE_CCR1_CAP_CH4_IE_Msk (0x10000UL)               /*!< MDR_TIMER1 IE: CCR1_CAP_CH4_IE (Bitfield-Mask: 0x01)  */
/* ========================================================  DMA_RE  ========================================================= */
#define MDR_TIMER1_DMA_RE_CNT_ZERO_DMAE_Pos (0UL)                   /*!< MDR_TIMER1 DMA_RE: CNT_ZERO_DMAE (Bit 0)              */
#define MDR_TIMER1_DMA_RE_CNT_ZERO_DMAE_Msk (0x1UL)                 /*!< MDR_TIMER1 DMA_RE: CNT_ZERO_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE_CNT_ARR_DMAE_Pos (1UL)                    /*!< MDR_TIMER1 DMA_RE: CNT_ARR_DMAE (Bit 1)               */
#define MDR_TIMER1_DMA_RE_CNT_ARR_DMAE_Msk (0x2UL)                  /*!< MDR_TIMER1 DMA_RE: CNT_ARR_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE_ETR_RE_DMAE_Pos (2UL)                     /*!< MDR_TIMER1 DMA_RE: ETR_RE_DMAE (Bit 2)                */
#define MDR_TIMER1_DMA_RE_ETR_RE_DMAE_Msk (0x4UL)                   /*!< MDR_TIMER1 DMA_RE: ETR_RE_DMAE (Bitfield-Mask: 0x01)  */
#define MDR_TIMER1_DMA_RE_ETR_FE_DMAE_Pos (3UL)                     /*!< MDR_TIMER1 DMA_RE: ETR_FE_DMAE (Bit 3)                */
#define MDR_TIMER1_DMA_RE_ETR_FE_DMAE_Msk (0x8UL)                   /*!< MDR_TIMER1 DMA_RE: ETR_FE_DMAE (Bitfield-Mask: 0x01)  */
#define MDR_TIMER1_DMA_RE_BRK_DMAE_Pos    (4UL)                     /*!< MDR_TIMER1 DMA_RE: BRK_DMAE (Bit 4)                   */
#define MDR_TIMER1_DMA_RE_BRK_DMAE_Msk    (0x10UL)                  /*!< MDR_TIMER1 DMA_RE: BRK_DMAE (Bitfield-Mask: 0x01)     */
#define MDR_TIMER1_DMA_RE_CCR_CAP_CH1_DMAE_Pos (5UL)                /*!< MDR_TIMER1 DMA_RE: CCR_CAP_CH1_DMAE (Bit 5)           */
#define MDR_TIMER1_DMA_RE_CCR_CAP_CH1_DMAE_Msk (0x20UL)             /*!< MDR_TIMER1 DMA_RE: CCR_CAP_CH1_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE_CCR_CAP_CH2_DMAE_Pos (6UL)                /*!< MDR_TIMER1 DMA_RE: CCR_CAP_CH2_DMAE (Bit 6)           */
#define MDR_TIMER1_DMA_RE_CCR_CAP_CH2_DMAE_Msk (0x40UL)             /*!< MDR_TIMER1 DMA_RE: CCR_CAP_CH2_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE_CCR_CAP_CH3_DMAE_Pos (7UL)                /*!< MDR_TIMER1 DMA_RE: CCR_CAP_CH3_DMAE (Bit 7)           */
#define MDR_TIMER1_DMA_RE_CCR_CAP_CH3_DMAE_Msk (0x80UL)             /*!< MDR_TIMER1 DMA_RE: CCR_CAP_CH3_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE_CCR_CAP_CH4_DMAE_Pos (8UL)                /*!< MDR_TIMER1 DMA_RE: CCR_CAP_CH4_DMAE (Bit 8)           */
#define MDR_TIMER1_DMA_RE_CCR_CAP_CH4_DMAE_Msk (0x100UL)            /*!< MDR_TIMER1 DMA_RE: CCR_CAP_CH4_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE_CCR_REF_CH1_DMAE_Pos (9UL)                /*!< MDR_TIMER1 DMA_RE: CCR_REF_CH1_DMAE (Bit 9)           */
#define MDR_TIMER1_DMA_RE_CCR_REF_CH1_DMAE_Msk (0x200UL)            /*!< MDR_TIMER1 DMA_RE: CCR_REF_CH1_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE_CCR_REF_CH2_DMAE_Pos (10UL)               /*!< MDR_TIMER1 DMA_RE: CCR_REF_CH2_DMAE (Bit 10)          */
#define MDR_TIMER1_DMA_RE_CCR_REF_CH2_DMAE_Msk (0x400UL)            /*!< MDR_TIMER1 DMA_RE: CCR_REF_CH2_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE_CCR_REF_CH3_DMAE_Pos (11UL)               /*!< MDR_TIMER1 DMA_RE: CCR_REF_CH3_DMAE (Bit 11)          */
#define MDR_TIMER1_DMA_RE_CCR_REF_CH3_DMAE_Msk (0x800UL)            /*!< MDR_TIMER1 DMA_RE: CCR_REF_CH3_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE_CCR_REF_CH4_DMAE_Pos (12UL)               /*!< MDR_TIMER1 DMA_RE: CCR_REF_CH4_DMAE (Bit 12)          */
#define MDR_TIMER1_DMA_RE_CCR_REF_CH4_DMAE_Msk (0x1000UL)           /*!< MDR_TIMER1 DMA_RE: CCR_REF_CH4_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE_CCR1_CAP_CH1_DMAE_Pos (13UL)              /*!< MDR_TIMER1 DMA_RE: CCR1_CAP_CH1_DMAE (Bit 13)         */
#define MDR_TIMER1_DMA_RE_CCR1_CAP_CH1_DMAE_Msk (0x2000UL)          /*!< MDR_TIMER1 DMA_RE: CCR1_CAP_CH1_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE_CCR1_CAP_CH2_DMAE_Pos (14UL)              /*!< MDR_TIMER1 DMA_RE: CCR1_CAP_CH2_DMAE (Bit 14)         */
#define MDR_TIMER1_DMA_RE_CCR1_CAP_CH2_DMAE_Msk (0x4000UL)          /*!< MDR_TIMER1 DMA_RE: CCR1_CAP_CH2_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE_CCR1_CAP_CH3_DMAE_Pos (15UL)              /*!< MDR_TIMER1 DMA_RE: CCR1_CAP_CH3_DMAE (Bit 15)         */
#define MDR_TIMER1_DMA_RE_CCR1_CAP_CH3_DMAE_Msk (0x8000UL)          /*!< MDR_TIMER1 DMA_RE: CCR1_CAP_CH3_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE_CCR1_CAP_CH4_DMAE_Pos (16UL)              /*!< MDR_TIMER1 DMA_RE: CCR1_CAP_CH4_DMAE (Bit 16)         */
#define MDR_TIMER1_DMA_RE_CCR1_CAP_CH4_DMAE_Msk (0x10000UL)         /*!< MDR_TIMER1 DMA_RE: CCR1_CAP_CH4_DMAE (Bitfield-Mask: 0x01) */
/* ======================================================  CH1_CNTRL2  ======================================================= */
#define MDR_TIMER1_CH1_CNTRL2_CHSel1_Pos  (0UL)                     /*!< MDR_TIMER1 CH1_CNTRL2: CHSel1 (Bit 0)                 */
#define MDR_TIMER1_CH1_CNTRL2_CHSel1_Msk  (0x3UL)                   /*!< MDR_TIMER1 CH1_CNTRL2: CHSel1 (Bitfield-Mask: 0x03)   */
#define MDR_TIMER1_CH1_CNTRL2_CCR1_En_Pos (2UL)                     /*!< MDR_TIMER1 CH1_CNTRL2: CCR1_En (Bit 2)                */
#define MDR_TIMER1_CH1_CNTRL2_CCR1_En_Msk (0x4UL)                   /*!< MDR_TIMER1 CH1_CNTRL2: CCR1_En (Bitfield-Mask: 0x01)  */
#define MDR_TIMER1_CH1_CNTRL2_CCRRLD_Pos  (3UL)                     /*!< MDR_TIMER1 CH1_CNTRL2: CCRRLD (Bit 3)                 */
#define MDR_TIMER1_CH1_CNTRL2_CCRRLD_Msk  (0x8UL)                   /*!< MDR_TIMER1 CH1_CNTRL2: CCRRLD (Bitfield-Mask: 0x01)   */
#define MDR_TIMER1_CH1_CNTRL2_CAP_CCR_Fix_Pos (4UL)                 /*!< MDR_TIMER1 CH1_CNTRL2: CAP_CCR_Fix (Bit 4)            */
#define MDR_TIMER1_CH1_CNTRL2_CAP_CCR_Fix_Msk (0x10UL)              /*!< MDR_TIMER1 CH1_CNTRL2: CAP_CCR_Fix (Bitfield-Mask: 0x01) */
/* ======================================================  CH2_CNTRL2  ======================================================= */
#define MDR_TIMER1_CH2_CNTRL2_CHSel1_Pos  (0UL)                     /*!< MDR_TIMER1 CH2_CNTRL2: CHSel1 (Bit 0)                 */
#define MDR_TIMER1_CH2_CNTRL2_CHSel1_Msk  (0x3UL)                   /*!< MDR_TIMER1 CH2_CNTRL2: CHSel1 (Bitfield-Mask: 0x03)   */
#define MDR_TIMER1_CH2_CNTRL2_CCR1_En_Pos (2UL)                     /*!< MDR_TIMER1 CH2_CNTRL2: CCR1_En (Bit 2)                */
#define MDR_TIMER1_CH2_CNTRL2_CCR1_En_Msk (0x4UL)                   /*!< MDR_TIMER1 CH2_CNTRL2: CCR1_En (Bitfield-Mask: 0x01)  */
#define MDR_TIMER1_CH2_CNTRL2_CCRRLD_Pos  (3UL)                     /*!< MDR_TIMER1 CH2_CNTRL2: CCRRLD (Bit 3)                 */
#define MDR_TIMER1_CH2_CNTRL2_CCRRLD_Msk  (0x8UL)                   /*!< MDR_TIMER1 CH2_CNTRL2: CCRRLD (Bitfield-Mask: 0x01)   */
#define MDR_TIMER1_CH2_CNTRL2_CAP_CCR_Fix_Pos (4UL)                 /*!< MDR_TIMER1 CH2_CNTRL2: CAP_CCR_Fix (Bit 4)            */
#define MDR_TIMER1_CH2_CNTRL2_CAP_CCR_Fix_Msk (0x10UL)              /*!< MDR_TIMER1 CH2_CNTRL2: CAP_CCR_Fix (Bitfield-Mask: 0x01) */
/* ======================================================  CH3_CNTRL2  ======================================================= */
#define MDR_TIMER1_CH3_CNTRL2_CHSel1_Pos  (0UL)                     /*!< MDR_TIMER1 CH3_CNTRL2: CHSel1 (Bit 0)                 */
#define MDR_TIMER1_CH3_CNTRL2_CHSel1_Msk  (0x3UL)                   /*!< MDR_TIMER1 CH3_CNTRL2: CHSel1 (Bitfield-Mask: 0x03)   */
#define MDR_TIMER1_CH3_CNTRL2_CCR1_En_Pos (2UL)                     /*!< MDR_TIMER1 CH3_CNTRL2: CCR1_En (Bit 2)                */
#define MDR_TIMER1_CH3_CNTRL2_CCR1_En_Msk (0x4UL)                   /*!< MDR_TIMER1 CH3_CNTRL2: CCR1_En (Bitfield-Mask: 0x01)  */
#define MDR_TIMER1_CH3_CNTRL2_CCRRLD_Pos  (3UL)                     /*!< MDR_TIMER1 CH3_CNTRL2: CCRRLD (Bit 3)                 */
#define MDR_TIMER1_CH3_CNTRL2_CCRRLD_Msk  (0x8UL)                   /*!< MDR_TIMER1 CH3_CNTRL2: CCRRLD (Bitfield-Mask: 0x01)   */
#define MDR_TIMER1_CH3_CNTRL2_CAP_CCR_Fix_Pos (4UL)                 /*!< MDR_TIMER1 CH3_CNTRL2: CAP_CCR_Fix (Bit 4)            */
#define MDR_TIMER1_CH3_CNTRL2_CAP_CCR_Fix_Msk (0x10UL)              /*!< MDR_TIMER1 CH3_CNTRL2: CAP_CCR_Fix (Bitfield-Mask: 0x01) */
/* ======================================================  CH4_CNTRL2  ======================================================= */
#define MDR_TIMER1_CH4_CNTRL2_CHSel1_Pos  (0UL)                     /*!< MDR_TIMER1 CH4_CNTRL2: CHSel1 (Bit 0)                 */
#define MDR_TIMER1_CH4_CNTRL2_CHSel1_Msk  (0x3UL)                   /*!< MDR_TIMER1 CH4_CNTRL2: CHSel1 (Bitfield-Mask: 0x03)   */
#define MDR_TIMER1_CH4_CNTRL2_CCR1_En_Pos (2UL)                     /*!< MDR_TIMER1 CH4_CNTRL2: CCR1_En (Bit 2)                */
#define MDR_TIMER1_CH4_CNTRL2_CCR1_En_Msk (0x4UL)                   /*!< MDR_TIMER1 CH4_CNTRL2: CCR1_En (Bitfield-Mask: 0x01)  */
#define MDR_TIMER1_CH4_CNTRL2_CCRRLD_Pos  (3UL)                     /*!< MDR_TIMER1 CH4_CNTRL2: CCRRLD (Bit 3)                 */
#define MDR_TIMER1_CH4_CNTRL2_CCRRLD_Msk  (0x8UL)                   /*!< MDR_TIMER1 CH4_CNTRL2: CCRRLD (Bitfield-Mask: 0x01)   */
#define MDR_TIMER1_CH4_CNTRL2_CAP_CCR_Fix_Pos (4UL)                 /*!< MDR_TIMER1 CH4_CNTRL2: CAP_CCR_Fix (Bit 4)            */
#define MDR_TIMER1_CH4_CNTRL2_CAP_CCR_Fix_Msk (0x10UL)              /*!< MDR_TIMER1 CH4_CNTRL2: CAP_CCR_Fix (Bitfield-Mask: 0x01) */
/* =========================================================  CCR11  ========================================================= */
#define MDR_TIMER1_CCR11_Value_Pos        (0UL)                     /*!< MDR_TIMER1 CCR11: Value (Bit 0)                       */
#define MDR_TIMER1_CCR11_Value_Msk        (0xffffUL)                /*!< MDR_TIMER1 CCR11: Value (Bitfield-Mask: 0xffff)       */
/* =========================================================  CCR21  ========================================================= */
#define MDR_TIMER1_CCR21_Value_Pos        (0UL)                     /*!< MDR_TIMER1 CCR21: Value (Bit 0)                       */
#define MDR_TIMER1_CCR21_Value_Msk        (0xffffUL)                /*!< MDR_TIMER1 CCR21: Value (Bitfield-Mask: 0xffff)       */
/* =========================================================  CCR31  ========================================================= */
#define MDR_TIMER1_CCR31_Value_Pos        (0UL)                     /*!< MDR_TIMER1 CCR31: Value (Bit 0)                       */
