StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE9x.h
/* ===============================================  MDR_EEPROM CMD WR [1..1]  ================================================ */
typedef enum {                                  /*!< MDR_EEPROM_CMD_WR                                                         */
  MDR_EEPROM_CMD__WR__Inactive         = 0,     /*!< Inactive : No write operation                                             */
  MDR_EEPROM_CMD__WR__Active           = 1,     /*!< Active : Write operation                                                  */
} MDR_EEPROM_CMD__WR__Enum;

/* ===============================================  MDR_EEPROM CMD RD [2..2]  ================================================ */
typedef enum {                                  /*!< MDR_EEPROM_CMD_RD                                                         */
  MDR_EEPROM_CMD__RD__Inactive         = 0,     /*!< Inactive : No read operation                                              */
  MDR_EEPROM_CMD__RD__Active           = 1,     /*!< Active : Read operation                                                   */
} MDR_EEPROM_CMD__RD__Enum;

/* ==============================================  MDR_EEPROM CMD DELAY [3..5]  ============================================== */
typedef enum {                                  /*!< MDR_EEPROM_CMD_DELAY                                                      */
  MDR_EEPROM_CMD__DELAY__le25MHz       = 0,     /*!< le25MHz : CPU freq is up to 25MHz                                         */
  MDR_EEPROM_CMD__DELAY__le50MHz       = 1,     /*!< le50MHz : CPU freq is up to 50MHz                                         */
  MDR_EEPROM_CMD__DELAY__le75MHz       = 2,     /*!< le75MHz : CPU freq is up to 75MHz                                         */
  MDR_EEPROM_CMD__DELAY__le100MHz      = 3,     /*!< le100MHz : CPU freq is up to 100MHz                                       */
  MDR_EEPROM_CMD__DELAY__le125MHz      = 4,     /*!< le125MHz : CPU freq is up to 125MHz                                       */
  MDR_EEPROM_CMD__DELAY__le150MHz      = 5,     /*!< le150MHz : CPU freq is up to 150MHz                                       */
  MDR_EEPROM_CMD__DELAY__le175MHz      = 6,     /*!< le175MHz : CPU freq is up to 175MHz                                       */
  MDR_EEPROM_CMD__DELAY__le200MHz      = 7,     /*!< le200MHz : CPU freq is up to 200MHz                                       */
} MDR_EEPROM_CMD__DELAY__Enum;

/* ===============================================  MDR_EEPROM CMD XE [6..6]  ================================================ */
typedef enum {                                  /*!< MDR_EEPROM_CMD_XE                                                         */
  MDR_EEPROM_CMD__XE__Off              = 0,     /*!< Off : Disable                                                             */
  MDR_EEPROM_CMD__XE__On               = 1,     /*!< On : Enable                                                               */
} MDR_EEPROM_CMD__XE__Enum;

/* ===============================================  MDR_EEPROM CMD YE [7..7]  ================================================ */
typedef enum {                                  /*!< MDR_EEPROM_CMD_YE                                                         */
  MDR_EEPROM_CMD_YE_Off                = 0,     /*!< Off : Disable                                                             */
  MDR_EEPROM_CMD_YE_On                 = 1,     /*!< On : Enable                                                               */
} MDR_EEPROM_CMD_YE_Enum;

/* ===============================================  MDR_EEPROM CMD SE [8..8]  ================================================ */
typedef enum {                                  /*!< MDR_EEPROM_CMD_SE                                                         */
  MDR_EEPROM_CMD_SE_Off                = 0,     /*!< Off : Disable                                                             */
  MDR_EEPROM_CMD_SE_On                 = 1,     /*!< On : Enable                                                               */
} MDR_EEPROM_CMD_SE_Enum;

/* ==============================================  MDR_EEPROM CMD IFREN [9..9]  ============================================== */
typedef enum {                                  /*!< MDR_EEPROM_CMD_IFREN                                                      */
  MDR_EEPROM_CMD__IFREN__Main          = 0,     /*!< Main : Main memory                                                        */
  MDR_EEPROM_CMD__IFREN__Info          = 1,     /*!< Info : Info memory                                                        */
} MDR_EEPROM_CMD__IFREN__Enum;

/* =============================================  MDR_EEPROM CMD ERASE [10..10]  ============================================= */
typedef enum {                                  /*!< MDR_EEPROM_CMD_ERASE                                                      */
  MDR_EEPROM_CMD__ERASE__Inactive      = 0,     /*!< Inactive : No erase operation                                             */
  MDR_EEPROM_CMD__ERASE__Active        = 1,     /*!< Active : Erase operation                                                  */
} MDR_EEPROM_CMD__ERASE__Enum;

/* =============================================  MDR_EEPROM CMD MAS1 [11..11]  ============================================== */
typedef enum {                                  /*!< MDR_EEPROM_CMD_MAS1                                                       */
  MDR_EEPROM_CMD_MAS1_Off              = 0,     /*!< Off : Disable                                                             */
  MDR_EEPROM_CMD_MAS1_On               = 1,     /*!< On : Enable                                                               */
} MDR_EEPROM_CMD_MAS1_Enum;

/* =============================================  MDR_EEPROM CMD PROG [12..12]  ============================================== */
typedef enum {                                  /*!< MDR_EEPROM_CMD_PROG                                                       */
  MDR_EEPROM_CMD__PROG__Inactive       = 0,     /*!< Inactive : No programm operation                                          */
  MDR_EEPROM_CMD__PROG__Active         = 1,     /*!< Active : Programm operation                                               */
} MDR_EEPROM_CMD__PROG__Enum;

/* =============================================  MDR_EEPROM CMD NVSTR [13..13]  ============================================= */
typedef enum {                                  /*!< MDR_EEPROM_CMD_NVSTR                                                      */
  MDR_EEPROM_CMD__NVSTR__Read          = 0,     /*!< Read : Read mode                                                          */
  MDR_EEPROM_CMD__NVSTR__Write         = 1,     /*!< Write : Programming or erase mode                                         */
} MDR_EEPROM_CMD__NVSTR__Enum;

/* =========================================================  ADDR  ========================================================== */
/* ==========================================================  DI  =========================================================== */
/* ==========================================================  DO  =========================================================== */
/* ==========================================================  KEY  ========================================================== */


/* =========================================================================================================================== */
/* ================                                       MDR_RST_CLOCK                                       ================ */
/* =========================================================================================================================== */

/* =====================================================  CLOCK_STATUS  ====================================================== */
/* =====================================  MDR_RST_CLOCK CLOCK_STATUS PLL_USB_RDY [0..0]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_CLOCK_STATUS_PLL_USB_RDY                                    */
  MDR_RST__STATUS__PLL_USB_RDY__NotReady = 0,   /*!< NotReady : PLL not ready                                                  */
  MDR_RST__STATUS__PLL_USB_RDY__Ready  = 1,     /*!< Ready : PLL ready                                                         */
} MDR_RST__STATUS__PLL_USB_RDY__Enum;

