StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE9x.h
/* =======================================  MDR_RST_CLOCK PER_CLOCK DMA_CLK_EN [5..5]  ======================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_DMA_CLK_EN                                        */
  MDR_RST_CLOCK_PER_CLOCK_DMA_CLK_EN_Off = 0,   /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_DMA_CLK_EN_On = 1,    /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_DMA_CLK_EN_Enum;

/* ======================================  MDR_RST_CLOCK PER_CLOCK UART1_CLK_EN [6..6]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_UART1_CLK_EN                                      */
  MDR_RST_CLOCK_PER_CLOCK_UART1_CLK_EN_Off = 0, /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_UART1_CLK_EN_On = 1,  /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_UART1_CLK_EN_Enum;

/* ======================================  MDR_RST_CLOCK PER_CLOCK UART2_CLK_EN [7..7]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_UART2_CLK_EN                                      */
  MDR_RST_CLOCK_PER_CLOCK_UART2_CLK_EN_Off = 0, /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_UART2_CLK_EN_On = 1,  /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_UART2_CLK_EN_Enum;

/* ======================================  MDR_RST_CLOCK PER_CLOCK SPI1_CLK_EN [8..8]  ======================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_SPI1_CLK_EN                                       */
  MDR_RST_CLOCK_PER_CLOCK_SPI1_CLK_EN_Off = 0,  /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_SPI1_CLK_EN_On = 1,   /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_SPI1_CLK_EN_Enum;

/* ======================================  MDR_RST_CLOCK PER_CLOCK I2C_CLK_EN [10..10]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_I2C_CLK_EN                                        */
  MDR_RST_CLOCK_PER_CLOCK_I2C_CLK_EN_Off = 0,   /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_I2C_CLK_EN_On = 1,    /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_I2C_CLK_EN_Enum;

/* ======================================  MDR_RST_CLOCK PER_CLOCK PWR_CLK_EN [11..11]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_PWR_CLK_EN                                        */
  MDR_RST_CLOCK_PER_CLOCK_PWR_CLK_EN_Off = 0,   /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_PWR_CLK_EN_On = 1,    /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_PWR_CLK_EN_Enum;

/* =====================================  MDR_RST_CLOCK PER_CLOCK WWDT_CLK_EN [12..12]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_WWDT_CLK_EN                                       */
  MDR_RST_CLOCK_PER_CLOCK_WWDT_CLK_EN_Off = 0,  /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_WWDT_CLK_EN_On = 1,   /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_WWDT_CLK_EN_Enum;

/* =====================================  MDR_RST_CLOCK PER_CLOCK IWDT_CLK_EN [13..13]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_IWDT_CLK_EN                                       */
  MDR_RST_CLOCK_PER_CLOCK_IWDT_CLK_EN_Off = 0,  /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_IWDT_CLK_EN_On = 1,   /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_IWDT_CLK_EN_Enum;

/* ====================================  MDR_RST_CLOCK PER_CLOCK TIMER1_CLK_EN [14..14]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_TIMER1_CLK_EN                                     */
  MDR_RST_CLOCK_PER_CLOCK_TIMER1_CLK_EN_Off = 0,/*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_TIMER1_CLK_EN_On = 1, /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_TIMER1_CLK_EN_Enum;

/* ====================================  MDR_RST_CLOCK PER_CLOCK TIMER2_CLK_EN [15..15]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_TIMER2_CLK_EN                                     */
  MDR_RST_CLOCK_PER_CLOCK_TIMER2_CLK_EN_Off = 0,/*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_TIMER2_CLK_EN_On = 1, /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_TIMER2_CLK_EN_Enum;

/* ====================================  MDR_RST_CLOCK PER_CLOCK TIMER3_CLK_EN [16..16]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_TIMER3_CLK_EN                                     */
  MDR_RST_CLOCK_PER_CLOCK_TIMER3_CLK_EN_Off = 0,/*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_TIMER3_CLK_EN_On = 1, /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_TIMER3_CLK_EN_Enum;

/* ======================================  MDR_RST_CLOCK PER_CLOCK ADC_CLK_EN [17..17]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_ADC_CLK_EN                                        */
  MDR_RST_CLOCK_PER_CLOCK_ADC_CLK_EN_Off = 0,   /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_ADC_CLK_EN_On = 1,    /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_ADC_CLK_EN_Enum;

/* ======================================  MDR_RST_CLOCK PER_CLOCK DAC_CLK_EN [18..18]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_DAC_CLK_EN                                        */
  MDR_RST_CLOCK_PER_CLOCK_DAC_CLK_EN_Off = 0,   /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_DAC_CLK_EN_On = 1,    /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_DAC_CLK_EN_Enum;

/* ======================================  MDR_RST_CLOCK PER_CLOCK CMP_CLK_EN [19..19]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_CMP_CLK_EN                                        */
  MDR_RST_CLOCK_PER_CLOCK_CMP_CLK_EN_Off = 0,   /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_CMP_CLK_EN_On = 1,    /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_CMP_CLK_EN_Enum;

