StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE9x.h
/* =====================================  MDR_RST_CLOCK PER_CLOCK SPI2_CLK_EN [20..20]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_SPI2_CLK_EN                                       */
  MDR_RST_CLOCK_PER_CLOCK_SPI2_CLK_EN_Off = 0,  /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_SPI2_CLK_EN_On = 1,   /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_SPI2_CLK_EN_Enum;

/* =====================================  MDR_RST_CLOCK PER_CLOCK PORTA_CLK_EN [21..21]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_PORTA_CLK_EN                                      */
  MDR_RST_CLOCK_PER_CLOCK_PORTA_CLK_EN_Off = 0, /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_PORTA_CLK_EN_On = 1,  /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_PORTA_CLK_EN_Enum;

/* =====================================  MDR_RST_CLOCK PER_CLOCK PORTB_CLK_EN [22..22]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_PORTB_CLK_EN                                      */
  MDR_RST_CLOCK_PER_CLOCK_PORTB_CLK_EN_Off = 0, /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_PORTB_CLK_EN_On = 1,  /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_PORTB_CLK_EN_Enum;

/* =====================================  MDR_RST_CLOCK PER_CLOCK PORTC_CLK_EN [23..23]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_PORTC_CLK_EN                                      */
  MDR_RST_CLOCK_PER_CLOCK_PORTC_CLK_EN_Off = 0, /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_PORTC_CLK_EN_On = 1,  /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_PORTC_CLK_EN_Enum;

/* =====================================  MDR_RST_CLOCK PER_CLOCK PORTD_CLK_EN [24..24]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_PORTD_CLK_EN                                      */
  MDR_RST_CLOCK_PER_CLOCK_PORTD_CLK_EN_Off = 0, /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_PORTD_CLK_EN_On = 1,  /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_PORTD_CLK_EN_Enum;

/* =====================================  MDR_RST_CLOCK PER_CLOCK PORTE_CLK_EN [25..25]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_PORTE_CLK_EN                                      */
  MDR_RST_CLOCK_PER_CLOCK_PORTE_CLK_EN_Off = 0, /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_PORTE_CLK_EN_On = 1,  /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_PORTE_CLK_EN_Enum;

/* ======================================  MDR_RST_CLOCK PER_CLOCK BKP_CLK_EN [27..27]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_BKP_CLK_EN                                        */
  MDR_RST_CLOCK_PER_CLOCK_BKP_CLK_EN_Off = 0,   /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_BKP_CLK_EN_On = 1,    /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_BKP_CLK_EN_Enum;

/* =====================================  MDR_RST_CLOCK PER_CLOCK PORTF_CLK_EN [29..29]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_PORTF_CLK_EN                                      */
  MDR_RST_CLOCK_PER_CLOCK_PORTF_CLK_EN_Off = 0, /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_PORTF_CLK_EN_On = 1,  /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_PORTF_CLK_EN_Enum;

/* ======================================  MDR_RST_CLOCK PER_CLOCK EBC_CLK_EN [30..30]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_EBC_CLK_EN                                        */
  MDR_RST_CLOCK_PER_CLOCK_EBC_CLK_EN_Off = 0,   /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_EBC_CLK_EN_On = 1,    /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_EBC_CLK_EN_Enum;

/* =======================================================  CAN_CLOCK  ======================================================= */
/* ========================================  MDR_RST_CLOCK CAN_CLOCK CAN1_BRG [0..2]  ======================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_CAN_CLOCK_CAN1_BRG                                          */
  MDR_RST__CAN1__BRG__div1             = 0,     /*!< div1 : div by 1                                                           */
  MDR_RST__CAN1__BRG__div2             = 1,     /*!< div2 : div by 2                                                           */
  MDR_RST__CAN1__BRG__div4             = 2,     /*!< div4 : div by 4                                                           */
  MDR_RST__CAN1__BRG__div8             = 3,     /*!< div8 : div by 8                                                           */
  MDR_RST__CAN1__BRG__div16            = 4,     /*!< div16 : div by 16                                                         */
  MDR_RST__CAN1__BRG__div32            = 5,     /*!< div32 : div by 32                                                         */
  MDR_RST__CAN1__BRG__div64            = 6,     /*!< div64 : div by 64                                                         */
  MDR_RST__CAN1__BRG__div128           = 7,     /*!< div128 : div by 128                                                       */
} MDR_RST__CAN1__BRG__Enum;

