StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE9x.h
/* ============================================  MDR_ADC ADC1_Cfg M_REF [11..11]  ============================================ */
typedef enum {                                  /*!< MDR_ADC_ADC1_Cfg_M_REF                                                    */
  MDR_ADC_ADC1_Cfg_M_REF_Internal      = 0,     /*!< Internal : Signal in [GND..AUcc]                                          */
  MDR_ADC_ADC1_Cfg_M_REF_External      = 1,     /*!< External : Signal in [ADC_Ref-..ADC_Ref+]                                 */
} MDR_ADC_ADC1_Cfg_M_REF_Enum;

/* ===========================================  MDR_ADC ADC1_Cfg DIV_CLK [12..15]  =========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC1_Cfg_DIV_CLK                                                  */
  MDR_ADC_ADC1_Cfg_DIV_CLK_div_1       = 0,     /*!< div_1 : CLK = CPU_CLK                                                     */
  MDR_ADC_ADC1_Cfg_DIV_CLK_div_2       = 1,     /*!< div_2 : CLK = CPU_CLK/2                                                   */
  MDR_ADC_ADC1_Cfg_DIV_CLK_div_4       = 2,     /*!< div_4 : CLK = CPU_CLK/4                                                   */
  MDR_ADC_ADC1_Cfg_DIV_CLK_div_8       = 3,     /*!< div_8 : CLK = CPU_CLK/8                                                   */
  MDR_ADC_ADC1_Cfg_DIV_CLK_div_16      = 4,     /*!< div_16 : CLK = CPU_CLK/16                                                 */
  MDR_ADC_ADC1_Cfg_DIV_CLK_div_32      = 5,     /*!< div_32 : CLK = CPU_CLK/32                                                 */
  MDR_ADC_ADC1_Cfg_DIV_CLK_div_64      = 6,     /*!< div_64 : CLK = CPU_CLK/64                                                 */
  MDR_ADC_ADC1_Cfg_DIV_CLK_div_128     = 7,     /*!< div_128 : CLK = CPU_CLK/128                                               */
  MDR_ADC_ADC1_Cfg_DIV_CLK_div_256     = 8,     /*!< div_256 : CLK = CPU_CLK/256                                               */
  MDR_ADC_ADC1_Cfg_DIV_CLK_div_512     = 9,     /*!< div_512 : CLK = CPU_CLK/512                                               */
  MDR_ADC_ADC1_Cfg_DIV_CLK_div_1024    = 10,    /*!< div_1024 : CLK = CPU_CLK/1024                                             */
  MDR_ADC_ADC1_Cfg_DIV_CLK_div_2048    = 11,    /*!< div_2048 : CLK = CPU_CLK/2048                                             */
} MDR_ADC_ADC1_Cfg_DIV_CLK_Enum;

/* ==========================================  MDR_ADC ADC1_Cfg SYNC_CONV [16..16]  ========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC1_Cfg_SYNC_CONV                                                */
  MDR_ADC_ADC1_Cfg_SYNC_CONV_NoSync    = 0,     /*!< NoSync : No sync ADC1 and ADC2                                            */
  MDR_ADC_ADC1_Cfg_SYNC_CONV_Sync      = 1,     /*!< Sync : ADC1 and ADC2 sync enable                                          */
} MDR_ADC_ADC1_Cfg_SYNC_CONV_Enum;

/* ============================================  MDR_ADC ADC1_Cfg TS_EN [17..17]  ============================================ */
typedef enum {                                  /*!< MDR_ADC_ADC1_Cfg_TS_EN                                                    */
  MDR_ADC_ADC1_Cfg_TS_EN_Disable       = 0,     /*!< Disable : Thermosensor power off                                          */
  MDR_ADC_ADC1_Cfg_TS_EN_Enable        = 1,     /*!< Enable : Thermosensor power on                                            */
} MDR_ADC_ADC1_Cfg_TS_EN_Enum;

/* =========================================  MDR_ADC ADC1_Cfg TS_BUFF_EN [18..18]  ========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC1_Cfg_TS_BUFF_EN                                               */
  MDR_ADC_ADC1_Cfg_TS_BUFF_EN_Disable  = 0,     /*!< Disable : Thermosensor buffer disabled                                    */
  MDR_ADC_ADC1_Cfg_TS_BUFF_EN_Enable   = 1,     /*!< Enable : Thermosensor buffer enabled                                      */
} MDR_ADC_ADC1_Cfg_TS_BUFF_EN_Enum;

/* ===========================================  MDR_ADC ADC1_Cfg SEL_TS [19..19]  ============================================ */
typedef enum {                                  /*!< MDR_ADC_ADC1_Cfg_SEL_TS                                                   */
  MDR_ADC_ADC1_Cfg_SEL_TS_Disable      = 0,     /*!< Disable : Channel 31 signal is undefined                                  */
  MDR_ADC_ADC1_Cfg_SEL_TS_Selected     = 1,     /*!< Selected : Channel 31 signal is temperature                               */
} MDR_ADC_ADC1_Cfg_SEL_TS_Enum;

/* ==========================================  MDR_ADC ADC1_Cfg SEL_VREF [20..20]  =========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC1_Cfg_SEL_VREF                                                 */
  MDR_ADC_ADC1_Cfg_SEL_VREF_Disable    = 0,     /*!< Disable : Channel 30 signal is undefined                                  */
  MDR_ADC_ADC1_Cfg_SEL_VREF_Selected   = 1,     /*!< Selected : Channel 30 signal is VRef                                      */
} MDR_ADC_ADC1_Cfg_SEL_VREF_Enum;

/* =============================================  MDR_ADC ADC1_Cfg TR [21..24]  ============================================== */
typedef enum {                                  /*!< MDR_ADC_ADC1_Cfg_TR                                                       */
  MDR_ADC_ADC1_Cfg_TR_Vref_1v23        = 0,     /*!< Vref_1v23 : 1.23V typically                                               */
  MDR_ADC_ADC1_Cfg_TR_Vref_1v213       = 1,     /*!< Vref_1v213 : 1.213V typically                                             */
  MDR_ADC_ADC1_Cfg_TR_Vref_1v211       = 2,     /*!< Vref_1v211 : 1.211V typically                                             */
  MDR_ADC_ADC1_Cfg_TR_Vref_1v208       = 3,     /*!< Vref_1v208 : 1.208V typically                                             */
  MDR_ADC_ADC1_Cfg_TR_Vref_1v206       = 4,     /*!< Vref_1v206 : 1.206V typically                                             */
  MDR_ADC_ADC1_Cfg_TR_Vref_1v203       = 5,     /*!< Vref_1v203 : 1.203V typically                                             */
  MDR_ADC_ADC1_Cfg_TR_Vref_1v200       = 6,     /*!< Vref_1v200 : 1.200V typically                                             */
  MDR_ADC_ADC1_Cfg_TR_Vref_1v197       = 7,     /*!< Vref_1v197 : 1.197V typically                                             */
  MDR_ADC_ADC1_Cfg_TR_Vref_1v193       = 8,     /*!< Vref_1v193 : 1.193V typically                                             */
} MDR_ADC_ADC1_Cfg_TR_Enum;

/* ==========================================  MDR_ADC ADC1_Cfg Delay_GO [25..27]  =========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC1_Cfg_Delay_GO                                                 */
  MDR_ADC_ADC1_Cfg_Delay_GO_1          = 0,     /*!< 1 : 1 period of CPU_CLK                                                   */
  MDR_ADC_ADC1_Cfg_Delay_GO_2          = 1,     /*!< 2 : 2 periods of CPU_CLK                                                  */
  MDR_ADC_ADC1_Cfg_Delay_GO_3          = 2,     /*!< 3 : 3 periods of CPU_CLK                                                  */
  MDR_ADC_ADC1_Cfg_Delay_GO_4          = 3,     /*!< 4 : 4 periods of CPU_CLK                                                  */
  MDR_ADC_ADC1_Cfg_Delay_GO_5          = 4,     /*!< 5 : 5 periods of CPU_CLK                                                  */
  MDR_ADC_ADC1_Cfg_Delay_GO_6          = 5,     /*!< 6 : 6 periods of CPU_CLK                                                  */
  MDR_ADC_ADC1_Cfg_Delay_GO_7          = 6,     /*!< 7 : 7 periods of CPU_CLK                                                  */
  MDR_ADC_ADC1_Cfg_Delay_GO_8          = 7,     /*!< 8 : 8 periods of CPU_CLK                                                  */
} MDR_ADC_ADC1_Cfg_Delay_GO_Enum;

/* ==========================================  MDR_ADC ADC1_Cfg Delay_ADC [28..31]  ========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC1_Cfg_Delay_ADC                                                */
  MDR_ADC_ADC1_Cfg_Delay_ADC_1         = 0,     /*!< 1 : 1 period of CPU_CLK                                                   */
  MDR_ADC_ADC1_Cfg_Delay_ADC_2         = 1,     /*!< 2 : 2 periods of CPU_CLK                                                  */
  MDR_ADC_ADC1_Cfg_Delay_ADC_3         = 2,     /*!< 3 : 3 periods of CPU_CLK                                                  */
  MDR_ADC_ADC1_Cfg_Delay_ADC_4         = 3,     /*!< 4 : 4 periods of CPU_CLK                                                  */
  MDR_ADC_ADC1_Cfg_Delay_ADC_5         = 4,     /*!< 5 : 5 periods of CPU_CLK                                                  */
  MDR_ADC_ADC1_Cfg_Delay_ADC_6         = 5,     /*!< 6 : 6 periods of CPU_CLK                                                  */
  MDR_ADC_ADC1_Cfg_Delay_ADC_7         = 6,     /*!< 7 : 7 periods of CPU_CLK                                                  */
  MDR_ADC_ADC1_Cfg_Delay_ADC_8         = 7,     /*!< 8 : 8 periods of CPU_CLK                                                  */
  MDR_ADC_ADC1_Cfg_Delay_ADC_9         = 8,     /*!< 9 : 9 period of CPU_CLK                                                   */
  MDR_ADC_ADC1_Cfg_Delay_ADC_10        = 9,     /*!< 10 : 10 periods of CPU_CLK                                                */
  MDR_ADC_ADC1_Cfg_Delay_ADC_11        = 10,    /*!< 11 : 11 periods of CPU_CLK                                                */
  MDR_ADC_ADC1_Cfg_Delay_ADC_12        = 11,    /*!< 12 : 12 periods of CPU_CLK                                                */
  MDR_ADC_ADC1_Cfg_Delay_ADC_13        = 12,    /*!< 13 : 13 periods of CPU_CLK                                                */
  MDR_ADC_ADC1_Cfg_Delay_ADC_14        = 13,    /*!< 14 : 14 periods of CPU_CLK                                                */
  MDR_ADC_ADC1_Cfg_Delay_ADC_15        = 14,    /*!< 15 : 15 periods of CPU_CLK                                                */
  MDR_ADC_ADC1_Cfg_Delay_ADC_16        = 15,    /*!< 16 : 16 periods of CPU_CLK                                                */
} MDR_ADC_ADC1_Cfg_Delay_ADC_Enum;

/* =======================================================  ADC2_Cfg  ======================================================== */
/* =============================================  MDR_ADC ADC2_Cfg ADON [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_ADC_ADC2_Cfg_ADON                                                     */
  MDR_ADC_ADC2_Cfg_ADON_Off            = 0,     /*!< Off : Disabled                                                            */
  MDR_ADC_ADC2_Cfg_ADON_On             = 1,     /*!< On : Enabled                                                              */
} MDR_ADC_ADC2_Cfg_ADON_Enum;

/* ==============================================  MDR_ADC ADC2_Cfg GO [1..1]  =============================================== */
typedef enum {                                  /*!< MDR_ADC_ADC2_Cfg_GO                                                       */
  MDR_ADC_ADC2_Cfg_GO_Inactive         = 0,     /*!< Inactive : Autoclear to zero after start                                  */
  MDR_ADC_ADC2_Cfg_GO_Start            = 1,     /*!< Start : Start measurement                                                 */
} MDR_ADC_ADC2_Cfg_GO_Enum;

