StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE9x.h
/* =============================================  MDR_ADC ADC2_Cfg CLKS [2..2]  ============================================== */
typedef enum {                                  /*!< MDR_ADC_ADC2_Cfg_CLKS                                                     */
  MDR_ADC_ADC2_Cfg_CLKS_CPU_Clock      = 0,     /*!< CPU_Clock : CPU_Clock used                                                */
  MDR_ADC_ADC2_Cfg_CLKS_ADC_Clock      = 1,     /*!< ADC_Clock : ADC_Clock used                                                */
} MDR_ADC_ADC2_Cfg_CLKS_Enum;

/* ============================================  MDR_ADC ADC2_Cfg SAMPLE [3..3]  ============================================= */
typedef enum {                                  /*!< MDR_ADC_ADC2_Cfg_SAMPLE                                                   */
  MDR_ADC_ADC2_Cfg_SAMPLE_Single       = 0,     /*!< Single : Single measurement by GO                                         */
  MDR_ADC_ADC2_Cfg_SAMPLE_Continuouse  = 1,     /*!< Continuouse : Continuous measurement, until stop by ADON                  */
} MDR_ADC_ADC2_Cfg_SAMPLE_Enum;

/* ==============================================  MDR_ADC ADC2_Cfg CHS [4..8]  ============================================== */
typedef enum {                                  /*!< MDR_ADC_ADC2_Cfg_CHS                                                      */
  MDR_ADC_ADC2_Cfg_CHS_Channel_0_RefP  = 0,     /*!< Channel_0_RefP : Signal on PD0, Ref+                                      */
  MDR_ADC_ADC2_Cfg_CHS_Channel_1_RefN  = 1,     /*!< Channel_1_RefN : Signal on PD1, Ref-                                      */
  MDR_ADC_ADC2_Cfg_CHS_Channel_2       = 2,     /*!< Channel_2 : Signal on PD2                                                 */
  MDR_ADC_ADC2_Cfg_CHS_Channel_3       = 3,     /*!< Channel_3 : Signal on PD3                                                 */
  MDR_ADC_ADC2_Cfg_CHS_Channel_4       = 4,     /*!< Channel_4 : Signal on PD4                                                 */
  MDR_ADC_ADC2_Cfg_CHS_Channel_5       = 5,     /*!< Channel_5 : Signal on PD5                                                 */
  MDR_ADC_ADC2_Cfg_CHS_Channel_6       = 6,     /*!< Channel_6 : Signal on PD6                                                 */
  MDR_ADC_ADC2_Cfg_CHS_Channel_7       = 7,     /*!< Channel_7 : Signal on PD7                                                 */
  MDR_ADC_ADC2_Cfg_CHS_Channel_8       = 8,     /*!< Channel_8 : Signal on PD8                                                 */
  MDR_ADC_ADC2_Cfg_CHS_Channel_9       = 9,     /*!< Channel_9 : Signal on PD9                                                 */
  MDR_ADC_ADC2_Cfg_CHS_Channel_10      = 10,    /*!< Channel_10 : Signal on PD10                                               */
  MDR_ADC_ADC2_Cfg_CHS_Channel_11      = 11,    /*!< Channel_11 : Signal on PD11                                               */
  MDR_ADC_ADC2_Cfg_CHS_Channel_12      = 12,    /*!< Channel_12 : Signal on PD12                                               */
  MDR_ADC_ADC2_Cfg_CHS_Channel_13      = 13,    /*!< Channel_13 : Signal on PD13                                               */
  MDR_ADC_ADC2_Cfg_CHS_Channel_14      = 14,    /*!< Channel_14 : Signal on PD14                                               */
  MDR_ADC_ADC2_Cfg_CHS_Channel_15      = 15,    /*!< Channel_15 : Signal on PD15                                               */
  MDR_ADC_ADC2_Cfg_CHS_TS_VRef_1.23    = 30,    /*!< TS_VRef_1.23 : Signal from Thermosensor                                   */
  MDR_ADC_ADC2_Cfg_CHS_TS_Temperature  = 31,    /*!< TS_Temperature : Signal from Thermosensor                                 */
} MDR_ADC_ADC2_Cfg_CHS_Enum;

/* =============================================  MDR_ADC ADC2_Cfg CHCH [9..9]  ============================================== */
typedef enum {                                  /*!< MDR_ADC_ADC2_Cfg_CHCH                                                     */
  MDR_ADC_ADC2_Cfg_CHCH_Disable        = 0,     /*!< Disable : Measure only CHS channel                                        */
  MDR_ADC_ADC2_Cfg_CHCH_Enable         = 1,     /*!< Enable : Measure channels selected in reg CHSEL                           */
} MDR_ADC_ADC2_Cfg_CHCH_Enum;

/* ============================================  MDR_ADC ADC2_Cfg RGNC [10..10]  ============================================= */
typedef enum {                                  /*!< MDR_ADC_ADC2_Cfg_RGNC                                                     */
  MDR_ADC_ADC2_Cfg_RGNC_Disable        = 0,     /*!< Disable : Flag STATUSx.AWOIFEN inactive                                   */
  MDR_ADC_ADC2_Cfg_RGNC_Enable         = 1,     /*!< Enable : Flag STATUSx.AWOIFEN enable                                      */
} MDR_ADC_ADC2_Cfg_RGNC_Enum;

/* ============================================  MDR_ADC ADC2_Cfg M_REF [11..11]  ============================================ */
typedef enum {                                  /*!< MDR_ADC_ADC2_Cfg_M_REF                                                    */
  MDR_ADC_ADC2_Cfg_M_REF_Internal      = 0,     /*!< Internal : Signal in [GND..AUcc]                                          */
  MDR_ADC_ADC2_Cfg_M_REF_External      = 1,     /*!< External : Signal in [ADC_Ref-..ADC_Ref+]                                 */
} MDR_ADC_ADC2_Cfg_M_REF_Enum;

/* ===========================================  MDR_ADC ADC2_Cfg DIV_CLK [12..15]  =========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC2_Cfg_DIV_CLK                                                  */
  MDR_ADC_ADC2_Cfg_DIV_CLK_div_1       = 0,     /*!< div_1 : CLK = CPU_CLK                                                     */
  MDR_ADC_ADC2_Cfg_DIV_CLK_div_2       = 1,     /*!< div_2 : CLK = CPU_CLK/2                                                   */
  MDR_ADC_ADC2_Cfg_DIV_CLK_div_4       = 2,     /*!< div_4 : CLK = CPU_CLK/4                                                   */
  MDR_ADC_ADC2_Cfg_DIV_CLK_div_8       = 3,     /*!< div_8 : CLK = CPU_CLK/8                                                   */
  MDR_ADC_ADC2_Cfg_DIV_CLK_div_16      = 4,     /*!< div_16 : CLK = CPU_CLK/16                                                 */
  MDR_ADC_ADC2_Cfg_DIV_CLK_div_32      = 5,     /*!< div_32 : CLK = CPU_CLK/32                                                 */
  MDR_ADC_ADC2_Cfg_DIV_CLK_div_64      = 6,     /*!< div_64 : CLK = CPU_CLK/64                                                 */
  MDR_ADC_ADC2_Cfg_DIV_CLK_div_128     = 7,     /*!< div_128 : CLK = CPU_CLK/128                                               */
  MDR_ADC_ADC2_Cfg_DIV_CLK_div_256     = 8,     /*!< div_256 : CLK = CPU_CLK/256                                               */
  MDR_ADC_ADC2_Cfg_DIV_CLK_div_512     = 9,     /*!< div_512 : CLK = CPU_CLK/512                                               */
  MDR_ADC_ADC2_Cfg_DIV_CLK_div_1024    = 10,    /*!< div_1024 : CLK = CPU_CLK/1024                                             */
  MDR_ADC_ADC2_Cfg_DIV_CLK_div_2048    = 11,    /*!< div_2048 : CLK = CPU_CLK/2048                                             */
} MDR_ADC_ADC2_Cfg_DIV_CLK_Enum;

/* ===========================================  MDR_ADC ADC2_Cfg ADC1_OP [17..17]  =========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC2_Cfg_ADC1_OP                                                  */
  MDR_ADC_ADC2_Cfg_ADC1_OP_Own         = 0,     /*!< Own : Own setpoint Vref                                                   */
  MDR_ADC_ADC2_Cfg_ADC1_OP_Thermosensor = 1,    /*!< Thermosensor : Setpoint Vref from Thermosensor                            */
} MDR_ADC_ADC2_Cfg_ADC1_OP_Enum;

/* ===========================================  MDR_ADC ADC2_Cfg ADC2_OP [18..18]  =========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC2_Cfg_ADC2_OP                                                  */
  MDR_ADC_ADC2_Cfg_ADC2_OP_Own         = 0,     /*!< Own : Own setpoint Vref                                                   */
  MDR_ADC_ADC2_Cfg_ADC2_OP_Thermosensor = 1,    /*!< Thermosensor : Setpoint Vref from Thermosensor                            */
} MDR_ADC_ADC2_Cfg_ADC2_OP_Enum;

