StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE9x.h
/* ==========================================  MDR_ADC ADC2_Cfg Delay_GO [25..27]  =========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC2_Cfg_Delay_GO                                                 */
  MDR_ADC_ADC2_Cfg_Delay_GO_1          = 0,     /*!< 1 : 1 period of CPU_CLK                                                   */
  MDR_ADC_ADC2_Cfg_Delay_GO_2          = 1,     /*!< 2 : 2 periods of CPU_CLK                                                  */
  MDR_ADC_ADC2_Cfg_Delay_GO_3          = 2,     /*!< 3 : 3 periods of CPU_CLK                                                  */
  MDR_ADC_ADC2_Cfg_Delay_GO_4          = 3,     /*!< 4 : 4 periods of CPU_CLK                                                  */
  MDR_ADC_ADC2_Cfg_Delay_GO_5          = 4,     /*!< 5 : 5 periods of CPU_CLK                                                  */
  MDR_ADC_ADC2_Cfg_Delay_GO_6          = 5,     /*!< 6 : 6 periods of CPU_CLK                                                  */
  MDR_ADC_ADC2_Cfg_Delay_GO_7          = 6,     /*!< 7 : 7 periods of CPU_CLK                                                  */
  MDR_ADC_ADC2_Cfg_Delay_GO_8          = 7,     /*!< 8 : 8 periods of CPU_CLK                                                  */
} MDR_ADC_ADC2_Cfg_Delay_GO_Enum;

/* =====================================================  ADC1_H_Level  ====================================================== */
/* =====================================================  ADC2_H_Level  ====================================================== */
/* =====================================================  ADC1_L_Level  ====================================================== */
/* =====================================================  ADC2_L_Level  ====================================================== */
/* ======================================================  ADC1_RESULT  ====================================================== */
/* =========================================  MDR_ADC ADC1_RESULT Channel [16..20]  ========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC1_RESULT_Channel                                               */
  MDR_ADC_ADC1_RESULT_Channel_Channel_0_RefP = 0,/*!< Channel_0_RefP : Signal on PD0, Ref+                                     */
  MDR_ADC_ADC1_RESULT_Channel_Channel_1_RefN = 1,/*!< Channel_1_RefN : Signal on PD1, Ref-                                     */
  MDR_ADC_ADC1_RESULT_Channel_Channel_2 = 2,    /*!< Channel_2 : Signal on PD2                                                 */
  MDR_ADC_ADC1_RESULT_Channel_Channel_3 = 3,    /*!< Channel_3 : Signal on PD3                                                 */
  MDR_ADC_ADC1_RESULT_Channel_Channel_4 = 4,    /*!< Channel_4 : Signal on PD4                                                 */
  MDR_ADC_ADC1_RESULT_Channel_Channel_5 = 5,    /*!< Channel_5 : Signal on PD5                                                 */
  MDR_ADC_ADC1_RESULT_Channel_Channel_6 = 6,    /*!< Channel_6 : Signal on PD6                                                 */
  MDR_ADC_ADC1_RESULT_Channel_Channel_7 = 7,    /*!< Channel_7 : Signal on PD7                                                 */
  MDR_ADC_ADC1_RESULT_Channel_Channel_8 = 8,    /*!< Channel_8 : Signal on PD8                                                 */
  MDR_ADC_ADC1_RESULT_Channel_Channel_9 = 9,    /*!< Channel_9 : Signal on PD9                                                 */
  MDR_ADC_ADC1_RESULT_Channel_Channel_10 = 10,  /*!< Channel_10 : Signal on PD10                                               */
  MDR_ADC_ADC1_RESULT_Channel_Channel_11 = 11,  /*!< Channel_11 : Signal on PD11                                               */
  MDR_ADC_ADC1_RESULT_Channel_Channel_12 = 12,  /*!< Channel_12 : Signal on PD12                                               */
  MDR_ADC_ADC1_RESULT_Channel_Channel_13 = 13,  /*!< Channel_13 : Signal on PD13                                               */
  MDR_ADC_ADC1_RESULT_Channel_Channel_14 = 14,  /*!< Channel_14 : Signal on PD14                                               */
  MDR_ADC_ADC1_RESULT_Channel_Channel_15 = 15,  /*!< Channel_15 : Signal on PD15                                               */
  MDR_ADC_ADC1_RESULT_Channel_TS_VRef_1.23 = 30,/*!< TS_VRef_1.23 : Signal from Thermosensor                                   */
  MDR_ADC_ADC1_RESULT_Channel_TS_Temperature = 31,/*!< TS_Temperature : Signal from Thermosensor                               */
} MDR_ADC_ADC1_RESULT_Channel_Enum;

/* ======================================================  ADC2_RESULT  ====================================================== */
/* =========================================  MDR_ADC ADC2_RESULT Channel [16..20]  ========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC2_RESULT_Channel                                               */
  MDR_ADC_ADC2_RESULT_Channel_Channel_0_RefP = 0,/*!< Channel_0_RefP : Signal on PD0, Ref+                                     */
  MDR_ADC_ADC2_RESULT_Channel_Channel_1_RefN = 1,/*!< Channel_1_RefN : Signal on PD1, Ref-                                     */
  MDR_ADC_ADC2_RESULT_Channel_Channel_2 = 2,    /*!< Channel_2 : Signal on PD2                                                 */
  MDR_ADC_ADC2_RESULT_Channel_Channel_3 = 3,    /*!< Channel_3 : Signal on PD3                                                 */
  MDR_ADC_ADC2_RESULT_Channel_Channel_4 = 4,    /*!< Channel_4 : Signal on PD4                                                 */
  MDR_ADC_ADC2_RESULT_Channel_Channel_5 = 5,    /*!< Channel_5 : Signal on PD5                                                 */
  MDR_ADC_ADC2_RESULT_Channel_Channel_6 = 6,    /*!< Channel_6 : Signal on PD6                                                 */
  MDR_ADC_ADC2_RESULT_Channel_Channel_7 = 7,    /*!< Channel_7 : Signal on PD7                                                 */
  MDR_ADC_ADC2_RESULT_Channel_Channel_8 = 8,    /*!< Channel_8 : Signal on PD8                                                 */
  MDR_ADC_ADC2_RESULT_Channel_Channel_9 = 9,    /*!< Channel_9 : Signal on PD9                                                 */
  MDR_ADC_ADC2_RESULT_Channel_Channel_10 = 10,  /*!< Channel_10 : Signal on PD10                                               */
  MDR_ADC_ADC2_RESULT_Channel_Channel_11 = 11,  /*!< Channel_11 : Signal on PD11                                               */
  MDR_ADC_ADC2_RESULT_Channel_Channel_12 = 12,  /*!< Channel_12 : Signal on PD12                                               */
  MDR_ADC_ADC2_RESULT_Channel_Channel_13 = 13,  /*!< Channel_13 : Signal on PD13                                               */
  MDR_ADC_ADC2_RESULT_Channel_Channel_14 = 14,  /*!< Channel_14 : Signal on PD14                                               */
  MDR_ADC_ADC2_RESULT_Channel_Channel_15 = 15,  /*!< Channel_15 : Signal on PD15                                               */
  MDR_ADC_ADC2_RESULT_Channel_TS_VRef_1.23 = 30,/*!< TS_VRef_1.23 : Signal from Thermosensor                                   */
  MDR_ADC_ADC2_RESULT_Channel_TS_Temperature = 31,/*!< TS_Temperature : Signal from Thermosensor                               */
} MDR_ADC_ADC2_RESULT_Channel_Enum;

/* ======================================================  ADC1_STATUS  ====================================================== */
/* =========================================  MDR_ADC ADC1_STATUS Overwrite [0..0]  ========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC1_STATUS_Overwrite                                             */
  MDR_ADC_ADC1_STATUS_Overwrite_Normal = 0,     /*!< Normal : No overwritten occure                                            */
  MDR_ADC_ADC1_STATUS_Overwrite_Overwrite = 1,  /*!< Overwrite : Result overwritten                                            */
} MDR_ADC_ADC1_STATUS_Overwrite_Enum;

/* ==========================================  MDR_ADC ADC1_STATUS AWOIFEN [1..1]  =========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC1_STATUS_AWOIFEN                                               */
  MDR_ADC_ADC1_STATUS_AWOIFEN_InRange  = 0,     /*!< InRange : Signal in range                                                 */
  MDR_ADC_ADC1_STATUS_AWOIFEN_OutOfRange = 1,   /*!< OutOfRange : Signal is out of range                                       */
} MDR_ADC_ADC1_STATUS_AWOIFEN_Enum;

/* ===========================================  MDR_ADC ADC1_STATUS EOCIF [2..2]  ============================================ */
typedef enum {                                  /*!< MDR_ADC_ADC1_STATUS_EOCIF                                                 */
  MDR_ADC_ADC1_STATUS_EOCIF_NoResult   = 0,     /*!< NoResult : Result is not ready                                            */
  MDR_ADC_ADC1_STATUS_EOCIF_Ready      = 1,     /*!< Ready : Signal is ready to read                                           */
} MDR_ADC_ADC1_STATUS_EOCIF_Enum;

