StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE9x.h
/* ==========================================  MDR_ADC ADC1_STATUS AWOIF_IE [3..3]  ========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC1_STATUS_AWOIF_IE                                              */
  MDR_ADC_ADC1_STATUS_AWOIF_IE_Disable = 0,     /*!< Disable : IRQ Disable                                                     */
  MDR_ADC_ADC1_STATUS_AWOIF_IE_Enable  = 1,     /*!< Enable : IRQ Enable                                                       */
} MDR_ADC_ADC1_STATUS_AWOIF_IE_Enum;

/* ==========================================  MDR_ADC ADC1_STATUS EOCIF_EN [4..4]  ========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC1_STATUS_EOCIF_EN                                              */
  MDR_ADC_ADC1_STATUS_EOCIF_EN_Disable = 0,     /*!< Disable : IRQ Disable                                                     */
  MDR_ADC_ADC1_STATUS_EOCIF_EN_Enable  = 1,     /*!< Enable : IRQ Enable                                                       */
} MDR_ADC_ADC1_STATUS_EOCIF_EN_Enum;

/* ======================================================  ADC2_STATUS  ====================================================== */
/* =========================================  MDR_ADC ADC2_STATUS Overwrite [0..0]  ========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC2_STATUS_Overwrite                                             */
  MDR_ADC_ADC2_STATUS_Overwrite_Normal = 0,     /*!< Normal : No overwritten occure                                            */
  MDR_ADC_ADC2_STATUS_Overwrite_Overwrite = 1,  /*!< Overwrite : Result overwritten                                            */
} MDR_ADC_ADC2_STATUS_Overwrite_Enum;

/* ==========================================  MDR_ADC ADC2_STATUS AWOIFEN [1..1]  =========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC2_STATUS_AWOIFEN                                               */
  MDR_ADC_ADC2_STATUS_AWOIFEN_InRange  = 0,     /*!< InRange : Signal in range                                                 */
  MDR_ADC_ADC2_STATUS_AWOIFEN_OutOfRange = 1,   /*!< OutOfRange : Signal is out of range                                       */
} MDR_ADC_ADC2_STATUS_AWOIFEN_Enum;

/* ===========================================  MDR_ADC ADC2_STATUS EOCIF [2..2]  ============================================ */
typedef enum {                                  /*!< MDR_ADC_ADC2_STATUS_EOCIF                                                 */
  MDR_ADC_ADC2_STATUS_EOCIF_NoResult   = 0,     /*!< NoResult : Result is not ready                                            */
  MDR_ADC_ADC2_STATUS_EOCIF_Ready      = 1,     /*!< Ready : Signal is ready to read                                           */
} MDR_ADC_ADC2_STATUS_EOCIF_Enum;

/* ==========================================  MDR_ADC ADC2_STATUS AWOIF_IE [3..3]  ========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC2_STATUS_AWOIF_IE                                              */
  MDR_ADC_ADC2_STATUS_AWOIF_IE_Disable = 0,     /*!< Disable : IRQ Disable                                                     */
  MDR_ADC_ADC2_STATUS_AWOIF_IE_Enable  = 1,     /*!< Enable : IRQ Enable                                                       */
} MDR_ADC_ADC2_STATUS_AWOIF_IE_Enum;

/* ==========================================  MDR_ADC ADC2_STATUS EOCIF_EN [4..4]  ========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC2_STATUS_EOCIF_EN                                              */
  MDR_ADC_ADC2_STATUS_EOCIF_EN_Disable = 0,     /*!< Disable : IRQ Disable                                                     */
  MDR_ADC_ADC2_STATUS_EOCIF_EN_Enable  = 1,     /*!< Enable : IRQ Enable                                                       */
} MDR_ADC_ADC2_STATUS_EOCIF_EN_Enum;

/* ======================================================  ADC1_CHSEL  ======================================================= */
/* ==========================================  MDR_ADC ADC1_CHSEL Channel_0 [0..0]  ========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC1_CHSEL_Channel_0                                              */
  MDR_ADC_ADC1_CHSEL_Channel_0_Off     = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC1_CHSEL_Channel_0_Selected = 1,    /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC1_CHSEL_Channel_0_Enum;

/* ==========================================  MDR_ADC ADC1_CHSEL Channel_1 [1..1]  ========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC1_CHSEL_Channel_1                                              */
  MDR_ADC_ADC1_CHSEL_Channel_1_Off     = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC1_CHSEL_Channel_1_Selected = 1,    /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC1_CHSEL_Channel_1_Enum;

/* ==========================================  MDR_ADC ADC1_CHSEL Channel_2 [2..2]  ========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC1_CHSEL_Channel_2                                              */
  MDR_ADC_ADC1_CHSEL_Channel_2_Off     = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC1_CHSEL_Channel_2_Selected = 1,    /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC1_CHSEL_Channel_2_Enum;

/* ==========================================  MDR_ADC ADC1_CHSEL Channel_3 [3..3]  ========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC1_CHSEL_Channel_3                                              */
  MDR_ADC_ADC1_CHSEL_Channel_3_Off     = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC1_CHSEL_Channel_3_Selected = 1,    /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC1_CHSEL_Channel_3_Enum;

/* ==========================================  MDR_ADC ADC1_CHSEL Channel_4 [4..4]  ========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC1_CHSEL_Channel_4                                              */
  MDR_ADC_ADC1_CHSEL_Channel_4_Off     = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC1_CHSEL_Channel_4_Selected = 1,    /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC1_CHSEL_Channel_4_Enum;

