StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE9x.h
/* ==========================================  MDR_ADC ADC1_CHSEL Channel_5 [5..5]  ========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC1_CHSEL_Channel_5                                              */
  MDR_ADC_ADC1_CHSEL_Channel_5_Off     = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC1_CHSEL_Channel_5_Selected = 1,    /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC1_CHSEL_Channel_5_Enum;

/* ==========================================  MDR_ADC ADC1_CHSEL Channel_6 [6..6]  ========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC1_CHSEL_Channel_6                                              */
  MDR_ADC_ADC1_CHSEL_Channel_6_Off     = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC1_CHSEL_Channel_6_Selected = 1,    /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC1_CHSEL_Channel_6_Enum;

/* ==========================================  MDR_ADC ADC1_CHSEL Channel_7 [7..7]  ========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC1_CHSEL_Channel_7                                              */
  MDR_ADC_ADC1_CHSEL_Channel_7_Off     = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC1_CHSEL_Channel_7_Selected = 1,    /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC1_CHSEL_Channel_7_Enum;

/* ==========================================  MDR_ADC ADC1_CHSEL Channel_8 [8..8]  ========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC1_CHSEL_Channel_8                                              */
  MDR_ADC_ADC1_CHSEL_Channel_8_Off     = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC1_CHSEL_Channel_8_Selected = 1,    /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC1_CHSEL_Channel_8_Enum;

/* ==========================================  MDR_ADC ADC1_CHSEL Channel_9 [9..9]  ========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC1_CHSEL_Channel_9                                              */
  MDR_ADC_ADC1_CHSEL_Channel_9_Off     = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC1_CHSEL_Channel_9_Selected = 1,    /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC1_CHSEL_Channel_9_Enum;

/* ========================================  MDR_ADC ADC1_CHSEL Channel_10 [10..10]  ========================================= */
typedef enum {                                  /*!< MDR_ADC_ADC1_CHSEL_Channel_10                                             */
  MDR_ADC_ADC1_CHSEL_Channel_10_Off    = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC1_CHSEL_Channel_10_Selected = 1,   /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC1_CHSEL_Channel_10_Enum;

/* ========================================  MDR_ADC ADC1_CHSEL Channel_11 [11..11]  ========================================= */
typedef enum {                                  /*!< MDR_ADC_ADC1_CHSEL_Channel_11                                             */
  MDR_ADC_ADC1_CHSEL_Channel_11_Off    = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC1_CHSEL_Channel_11_Selected = 1,   /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC1_CHSEL_Channel_11_Enum;

/* ========================================  MDR_ADC ADC1_CHSEL Channel_12 [12..12]  ========================================= */
typedef enum {                                  /*!< MDR_ADC_ADC1_CHSEL_Channel_12                                             */
  MDR_ADC_ADC1_CHSEL_Channel_12_Off    = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC1_CHSEL_Channel_12_Selected = 1,   /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC1_CHSEL_Channel_12_Enum;

/* ========================================  MDR_ADC ADC1_CHSEL Channel_13 [13..13]  ========================================= */
typedef enum {                                  /*!< MDR_ADC_ADC1_CHSEL_Channel_13                                             */
  MDR_ADC_ADC1_CHSEL_Channel_13_Off    = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC1_CHSEL_Channel_13_Selected = 1,   /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC1_CHSEL_Channel_13_Enum;

/* ========================================  MDR_ADC ADC1_CHSEL Channel_14 [14..14]  ========================================= */
typedef enum {                                  /*!< MDR_ADC_ADC1_CHSEL_Channel_14                                             */
  MDR_ADC_ADC1_CHSEL_Channel_14_Off    = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC1_CHSEL_Channel_14_Selected = 1,   /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC1_CHSEL_Channel_14_Enum;

/* ========================================  MDR_ADC ADC1_CHSEL Channel_15 [15..15]  ========================================= */
typedef enum {                                  /*!< MDR_ADC_ADC1_CHSEL_Channel_15                                             */
  MDR_ADC_ADC1_CHSEL_Channel_15_Off    = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC1_CHSEL_Channel_15_Selected = 1,   /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC1_CHSEL_Channel_15_Enum;

