StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE9x.h
/* ========================================  MDR_ADC ADC1_CHSEL Channel_30 [30..30]  ========================================= */
typedef enum {                                  /*!< MDR_ADC_ADC1_CHSEL_Channel_30                                             */
  MDR_ADC_ADC1_CHSEL_Channel_30_Off    = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC1_CHSEL_Channel_30_Selected = 1,   /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC1_CHSEL_Channel_30_Enum;

/* ========================================  MDR_ADC ADC1_CHSEL Channel_31 [31..31]  ========================================= */
typedef enum {                                  /*!< MDR_ADC_ADC1_CHSEL_Channel_31                                             */
  MDR_ADC_ADC1_CHSEL_Channel_31_Off    = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC1_CHSEL_Channel_31_Selected = 1,   /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC1_CHSEL_Channel_31_Enum;

/* ======================================================  ADC2_CHSEL  ======================================================= */
/* ==========================================  MDR_ADC ADC2_CHSEL Channel_0 [0..0]  ========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC2_CHSEL_Channel_0                                              */
  MDR_ADC_ADC2_CHSEL_Channel_0_Off     = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC2_CHSEL_Channel_0_Selected = 1,    /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC2_CHSEL_Channel_0_Enum;

/* ==========================================  MDR_ADC ADC2_CHSEL Channel_1 [1..1]  ========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC2_CHSEL_Channel_1                                              */
  MDR_ADC_ADC2_CHSEL_Channel_1_Off     = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC2_CHSEL_Channel_1_Selected = 1,    /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC2_CHSEL_Channel_1_Enum;

/* ==========================================  MDR_ADC ADC2_CHSEL Channel_2 [2..2]  ========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC2_CHSEL_Channel_2                                              */
  MDR_ADC_ADC2_CHSEL_Channel_2_Off     = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC2_CHSEL_Channel_2_Selected = 1,    /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC2_CHSEL_Channel_2_Enum;

/* ==========================================  MDR_ADC ADC2_CHSEL Channel_3 [3..3]  ========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC2_CHSEL_Channel_3                                              */
  MDR_ADC_ADC2_CHSEL_Channel_3_Off     = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC2_CHSEL_Channel_3_Selected = 1,    /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC2_CHSEL_Channel_3_Enum;

/* ==========================================  MDR_ADC ADC2_CHSEL Channel_4 [4..4]  ========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC2_CHSEL_Channel_4                                              */
  MDR_ADC_ADC2_CHSEL_Channel_4_Off     = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC2_CHSEL_Channel_4_Selected = 1,    /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC2_CHSEL_Channel_4_Enum;

/* ==========================================  MDR_ADC ADC2_CHSEL Channel_5 [5..5]  ========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC2_CHSEL_Channel_5                                              */
  MDR_ADC_ADC2_CHSEL_Channel_5_Off     = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC2_CHSEL_Channel_5_Selected = 1,    /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC2_CHSEL_Channel_5_Enum;

/* ==========================================  MDR_ADC ADC2_CHSEL Channel_6 [6..6]  ========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC2_CHSEL_Channel_6                                              */
  MDR_ADC_ADC2_CHSEL_Channel_6_Off     = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC2_CHSEL_Channel_6_Selected = 1,    /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC2_CHSEL_Channel_6_Enum;

/* ==========================================  MDR_ADC ADC2_CHSEL Channel_7 [7..7]  ========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC2_CHSEL_Channel_7                                              */
  MDR_ADC_ADC2_CHSEL_Channel_7_Off     = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC2_CHSEL_Channel_7_Selected = 1,    /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC2_CHSEL_Channel_7_Enum;

/* ==========================================  MDR_ADC ADC2_CHSEL Channel_8 [8..8]  ========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC2_CHSEL_Channel_8                                              */
  MDR_ADC_ADC2_CHSEL_Channel_8_Off     = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC2_CHSEL_Channel_8_Selected = 1,    /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC2_CHSEL_Channel_8_Enum;

/* ==========================================  MDR_ADC ADC2_CHSEL Channel_9 [9..9]  ========================================== */
typedef enum {                                  /*!< MDR_ADC_ADC2_CHSEL_Channel_9                                              */
  MDR_ADC_ADC2_CHSEL_Channel_9_Off     = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC2_CHSEL_Channel_9_Selected = 1,    /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC2_CHSEL_Channel_9_Enum;

/* ========================================  MDR_ADC ADC2_CHSEL Channel_10 [10..10]  ========================================= */
typedef enum {                                  /*!< MDR_ADC_ADC2_CHSEL_Channel_10                                             */
  MDR_ADC_ADC2_CHSEL_Channel_10_Off    = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC2_CHSEL_Channel_10_Selected = 1,   /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC2_CHSEL_Channel_10_Enum;

