StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE9x.h
/* ========================================  MDR_ADC ADC2_CHSEL Channel_11 [11..11]  ========================================= */
typedef enum {                                  /*!< MDR_ADC_ADC2_CHSEL_Channel_11                                             */
  MDR_ADC_ADC2_CHSEL_Channel_11_Off    = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC2_CHSEL_Channel_11_Selected = 1,   /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC2_CHSEL_Channel_11_Enum;

/* ========================================  MDR_ADC ADC2_CHSEL Channel_12 [12..12]  ========================================= */
typedef enum {                                  /*!< MDR_ADC_ADC2_CHSEL_Channel_12                                             */
  MDR_ADC_ADC2_CHSEL_Channel_12_Off    = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC2_CHSEL_Channel_12_Selected = 1,   /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC2_CHSEL_Channel_12_Enum;

/* ========================================  MDR_ADC ADC2_CHSEL Channel_13 [13..13]  ========================================= */
typedef enum {                                  /*!< MDR_ADC_ADC2_CHSEL_Channel_13                                             */
  MDR_ADC_ADC2_CHSEL_Channel_13_Off    = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC2_CHSEL_Channel_13_Selected = 1,   /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC2_CHSEL_Channel_13_Enum;

/* ========================================  MDR_ADC ADC2_CHSEL Channel_14 [14..14]  ========================================= */
typedef enum {                                  /*!< MDR_ADC_ADC2_CHSEL_Channel_14                                             */
  MDR_ADC_ADC2_CHSEL_Channel_14_Off    = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC2_CHSEL_Channel_14_Selected = 1,   /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC2_CHSEL_Channel_14_Enum;

/* ========================================  MDR_ADC ADC2_CHSEL Channel_15 [15..15]  ========================================= */
typedef enum {                                  /*!< MDR_ADC_ADC2_CHSEL_Channel_15                                             */
  MDR_ADC_ADC2_CHSEL_Channel_15_Off    = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC2_CHSEL_Channel_15_Selected = 1,   /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC2_CHSEL_Channel_15_Enum;

/* ========================================  MDR_ADC ADC2_CHSEL Channel_30 [30..30]  ========================================= */
typedef enum {                                  /*!< MDR_ADC_ADC2_CHSEL_Channel_30                                             */
  MDR_ADC_ADC2_CHSEL_Channel_30_Off    = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC2_CHSEL_Channel_30_Selected = 1,   /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC2_CHSEL_Channel_30_Enum;

/* ========================================  MDR_ADC ADC2_CHSEL Channel_31 [31..31]  ========================================= */
typedef enum {                                  /*!< MDR_ADC_ADC2_CHSEL_Channel_31                                             */
  MDR_ADC_ADC2_CHSEL_Channel_31_Off    = 0,     /*!< Off : Not used in channels switching                                      */
  MDR_ADC_ADC2_CHSEL_Channel_31_Selected = 1,   /*!< Selected : Using in channels switching                                    */
} MDR_ADC_ADC2_CHSEL_Channel_31_Enum;



/* =========================================================================================================================== */
/* ================                                          MDR_BKP                                          ================ */
/* =========================================================================================================================== */

/* ========================================================  REG_00  ========================================================= */
/* ========================================================  REG_01  ========================================================= */
/* ========================================================  REG_02  ========================================================= */
/* ========================================================  REG_03  ========================================================= */
/* ========================================================  REG_04  ========================================================= */
/* ========================================================  REG_05  ========================================================= */
/* ========================================================  REG_06  ========================================================= */
/* ========================================================  REG_07  ========================================================= */
/* ========================================================  REG_08  ========================================================= */
/* ========================================================  REG_09  ========================================================= */
/* ========================================================  REG_0A  ========================================================= */
/* ========================================================  REG_0B  ========================================================= */
/* ========================================================  REG_0C  ========================================================= */
/* ========================================================  REG_0D  ========================================================= */
/* ========================================================  REG_0E  ========================================================= */
/* ===============================================  MDR_BKP REG_0E LOW [0..2]  =============================================== */
typedef enum {                                  /*!< MDR_BKP_REG_0E_LOW                                                        */
  MDR_BKP_0E__LOW__10MHz               = 0,     /*!< 10MHz : CPU Clock less then 10MHz                                         */
  MDR_BKP_0E__LOW__200KHz              = 1,     /*!< 200KHz : CPU Clock less then 200KHz                                       */
  MDR_BKP_0E__LOW__500KHz              = 2,     /*!< 500KHz : CPU Clock less then 500KHz                                       */
  MDR_BKP_0E__LOW__1MHz                = 3,     /*!< 1MHz : CPU Clock less then 1MHz                                           */
  MDR_BKP_0E__LOW__GensOffz            = 4,     /*!< GensOffz : Generators Off                                                 */
  MDR_BKP_0E__LOW__40MHz               = 5,     /*!< 40MHz : CPU Clock less then 40MHz                                         */
  MDR_BKP_0E__LOW__80MHz               = 6,     /*!< 80MHz : CPU Clock less then 80MHz                                         */
  MDR_BKP_0E__LOW__above_80MHz         = 7,     /*!< above_80MHz : CPU Clock above 10MHz                                       */
} MDR_BKP_0E__LOW__Enum;

/* ============================================  MDR_BKP REG_0E SelectRI [3..5]  ============================================= */
typedef enum {                                  /*!< MDR_BKP_REG_0E_SelectRI                                                   */
  MDR_BKP_0E__SelRI__10MHz             = 0,     /*!< 10MHz : Additional I ~ 300uA                                              */
  MDR_BKP_0E__SelRI__200KHz            = 1,     /*!< 200KHz : Additional I ~ 6.6uA                                             */
  MDR_BKP_0E__SelRI__500KHz            = 2,     /*!< 500KHz : Additional I ~ 20A                                               */
  MDR_BKP_0E__SelRI__1MHz              = 3,     /*!< 1MHz : Additional I ~ 80uA                                                */
  MDR_BKP_0E__SelRI__GensOffz          = 4,     /*!< GensOffz : Additional I ~ 2uA                                             */
  MDR_BKP_0E__SelRI__40MHz             = 5,     /*!< 40MHz : Additional I ~ 900uA                                              */
  MDR_BKP_0E__SelRI__80MHz             = 6,     /*!< 80MHz : Additional I ~ 4.4mA                                              */
  MDR_BKP_0E__SelRI__above_80MHz       = 7,     /*!< above_80MHz : Additional I ~ 19mA                                         */
} MDR_BKP_0E__SelRI__Enum;

/* =============================================  MDR_BKP REG_0E Jtag_A [6..6]  ============================================== */
typedef enum {                                  /*!< MDR_BKP_REG_0E_Jtag_A                                                     */
  MDR_BKP_0E__JtagA__Disable           = 0,     /*!< Disable : Disabled                                                        */
  MDR_BKP_0E__JtagA__Enable            = 1,     /*!< Enable : Enabled                                                          */
} MDR_BKP_0E__JtagA__Enum;

/* =============================================  MDR_BKP REG_0E Jtag_B [7..7]  ============================================== */
typedef enum {                                  /*!< MDR_BKP_REG_0E_Jtag_B                                                     */
  MDR_BKP_0E__JtagB__Disable           = 0,     /*!< Disable : Disabled                                                        */
  MDR_BKP_0E__JtagB__Enable            = 1,     /*!< Enable : Enabled                                                          */
} MDR_BKP_0E__JtagB__Enum;

/* ===========================================  MDR_BKP REG_0E Trim_dDUcc [8..10]  =========================================== */
typedef enum {                                  /*!< MDR_BKP_REG_0E_Trim_dDUcc                                                 */
  MDR_BKP_0E__dDUcc__+0.1              = 0,     /*!< +0.1 : DUcc += 0.1 V                                                      */
  MDR_BKP_0E__dDUcc__+0.06             = 1,     /*!< +0.06 : DUcc += 0.06 V                                                    */
  MDR_BKP_0E__dDUcc__+0.04             = 2,     /*!< +0.04 : DUcc += 0.04 V                                                    */
  MDR_BKP_0E__dDUcc__+0.01             = 3,     /*!< +0.01 : DUcc += 0.01 V                                                    */
  MDR_BKP_0E__dDUcc__-0.01             = 4,     /*!< -0.01 : DUcc -= 0.01 V                                                    */
  MDR_BKP_0E__dDUcc__-0.04             = 5,     /*!< -0.04 : DUcc -= 0.04 V                                                    */
  MDR_BKP_0E__dDUcc__-0.6              = 6,     /*!< -0.6 : DUcc -= 0.06 V                                                     */
  MDR_BKP_0E__dDUcc__-0.1              = 7,     /*!< -0.1 : DUcc -= 0.1 V                                                      */
} MDR_BKP_0E__dDUcc__Enum;

/* =============================================  MDR_BKP REG_0E FPOR [11..11]  ============================================== */
typedef enum {                                  /*!< MDR_BKP_REG_0E_FPOR                                                       */
  MDR_BKP_0E__FPOR__Low                = 0,     /*!< Low : No Bootloader                                                       */
  MDR_BKP_0E__FPOR__High               = 1,     /*!< High : Bootloader completed                                               */
} MDR_BKP_0E__FPOR__Enum;

/* =============================================  MDR_BKP REG_0E MODE [12..14]  ============================================== */
typedef enum {                                  /*!< MDR_BKP_REG_0E_MODE                                                       */
  MDR_BKP_0E__MODE__IntFlash_JtagB     = 0,     /*!< IntFlash_JtagB : Execute from internal flash with Jtag_B                  */
  MDR_BKP_0E__MODE__IntFlash_JtagA     = 1,     /*!< IntFlash_JtagA : Execute from internal flash with Jtag_A                  */
  MDR_BKP_0E__MODE__ExtMem_JtagB       = 2,     /*!< ExtMem_JtagB : Execute from external memory with Jtag_B                   */
  MDR_BKP_0E__MODE__ExtMem_JtagOff     = 3,     /*!< ExtMem_JtagOff : Execute from external memory without any Jtag            */
  MDR_BKP_0E__MODE__Uart_PD01          = 5,     /*!< Uart_PD01 : Uart bootloader, pins PD[1:0]                                 */
  MDR_BKP_0E__MODE__Uart_PF01          = 6,     /*!< Uart_PF01 : Uart bootloader, pins PF[1:0]                                 */
} MDR_BKP_0E__MODE__Enum;

/* ========================================================  REG_0F  ========================================================= */
/* =============================================  MDR_BKP REG_0F LSE_ON [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_BKP_REG_0F_LSE_ON                                                     */
  MDR_RTC__LSE_ON__Off                 = 0,     /*!< Off : Disable state                                                       */
  MDR_RTC__LSE_ON__On                  = 1,     /*!< On : Enable state                                                         */
} MDR_RTC__LSE_ON__Enum;

