StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE9x.h
/* ============================================  MDR_BKP REG_0F HSI_ON [22..22]  ============================================= */
typedef enum {                                  /*!< MDR_BKP_REG_0F_HSI_ON                                                     */
  MDR_BKP_REG_0F_HSI_ON_Off            = 0,     /*!< Off : Disable state                                                       */
  MDR_BKP_REG_0F_HSI_ON_On             = 1,     /*!< On : Enable state                                                         */
} MDR_BKP_REG_0F_HSI_ON_Enum;

/* ============================================  MDR_BKP REG_0F HSI_RDY [23..23]  ============================================ */
typedef enum {                                  /*!< MDR_BKP_REG_0F_HSI_RDY                                                    */
  MDR_BKP_REG_0F_HSI_RDY_NotReady      = 0,     /*!< NotReady : No frequency or unstable                                       */
  MDR_BKP_REG_0F_HSI_RDY_Ready         = 1,     /*!< Ready : Frequency ready                                                   */
} MDR_BKP_REG_0F_HSI_RDY_Enum;

/* ============================================  MDR_BKP REG_0F Standby [30..30]  ============================================ */
typedef enum {                                  /*!< MDR_BKP_REG_0F_Standby                                                    */
  MDR_BKP_REG_0F_Standby_Disable       = 0,     /*!< Disable : Normal mode, DUcc is On                                         */
  MDR_BKP_REG_0F_Standby_Enable        = 1,     /*!< Enable : Standby mode, DUcc is Off                                        */
} MDR_BKP_REG_0F_Standby_Enum;

/* ===========================================  MDR_BKP REG_0F RTC_RESET [31..31]  =========================================== */
typedef enum {                                  /*!< MDR_BKP_REG_0F_RTC_RESET                                                  */
  MDR_BKP_REG_0F_RTC_RESET_Active      = 0,     /*!< Active : RTC active state                                                 */
  MDR_BKP_REG_0F_RTC_RESET_Reset       = 1,     /*!< Reset : RTC in Reset state                                                */
} MDR_BKP_REG_0F_RTC_RESET_Enum;

/* ========================================================  RTC_CNT  ======================================================== */
/* ========================================================  RTC_DIV  ======================================================== */
/* ========================================================  RTC_PRL  ======================================================== */
/* =======================================================  RTC_ALRM  ======================================================== */
/* ========================================================  RTC_CS  ========================================================= */
/* ===============================================  MDR_BKP RTC_CS OWF [0..0]  =============================================== */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_OWF                                                        */
  MDR_BKP_RTC_CS_OWF_Off               = 0,     /*!< Off : No Event                                                            */
  MDR_BKP_RTC_CS_OWF_On                = 1,     /*!< On : Event                                                                */
} MDR_BKP_RTC_CS_OWF_Enum;

/* ==============================================  MDR_BKP RTC_CS SECF [1..1]  =============================================== */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_SECF                                                       */
  MDR_BKP_RTC_CS_SECF_Off              = 0,     /*!< Off : No Event                                                            */
  MDR_BKP_RTC_CS_SECF_On               = 1,     /*!< On : Event                                                                */
} MDR_BKP_RTC_CS_SECF_Enum;

/* ==============================================  MDR_BKP RTC_CS ALRF [2..2]  =============================================== */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_ALRF                                                       */
  MDR_BKP_RTC_CS_ALRF_Off              = 0,     /*!< Off : No Event                                                            */
  MDR_BKP_RTC_CS_ALRF_On               = 1,     /*!< On : Event                                                                */
} MDR_BKP_RTC_CS_ALRF_Enum;

/* =============================================  MDR_BKP RTC_CS OWF_IE [3..3]  ============================================== */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_OWF_IE                                                     */
  MDR_BKP_RTC_CS_OWF_IE_Off            = 0,     /*!< Off : No Event                                                            */
  MDR_BKP_RTC_CS_OWF_IE_On             = 1,     /*!< On : Event                                                                */
} MDR_BKP_RTC_CS_OWF_IE_Enum;

/* =============================================  MDR_BKP RTC_CS SECF_IE [4..4]  ============================================= */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_SECF_IE                                                    */
  MDR_BKP_RTC_CS_SECF_IE_Off           = 0,     /*!< Off : No Event                                                            */
  MDR_BKP_RTC_CS_SECF_IE_On            = 1,     /*!< On : Event                                                                */
} MDR_BKP_RTC_CS_SECF_IE_Enum;

/* =============================================  MDR_BKP RTC_CS ALRF_IE [5..5]  ============================================= */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_ALRF_IE                                                    */
  MDR_BKP_RTC_CS_ALRF_IE_Off           = 0,     /*!< Off : No Event                                                            */
  MDR_BKP_RTC_CS_ALRF_IE_On            = 1,     /*!< On : Event                                                                */
} MDR_BKP_RTC_CS_ALRF_IE_Enum;

/* ===============================================  MDR_BKP RTC_CS WEC [6..6]  =============================================== */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_WEC                                                        */
  MDR_BKP_RTC_CS_WEC_Ready             = 0,     /*!< Ready : Registers available                                               */
  MDR_BKP_RTC_CS_WEC_Busy              = 1,     /*!< Busy : Registers unavailable                                              */
} MDR_BKP_RTC_CS_WEC_Enum;



/* =========================================================================================================================== */
/* ================                                         MDR_UART1                                         ================ */
/* =========================================================================================================================== */

/* ==========================================================  DR  =========================================================== */
/* ================================================  MDR_UART1 DR FE [8..8]  ================================================= */
typedef enum {                                  /*!< MDR_UART1_DR_FE                                                           */
  MDR_UART1_DR_FE_Ok                   = 0,     /*!< Ok : No Error                                                             */
  MDR_UART1_DR_FE_ERROR                = 1,     /*!< ERROR : Error is active                                                   */
} MDR_UART1_DR_FE_Enum;

/* ================================================  MDR_UART1 DR PE [9..9]  ================================================= */
typedef enum {                                  /*!< MDR_UART1_DR_PE                                                           */
  MDR_UART1_DR_PE_Ok                   = 0,     /*!< Ok : No Error                                                             */
  MDR_UART1_DR_PE_ERROR                = 1,     /*!< ERROR : Error is active                                                   */
} MDR_UART1_DR_PE_Enum;

