StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE9x.h
/* =============================================  MDR_UART1 IMSC DCDM_IM [2..2]  ============================================= */
typedef enum {                                  /*!< MDR_UART1_IMSC_DCDM_IM                                                    */
  MDR_UART1_IMSC_DCDM_IM_Off           = 0,     /*!< Off : IRQ Disabled                                                        */
  MDR_UART1_IMSC_DCDM_IM_On            = 1,     /*!< On : IRQ Enabled                                                          */
} MDR_UART1_IMSC_DCDM_IM_Enum;

/* =============================================  MDR_UART1 IMSC DSRM_IM [3..3]  ============================================= */
typedef enum {                                  /*!< MDR_UART1_IMSC_DSRM_IM                                                    */
  MDR_UART1_IMSC_DSRM_IM_Off           = 0,     /*!< Off : IRQ Disabled                                                        */
  MDR_UART1_IMSC_DSRM_IM_On            = 1,     /*!< On : IRQ Enabled                                                          */
} MDR_UART1_IMSC_DSRM_IM_Enum;

/* ==============================================  MDR_UART1 IMSC RX_IM [4..4]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_IMSC_RX_IM                                                      */
  MDR_UART1_IMSC_RX_IM_Off             = 0,     /*!< Off : IRQ Disabled                                                        */
  MDR_UART1_IMSC_RX_IM_On              = 1,     /*!< On : IRQ Enabled                                                          */
} MDR_UART1_IMSC_RX_IM_Enum;

/* ==============================================  MDR_UART1 IMSC TX_IM [5..5]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_IMSC_TX_IM                                                      */
  MDR_UART1_IMSC_TX_IM_Off             = 0,     /*!< Off : IRQ Disabled                                                        */
  MDR_UART1_IMSC_TX_IM_On              = 1,     /*!< On : IRQ Enabled                                                          */
} MDR_UART1_IMSC_TX_IM_Enum;

/* ==============================================  MDR_UART1 IMSC RT_IM [6..6]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_IMSC_RT_IM                                                      */
  MDR_UART1_IMSC_RT_IM_Off             = 0,     /*!< Off : IRQ Disabled                                                        */
  MDR_UART1_IMSC_RT_IM_On              = 1,     /*!< On : IRQ Enabled                                                          */
} MDR_UART1_IMSC_RT_IM_Enum;

/* ==============================================  MDR_UART1 IMSC FE_IM [7..7]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_IMSC_FE_IM                                                      */
  MDR_UART1_IMSC_FE_IM_Off             = 0,     /*!< Off : IRQ Disabled                                                        */
  MDR_UART1_IMSC_FE_IM_On              = 1,     /*!< On : IRQ Enabled                                                          */
} MDR_UART1_IMSC_FE_IM_Enum;

/* ==============================================  MDR_UART1 IMSC PE_IM [8..8]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_IMSC_PE_IM                                                      */
  MDR_UART1_IMSC_PE_IM_Off             = 0,     /*!< Off : IRQ Disabled                                                        */
  MDR_UART1_IMSC_PE_IM_On              = 1,     /*!< On : IRQ Enabled                                                          */
} MDR_UART1_IMSC_PE_IM_Enum;

/* ==============================================  MDR_UART1 IMSC BE_IM [9..9]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_IMSC_BE_IM                                                      */
  MDR_UART1_IMSC_BE_IM_Off             = 0,     /*!< Off : IRQ Disabled                                                        */
  MDR_UART1_IMSC_BE_IM_On              = 1,     /*!< On : IRQ Enabled                                                          */
} MDR_UART1_IMSC_BE_IM_Enum;

/* =============================================  MDR_UART1 IMSC OE_IM [10..10]  ============================================= */
typedef enum {                                  /*!< MDR_UART1_IMSC_OE_IM                                                      */
  MDR_UART1_IMSC_OE_IM_Off             = 0,     /*!< Off : IRQ Disabled                                                        */
  MDR_UART1_IMSC_OE_IM_On              = 1,     /*!< On : IRQ Enabled                                                          */
} MDR_UART1_IMSC_OE_IM_Enum;

/* ==========================================================  RIS  ========================================================== */
/* =============================================  MDR_UART1 RIS RIM_RIS [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_RIS_RIM_RIS                                                     */
  MDR_UART1_RIS_RIM_RIS_Off            = 0,     /*!< Off : Event Inactive                                                      */
  MDR_UART1_RIS_RIM_RIS_On             = 1,     /*!< On : Event Active                                                         */
} MDR_UART1_RIS_RIM_RIS_Enum;

/* =============================================  MDR_UART1 RIS STCM_RIS [1..1]  ============================================= */
typedef enum {                                  /*!< MDR_UART1_RIS_STCM_RIS                                                    */
  MDR_UART1_RIS_STCM_RIS_Off           = 0,     /*!< Off : Event Inactive                                                      */
  MDR_UART1_RIS_STCM_RIS_On            = 1,     /*!< On : Event Active                                                         */
} MDR_UART1_RIS_STCM_RIS_Enum;

