StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE9x.h
/* ==============================================  MDR_UART1 ICR TX_IC [5..5]  =============================================== */
typedef enum {                                  /*!< MDR_UART1_ICR_TX_IC                                                       */
  MDR_UART1_ICR_TX_IC_Inactive         = 0,     /*!< Inactive : Inactive state                                                 */
  MDR_UART1_ICR_TX_IC_Clear            = 1,     /*!< Clear : Clear event                                                       */
} MDR_UART1_ICR_TX_IC_Enum;

/* ==============================================  MDR_UART1 ICR RT_IC [6..6]  =============================================== */
typedef enum {                                  /*!< MDR_UART1_ICR_RT_IC                                                       */
  MDR_UART1_ICR_RT_IC_Inactive         = 0,     /*!< Inactive : Inactive state                                                 */
  MDR_UART1_ICR_RT_IC_Clear            = 1,     /*!< Clear : Clear event                                                       */
} MDR_UART1_ICR_RT_IC_Enum;

/* ==============================================  MDR_UART1 ICR FE_IC [7..7]  =============================================== */
typedef enum {                                  /*!< MDR_UART1_ICR_FE_IC                                                       */
  MDR_UART1_ICR_FE_IC_Inactive         = 0,     /*!< Inactive : Inactive state                                                 */
  MDR_UART1_ICR_FE_IC_Clear            = 1,     /*!< Clear : Clear event                                                       */
} MDR_UART1_ICR_FE_IC_Enum;

/* ==============================================  MDR_UART1 ICR PE_IC [8..8]  =============================================== */
typedef enum {                                  /*!< MDR_UART1_ICR_PE_IC                                                       */
  MDR_UART1_ICR_PE_IC_Inactive         = 0,     /*!< Inactive : Inactive state                                                 */
  MDR_UART1_ICR_PE_IC_Clear            = 1,     /*!< Clear : Clear event                                                       */
} MDR_UART1_ICR_PE_IC_Enum;

/* ==============================================  MDR_UART1 ICR BE_IC [9..9]  =============================================== */
typedef enum {                                  /*!< MDR_UART1_ICR_BE_IC                                                       */
  MDR_UART1_ICR_BE_IC_Inactive         = 0,     /*!< Inactive : Inactive state                                                 */
  MDR_UART1_ICR_BE_IC_Clear            = 1,     /*!< Clear : Clear event                                                       */
} MDR_UART1_ICR_BE_IC_Enum;

/* =============================================  MDR_UART1 ICR OE_IC [10..10]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_ICR_OE_IC                                                       */
  MDR_UART1_ICR_OE_IC_Inactive         = 0,     /*!< Inactive : Inactive state                                                 */
  MDR_UART1_ICR_OE_IC_Clear            = 1,     /*!< Clear : Clear event                                                       */
} MDR_UART1_ICR_OE_IC_Enum;

/* =========================================================  DMACR  ========================================================= */
/* =============================================  MDR_UART1 DMACR RXDMAE [0..0]  ============================================= */
typedef enum {                                  /*!< MDR_UART1_DMACR_RXDMAE                                                    */
  MDR_UART1_DMACR_RXDMAE_Disabled      = 0,     /*!< Disabled : DMA disabled                                                   */
  MDR_UART1_DMACR_RXDMAE_Enabled       = 1,     /*!< Enabled : DMA enabled                                                     */
} MDR_UART1_DMACR_RXDMAE_Enum;

/* =============================================  MDR_UART1 DMACR TXDMAE [1..1]  ============================================= */
typedef enum {                                  /*!< MDR_UART1_DMACR_TXDMAE                                                    */
  MDR_UART1_DMACR_TXDMAE_Disabled      = 0,     /*!< Disabled : DMA disabled                                                   */
  MDR_UART1_DMACR_TXDMAE_Enabled       = 1,     /*!< Enabled : DMA enabled                                                     */
} MDR_UART1_DMACR_TXDMAE_Enum;

/* ============================================  MDR_UART1 DMACR DMAonErr [2..2]  ============================================ */
typedef enum {                                  /*!< MDR_UART1_DMACR_DMAonErr                                                  */
  MDR_UART1_DMACR_DMAonErr_IgnoreError = 0,     /*!< IgnoreError : Ignore Errors                                               */
  MDR_UART1_DMACR_DMAonErr_StopOnError = 1,     /*!< StopOnError : SReq and Req disable on Error                               */
} MDR_UART1_DMACR_DMAonErr_Enum;

/* ==========================================================  TCR  ========================================================== */
/* ===============================================  MDR_UART1 TCR ITEN [0..0]  =============================================== */
typedef enum {                                  /*!< MDR_UART1_TCR_ITEN                                                        */
  MDR_UART1_TCR_ITEN_Disabled          = 0,     /*!< Disabled : Normal operation                                               */
  MDR_UART1_TCR_ITEN_Enabled           = 1,     /*!< Enabled : Testing Mode                                                    */
} MDR_UART1_TCR_ITEN_Enum;

/* =============================================  MDR_UART1 TCR TestFIFO [1..1]  ============================================= */
typedef enum {                                  /*!< MDR_UART1_TCR_TestFIFO                                                    */
  MDR_UART1_TCR_TestFIFO_Disabled      = 0,     /*!< Disabled : Normal operation                                               */
  MDR_UART1_TCR_TestFIFO_Enabled       = 1,     /*!< Enabled : Testing Mode                                                    */
} MDR_UART1_TCR_TestFIFO_Enum;

/* =============================================  MDR_UART1 TCR SIRTest [2..2]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_TCR_SIRTest                                                     */
  MDR_UART1_TCR_SIRTest_Disabled       = 0,     /*!< Disabled : Normal operation                                               */
  MDR_UART1_TCR_SIRTest_Enabled        = 1,     /*!< Enabled : Testing Mode                                                    */
} MDR_UART1_TCR_SIRTest_Enum;



/* =========================================================================================================================== */
/* ================                                        MDR_TIMER1                                         ================ */
/* =========================================================================================================================== */

