StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE9x.h
/* ==========================================  MDR_TIMER1 IE CCR_CAP_CH3_IE [7..7]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_IE_CCR_CAP_CH3_IE                                              */
  MDR_TIMER1_IE_CCR_CAP_CH3_IE_Off     = 0,     /*!< Off : Disable                                                             */
  MDR_TIMER1_IE_CCR_CAP_CH3_IE_On      = 1,     /*!< On : ENable                                                               */
} MDR_TIMER1_IE_CCR_CAP_CH3_IE_Enum;

/* ==========================================  MDR_TIMER1 IE CCR_CAP_CH4_IE [8..8]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_IE_CCR_CAP_CH4_IE                                              */
  MDR_TIMER1_IE_CCR_CAP_CH4_IE_Off     = 0,     /*!< Off : Disable                                                             */
  MDR_TIMER1_IE_CCR_CAP_CH4_IE_On      = 1,     /*!< On : ENable                                                               */
} MDR_TIMER1_IE_CCR_CAP_CH4_IE_Enum;

/* ==========================================  MDR_TIMER1 IE CCR_REF_CH1_IE [9..9]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_IE_CCR_REF_CH1_IE                                              */
  MDR_TIMER1_IE_CCR_REF_CH1_IE_Off     = 0,     /*!< Off : Disable                                                             */
  MDR_TIMER1_IE_CCR_REF_CH1_IE_On      = 1,     /*!< On : ENable                                                               */
} MDR_TIMER1_IE_CCR_REF_CH1_IE_Enum;

/* =========================================  MDR_TIMER1 IE CCR_REF_CH2_IE [10..10]  ========================================= */
typedef enum {                                  /*!< MDR_TIMER1_IE_CCR_REF_CH2_IE                                              */
  MDR_TIMER1_IE_CCR_REF_CH2_IE_Off     = 0,     /*!< Off : Disable                                                             */
  MDR_TIMER1_IE_CCR_REF_CH2_IE_On      = 1,     /*!< On : ENable                                                               */
} MDR_TIMER1_IE_CCR_REF_CH2_IE_Enum;

/* =========================================  MDR_TIMER1 IE CCR_REF_CH3_IE [11..11]  ========================================= */
typedef enum {                                  /*!< MDR_TIMER1_IE_CCR_REF_CH3_IE                                              */
  MDR_TIMER1_IE_CCR_REF_CH3_IE_Off     = 0,     /*!< Off : Disable                                                             */
  MDR_TIMER1_IE_CCR_REF_CH3_IE_On      = 1,     /*!< On : ENable                                                               */
} MDR_TIMER1_IE_CCR_REF_CH3_IE_Enum;

/* =========================================  MDR_TIMER1 IE CCR_REF_CH4_IE [12..12]  ========================================= */
typedef enum {                                  /*!< MDR_TIMER1_IE_CCR_REF_CH4_IE                                              */
  MDR_TIMER1_IE_CCR_REF_CH4_IE_Off     = 0,     /*!< Off : Disable                                                             */
  MDR_TIMER1_IE_CCR_REF_CH4_IE_On      = 1,     /*!< On : ENable                                                               */
} MDR_TIMER1_IE_CCR_REF_CH4_IE_Enum;

/* ========================================  MDR_TIMER1 IE CCR1_CAP_CH1_IE [13..13]  ========================================= */
typedef enum {                                  /*!< MDR_TIMER1_IE_CCR1_CAP_CH1_IE                                             */
  MDR_TIMER1_IE_CCR1_CAP_CH1_IE_Off    = 0,     /*!< Off : Disable                                                             */
  MDR_TIMER1_IE_CCR1_CAP_CH1_IE_On     = 1,     /*!< On : ENable                                                               */
} MDR_TIMER1_IE_CCR1_CAP_CH1_IE_Enum;

/* ========================================  MDR_TIMER1 IE CCR1_CAP_CH2_IE [14..14]  ========================================= */
typedef enum {                                  /*!< MDR_TIMER1_IE_CCR1_CAP_CH2_IE                                             */
  MDR_TIMER1_IE_CCR1_CAP_CH2_IE_Off    = 0,     /*!< Off : Disable                                                             */
  MDR_TIMER1_IE_CCR1_CAP_CH2_IE_On     = 1,     /*!< On : ENable                                                               */
} MDR_TIMER1_IE_CCR1_CAP_CH2_IE_Enum;

/* ========================================  MDR_TIMER1 IE CCR1_CAP_CH3_IE [15..15]  ========================================= */
typedef enum {                                  /*!< MDR_TIMER1_IE_CCR1_CAP_CH3_IE                                             */
  MDR_TIMER1_IE_CCR1_CAP_CH3_IE_Off    = 0,     /*!< Off : Disable                                                             */
  MDR_TIMER1_IE_CCR1_CAP_CH3_IE_On     = 1,     /*!< On : ENable                                                               */
} MDR_TIMER1_IE_CCR1_CAP_CH3_IE_Enum;

/* ========================================  MDR_TIMER1 IE CCR1_CAP_CH4_IE [16..16]  ========================================= */
typedef enum {                                  /*!< MDR_TIMER1_IE_CCR1_CAP_CH4_IE                                             */
  MDR_TIMER1_IE_CCR1_CAP_CH4_IE_Off    = 0,     /*!< Off : Disable                                                             */
  MDR_TIMER1_IE_CCR1_CAP_CH4_IE_On     = 1,     /*!< On : ENable                                                               */
} MDR_TIMER1_IE_CCR1_CAP_CH4_IE_Enum;

/* ========================================================  DMA_RE  ========================================================= */
/* ========================================  MDR_TIMER1 DMA_RE CNT_ZERO_DMAE [0..0]  ========================================= */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE_CNT_ZERO_DMAE                                           */
  MDR_TIMER1_DMA_RE_CNT_ZERO_DMAE_Off  = 0,     /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE_CNT_ZERO_DMAE_On   = 1,     /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE_CNT_ZERO_DMAE_Enum;

/* =========================================  MDR_TIMER1 DMA_RE CNT_ARR_DMAE [1..1]  ========================================= */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE_CNT_ARR_DMAE                                            */
  MDR_TIMER1_DMA_RE_CNT_ARR_DMAE_Off   = 0,     /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE_CNT_ARR_DMAE_On    = 1,     /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE_CNT_ARR_DMAE_Enum;

