StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE9x.h
/* =========================================  MDR_TIMER1 CH1_CNTRL2 CCR1_En [2..2]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH1_CNTRL2_CCR1_En                                             */
  MDR_TIMER1_CH1_CNTRL2_CCR1_En_Off    = 0,     /*!< Off : Disable                                                             */
  MDR_TIMER1_CH1_CNTRL2_CCR1_En_On     = 1,     /*!< On : Enable                                                               */
} MDR_TIMER1_CH1_CNTRL2_CCR1_En_Enum;

/* ==========================================  MDR_TIMER1 CH1_CNTRL2 CCRRLD [3..3]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH1_CNTRL2_CCRRLD                                              */
  MDR_TIMER1_CH1_CNTRL2_CCRRLD_Immediately = 0, /*!< Immediately : Immediately update CCR and CCR1                             */
  MDR_TIMER1_CH1_CNTRL2_CCRRLD_byPreriodCNT = 1,/*!< byPreriodCNT : Update on period completed                                 */
} MDR_TIMER1_CH1_CNTRL2_CCRRLD_Enum;

/* =======================================  MDR_TIMER1 CH1_CNTRL2 CAP_CCR_Fix [4..4]  ======================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH1_CNTRL2_CAP_CCR_Fix                                         */
  MDR_TIMER1_CH1_CNTRL2_CAP_CCR_Fix_Off = 0,    /*!< Off : Inactive                                                            */
  MDR_TIMER1_CH1_CNTRL2_CAP_CCR_Fix_On = 1,     /*!< On : Active                                                               */
} MDR_TIMER1_CH1_CNTRL2_CAP_CCR_Fix_Enum;

/* ======================================================  CH2_CNTRL2  ======================================================= */
/* ==========================================  MDR_TIMER1 CH2_CNTRL2 CHSel1 [0..1]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH2_CNTRL2_CHSel1                                              */
  MDR_TIMER1_CH2_CNTRL2_CHSel1_Rise_Pin = 0,    /*!< Rise_Pin : Capture Event Select                                           */
  MDR_TIMER1_CH2_CNTRL2_CHSel1_Fall_Pin = 1,    /*!< Fall_Pin : Capture Event Select                                           */
  MDR_TIMER1_CH2_CNTRL2_CHSel1_Fall_NextCH = 2, /*!< Fall_NextCH : Capture Event Select                                        */
  MDR_TIMER1_CH2_CNTRL2_CHSel1_Fall_NextNextCH = 3,/*!< Fall_NextNextCH : Capture Event Select                                 */
} MDR_TIMER1_CH2_CNTRL2_CHSel1_Enum;

/* =========================================  MDR_TIMER1 CH2_CNTRL2 CCR1_En [2..2]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH2_CNTRL2_CCR1_En                                             */
  MDR_TIMER1_CH2_CNTRL2_CCR1_En_Off    = 0,     /*!< Off : Disable                                                             */
  MDR_TIMER1_CH2_CNTRL2_CCR1_En_On     = 1,     /*!< On : Enable                                                               */
} MDR_TIMER1_CH2_CNTRL2_CCR1_En_Enum;

/* ==========================================  MDR_TIMER1 CH2_CNTRL2 CCRRLD [3..3]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH2_CNTRL2_CCRRLD                                              */
  MDR_TIMER1_CH2_CNTRL2_CCRRLD_Immediately = 0, /*!< Immediately : Immediately update CCR and CCR1                             */
  MDR_TIMER1_CH2_CNTRL2_CCRRLD_byPreriodCNT = 1,/*!< byPreriodCNT : Update on period completed                                 */
} MDR_TIMER1_CH2_CNTRL2_CCRRLD_Enum;

/* =======================================  MDR_TIMER1 CH2_CNTRL2 CAP_CCR_Fix [4..4]  ======================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH2_CNTRL2_CAP_CCR_Fix                                         */
  MDR_TIMER1_CH2_CNTRL2_CAP_CCR_Fix_Off = 0,    /*!< Off : Inactive                                                            */
  MDR_TIMER1_CH2_CNTRL2_CAP_CCR_Fix_On = 1,     /*!< On : Active                                                               */
} MDR_TIMER1_CH2_CNTRL2_CAP_CCR_Fix_Enum;

/* ======================================================  CH3_CNTRL2  ======================================================= */
/* ==========================================  MDR_TIMER1 CH3_CNTRL2 CHSel1 [0..1]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH3_CNTRL2_CHSel1                                              */
  MDR_TIMER1_CH3_CNTRL2_CHSel1_Rise_Pin = 0,    /*!< Rise_Pin : Capture Event Select                                           */
  MDR_TIMER1_CH3_CNTRL2_CHSel1_Fall_Pin = 1,    /*!< Fall_Pin : Capture Event Select                                           */
  MDR_TIMER1_CH3_CNTRL2_CHSel1_Fall_NextCH = 2, /*!< Fall_NextCH : Capture Event Select                                        */
  MDR_TIMER1_CH3_CNTRL2_CHSel1_Fall_NextNextCH = 3,/*!< Fall_NextNextCH : Capture Event Select                                 */
} MDR_TIMER1_CH3_CNTRL2_CHSel1_Enum;

/* =========================================  MDR_TIMER1 CH3_CNTRL2 CCR1_En [2..2]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH3_CNTRL2_CCR1_En                                             */
  MDR_TIMER1_CH3_CNTRL2_CCR1_En_Off    = 0,     /*!< Off : Disable                                                             */
  MDR_TIMER1_CH3_CNTRL2_CCR1_En_On     = 1,     /*!< On : Enable                                                               */
} MDR_TIMER1_CH3_CNTRL2_CCR1_En_Enum;

/* ==========================================  MDR_TIMER1 CH3_CNTRL2 CCRRLD [3..3]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH3_CNTRL2_CCRRLD                                              */
  MDR_TIMER1_CH3_CNTRL2_CCRRLD_Immediately = 0, /*!< Immediately : Immediately update CCR and CCR1                             */
  MDR_TIMER1_CH3_CNTRL2_CCRRLD_byPreriodCNT = 1,/*!< byPreriodCNT : Update on period completed                                 */
} MDR_TIMER1_CH3_CNTRL2_CCRRLD_Enum;

