StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE9x.h
/* =======================================  MDR_TIMER1 CH3_CNTRL2 CAP_CCR_Fix [4..4]  ======================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH3_CNTRL2_CAP_CCR_Fix                                         */
  MDR_TIMER1_CH3_CNTRL2_CAP_CCR_Fix_Off = 0,    /*!< Off : Inactive                                                            */
  MDR_TIMER1_CH3_CNTRL2_CAP_CCR_Fix_On = 1,     /*!< On : Active                                                               */
} MDR_TIMER1_CH3_CNTRL2_CAP_CCR_Fix_Enum;

/* ======================================================  CH4_CNTRL2  ======================================================= */
/* ==========================================  MDR_TIMER1 CH4_CNTRL2 CHSel1 [0..1]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH4_CNTRL2_CHSel1                                              */
  MDR_TIMER1_CH4_CNTRL2_CHSel1_Rise_Pin = 0,    /*!< Rise_Pin : Capture Event Select                                           */
  MDR_TIMER1_CH4_CNTRL2_CHSel1_Fall_Pin = 1,    /*!< Fall_Pin : Capture Event Select                                           */
  MDR_TIMER1_CH4_CNTRL2_CHSel1_Fall_NextCH = 2, /*!< Fall_NextCH : Capture Event Select                                        */
  MDR_TIMER1_CH4_CNTRL2_CHSel1_Fall_NextNextCH = 3,/*!< Fall_NextNextCH : Capture Event Select                                 */
} MDR_TIMER1_CH4_CNTRL2_CHSel1_Enum;

/* =========================================  MDR_TIMER1 CH4_CNTRL2 CCR1_En [2..2]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH4_CNTRL2_CCR1_En                                             */
  MDR_TIMER1_CH4_CNTRL2_CCR1_En_Off    = 0,     /*!< Off : Disable                                                             */
  MDR_TIMER1_CH4_CNTRL2_CCR1_En_On     = 1,     /*!< On : Enable                                                               */
} MDR_TIMER1_CH4_CNTRL2_CCR1_En_Enum;

/* ==========================================  MDR_TIMER1 CH4_CNTRL2 CCRRLD [3..3]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH4_CNTRL2_CCRRLD                                              */
  MDR_TIMER1_CH4_CNTRL2_CCRRLD_Immediately = 0, /*!< Immediately : Immediately update CCR and CCR1                             */
  MDR_TIMER1_CH4_CNTRL2_CCRRLD_byPreriodCNT = 1,/*!< byPreriodCNT : Update on period completed                                 */
} MDR_TIMER1_CH4_CNTRL2_CCRRLD_Enum;

/* =======================================  MDR_TIMER1 CH4_CNTRL2 CAP_CCR_Fix [4..4]  ======================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH4_CNTRL2_CAP_CCR_Fix                                         */
  MDR_TIMER1_CH4_CNTRL2_CAP_CCR_Fix_Off = 0,    /*!< Off : Inactive                                                            */
  MDR_TIMER1_CH4_CNTRL2_CAP_CCR_Fix_On = 1,     /*!< On : Active                                                               */
} MDR_TIMER1_CH4_CNTRL2_CAP_CCR_Fix_Enum;

/* =========================================================  CCR11  ========================================================= */
/* =========================================================  CCR21  ========================================================= */
/* =========================================================  CCR31  ========================================================= */
/* =========================================================  CCR41  ========================================================= */


/* =========================================================================================================================== */
/* ================                                         MDR_SSP1                                          ================ */
/* =========================================================================================================================== */

/* ==========================================================  CR0  ========================================================== */
/* ================================================  MDR_SSP1 CR0 DSS [0..3]  ================================================ */
typedef enum {                                  /*!< MDR_SSP1_CR0_DSS                                                          */
  MDR_SSP1_CR0_DSS_bits_4              = 3,     /*!< bits_4 : Word of 4 bits                                                   */
  MDR_SSP1_CR0_DSS_bits_5              = 4,     /*!< bits_5 : Word of 5 bits                                                   */
  MDR_SSP1_CR0_DSS_bits_6              = 5,     /*!< bits_6 : Word of 6 bits                                                   */
  MDR_SSP1_CR0_DSS_bits_7              = 6,     /*!< bits_7 : Word of 7 bits                                                   */
  MDR_SSP1_CR0_DSS_bits_8              = 7,     /*!< bits_8 : Word of 8 bits                                                   */
  MDR_SSP1_CR0_DSS_bits_9              = 8,     /*!< bits_9 : Word of 9 bits                                                   */
  MDR_SSP1_CR0_DSS_bits_10             = 9,     /*!< bits_10 : Word of 10 bits                                                 */
  MDR_SSP1_CR0_DSS_bits_11             = 10,    /*!< bits_11 : Word of 11 bits                                                 */
  MDR_SSP1_CR0_DSS_bits_12             = 11,    /*!< bits_12 : Word of 12 bits                                                 */
  MDR_SSP1_CR0_DSS_bits_13             = 12,    /*!< bits_13 : Word of 13 bits                                                 */
  MDR_SSP1_CR0_DSS_bits_14             = 13,    /*!< bits_14 : Word of 14 bits                                                 */
  MDR_SSP1_CR0_DSS_bits_15             = 14,    /*!< bits_15 : Word of 15 bits                                                 */
  MDR_SSP1_CR0_DSS_bits_16             = 15,    /*!< bits_16 : Word of 16 bits                                                 */
} MDR_SSP1_CR0_DSS_Enum;

