StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE9x.h
/* ================================================  MDR_SSP1 CR0 FRF [4..5]  ================================================ */
typedef enum {                                  /*!< MDR_SSP1_CR0_FRF                                                          */
  MDR_SSP1_CR0_FRF_SPI                 = 0,     /*!< SPI : Motorola SPI protocol                                               */
  MDR_SSP1_CR0_FRF_SSI                 = 1,     /*!< SSI : Texas Instruments SSI protocol                                      */
  MDR_SSP1_CR0_FRF_Microwire           = 2,     /*!< Microwire : National Semiconductor Microwire protocol                     */
} MDR_SSP1_CR0_FRF_Enum;

/* ================================================  MDR_SSP1 CR0 SPO [6..6]  ================================================ */
typedef enum {                                  /*!< MDR_SSP1_CR0_SPO                                                          */
  MDR_SSP1_CR0_SPO_Idle_Low            = 0,     /*!< Idle_Low : Idle state is Low                                              */
  MDR_SSP1_CR0_SPO_Idle_High           = 1,     /*!< Idle_High : Idle state is High                                            */
} MDR_SSP1_CR0_SPO_Enum;

/* ================================================  MDR_SSP1 CR0 SPH [7..7]  ================================================ */
typedef enum {                                  /*!< MDR_SSP1_CR0_SPH                                                          */
  MDR_SSP1_CR0_SPH_Leading             = 0,     /*!< Leading : Capture data on leading edge                                    */
  MDR_SSP1_CR0_SPH_Trailing            = 1,     /*!< Trailing : Capture data on trailing edge                                  */
} MDR_SSP1_CR0_SPH_Enum;

/* ==========================================================  CR1  ========================================================== */
/* ================================================  MDR_SSP1 CR1 LBM [0..0]  ================================================ */
typedef enum {                                  /*!< MDR_SSP1_CR1_LBM                                                          */
  MDR_SSP1_CR1_LBM_Normal              = 0,     /*!< Normal : Normal operation                                                 */
  MDR_SSP1_CR1_LBM_LoopBack            = 1,     /*!< LoopBack : TX send to RX test mode                                        */
} MDR_SSP1_CR1_LBM_Enum;

/* ================================================  MDR_SSP1 CR1 SSE [1..1]  ================================================ */
typedef enum {                                  /*!< MDR_SSP1_CR1_SSE                                                          */
  MDR_SSP1_CR1_SSE_Off                 = 0,     /*!< Off : SSP Disable                                                         */
  MDR_SSP1_CR1_SSE_On                  = 1,     /*!< On : SSP Enable                                                           */
} MDR_SSP1_CR1_SSE_Enum;

/* ================================================  MDR_SSP1 CR1 MS [2..2]  ================================================= */
typedef enum {                                  /*!< MDR_SSP1_CR1_MS                                                           */
  MDR_SSP1_CR1_MS_Master               = 0,     /*!< Master : Master Mode                                                      */
  MDR_SSP1_CR1_MS_Slave                = 1,     /*!< Slave : Slave Mode                                                        */
} MDR_SSP1_CR1_MS_Enum;

/* ================================================  MDR_SSP1 CR1 SOD [3..3]  ================================================ */
typedef enum {                                  /*!< MDR_SSP1_CR1_SOD                                                          */
  MDR_SSP1_CR1_SOD_SlaveTxEna          = 0,     /*!< SlaveTxEna : Slave mode transmit enable                                   */
  MDR_SSP1_CR1_SOD_SlaveTxDis          = 1,     /*!< SlaveTxDis : Slave mode transmit disable                                  */
} MDR_SSP1_CR1_SOD_Enum;

/* ==========================================================  DR  =========================================================== */
/* ==========================================================  SR  =========================================================== */
/* ================================================  MDR_SSP1 SR TFE [0..0]  ================================================= */
typedef enum {                                  /*!< MDR_SSP1_SR_TFE                                                           */
  MDR_SSP1_SR_TFE_TX_NotEmpty          = 0,     /*!< TX_NotEmpty : FIFO_TX is Not Empty                                        */
  MDR_SSP1_SR_TFE_TX_Empty             = 1,     /*!< TX_Empty : FIFO_TX is Empty                                               */
} MDR_SSP1_SR_TFE_Enum;

/* ================================================  MDR_SSP1 SR TNF [1..1]  ================================================= */
typedef enum {                                  /*!< MDR_SSP1_SR_TNF                                                           */
  MDR_SSP1_SR_TNF_TX_Full              = 0,     /*!< TX_Full : FIFO_TX is Full                                                 */
  MDR_SSP1_SR_TNF_TX_NotFull           = 1,     /*!< TX_NotFull : FIFO_TX is Not Full                                          */
} MDR_SSP1_SR_TNF_Enum;

/* ================================================  MDR_SSP1 SR RNE [2..2]  ================================================= */
typedef enum {                                  /*!< MDR_SSP1_SR_RNE                                                           */
  MDR_SSP1_SR_RNE_RX_NotEmpty          = 0,     /*!< RX_NotEmpty : FIFO_RX is Empty                                            */
  MDR_SSP1_SR_RNE_RX_Empty             = 1,     /*!< RX_Empty : FIFO_RX is Not Empty                                           */
} MDR_SSP1_SR_RNE_Enum;

/* ================================================  MDR_SSP1 SR RFF [3..3]  ================================================= */
typedef enum {                                  /*!< MDR_SSP1_SR_RFF                                                           */
  MDR_SSP1_SR_RFF_RX_NotFull           = 0,     /*!< RX_NotFull : FIFO_RX is Not Full                                          */
  MDR_SSP1_SR_RFF_RX_Full              = 1,     /*!< RX_Full : FIFO_RX is Full                                                 */
} MDR_SSP1_SR_RFF_Enum;

/* ================================================  MDR_SSP1 SR BSY [4..4]  ================================================= */
typedef enum {                                  /*!< MDR_SSP1_SR_BSY                                                           */
  MDR_SSP1_SR_BSY_Idle                 = 0,     /*!< Idle : FIFO_RX is Not Full                                                */
  MDR_SSP1_SR_BSY_Busy                 = 1,     /*!< Busy : Transfering                                                        */
} MDR_SSP1_SR_BSY_Enum;

/* =========================================================  CPSR  ========================================================== */
/* =========================================================  IMSC  ========================================================== */
/* ==============================================  MDR_SSP1 IMSC RORIM [0..0]  =============================================== */
typedef enum {                                  /*!< MDR_SSP1_IMSC_RORIM                                                       */
  MDR_SSP1_IMSC_RORIM_NoEvent          = 0,     /*!< NoEvent : Flag Inactive                                                   */
  MDR_SSP1_IMSC_RORIM_RX_Overrun       = 1,     /*!< RX_Overrun : Flag Active                                                  */
} MDR_SSP1_IMSC_RORIM_Enum;

